{
    "count": 11,
    "next": "https://atila-7.herokuapp.com/api/essay/essays/?page=2",
    "previous": null,
    "results": [
        {
            "id": 9,
            "title": "Ivey AEO Application 2016",
            "slug": "ivey-aeo-application-2016",
            "body": "<div title=\"Page 1\">\r\n<div>\r\n<h3>&nbsp;</h3>\r\n<h3>Section 5: Activities&nbsp;</h3>\r\n<p>&nbsp;</p>\r\n<p><strong>Consider all the extracurricular activities (community involvement, paid and/or volunteer work experience, entrepreneurial ventures) that you have been involved in during the past four years. Select three activities that you feel demonstrate your leadership abilities best. Focus your description on elements that demonstrate: teamwork, initiative, achievement, commitment and breadth. Each description should focus on one activity only.</strong></p>\r\n</div>\r\n<div>\r\n<p><strong>For the main activity description, use an essay format, NOT bullet points. Please limit your description for each activity to 500 words. We recommend you type up and edit your essays in a separate word processing program and then copy and paste into the description field when you are satisfied that it is complete.</strong></p>\r\n<p>&nbsp;</p>\r\n<h3><strong>Black History Month Association</strong></h3>\r\n<p>&nbsp;</p>\r\n<div title=\"Page 1\">\r\n<div>\r\n<div>\r\n<div>\r\n<p>The Black History Month Association (BHMA) is a student group that coordinates activities to celebrate Black History Month throughout February of every year. Since 2012, I have taken on various roles such as performing a flash mob in grade nine, directing a school wide video in grade ten and organizing an African food festival for the school in grade eleven.</p>\r\n</div>\r\n</div>\r\n<div>\r\n<div>\r\n<p>By Grade 12, the teacher who regularly organized the group was transferred and BHMA was automatically disbanded. I saw that immediate action needed to be taken and I sprang into action in search of a new supervisor, approaching several teachers and explaining to them the importance of BHMA. After a lot of searching and being told no, I remained persistent and eventually convinced the school chaplain to supervise us. However, I quickly saw that the role of the teacher supervisor was simply a formality and realized I would have to take on more significant responsibilities.</p>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n<div title=\"Page 2\">\r\n<div>\r\n<div>\r\n<p>Since our school changed principals this school year, my first step was to talk to the new principal for support and permission to run the club. Immediately after receiving their approval, I recruited former members and talked with the student council about having a booth at the club fair. With just me and a few returning members working together to run a booth, we impressed the teachers and students with our vision as a group, our display and our passion, winning us first place(and a pizza party as a reward) at the club fair out of over 30 clubs.</p>\r\n</div>\r\n</div>\r\n<div>\r\n<div>\r\n<p>As the president of BHMA I plan the meetings, oversee the subcommittees, handle the logistics and most importantly provide the goal and direction for the group. Since this is a student led group and is a peer leading peer environment, a key factor in our success is the mutual respect shared between the members and I. Although I take the lead on most decisions, our driving force is the contributions of all the members in building the vision and accomplishing the tasks.</p>\r\n</div>\r\n</div>\r\n<div>\r\n<div>\r\n<p>One of the goals I&rsquo;ve set out for BHMA this year is addressing the mistreatment of individuals in society occurring on the basis of not only race but also religion, gender and heritage. In order to address this issue we have focused on the universal aspects of prejudice and developed a message of empowerment, diversity and equality that can impact the whole student body which transcends the struggles of just one race.</p>\r\n</div>\r\n</div>\r\n<div>\r\n<p>Since many schools in my board lack innovative diversity programs throughout black history month, I observed that there was a need to spread our message and extend our impact beyond the school walls. I began contacting student leaders and teachers from other schools in the board, requesting to visit their school and share our message of empowerment. I have already received two response and we are very excited to be working with two other high school within the board to plan events!</p>\r\n<p>&nbsp;</p>\r\n<div title=\"Page 2\">\r\n<h3>DECA</h3>\r\n<div title=\"Page 2\">\r\n<div>\r\n<div>\r\n<div>\r\n<p>DECA is an international organization that organizes business competitions covering different areas of the industry. I joined my school&rsquo;s DECA Chapter (club) in grade 11 when I had little knowledge as to what it was other than it was a business competition that would require creativity and logical thinking. It was presented as being a highly competitive event that required hard work but provided participants with a keen sense of accomplishment. I was easily motivated to become a part of this as I enjoy overcoming challenges and succeeding in unlikely areas.</p>\r\n</div>\r\n</div>\r\n<div>\r\n<div>\r\n<p>Upon first joining, I signed&shy;up to compete with a partner as I saw this as an opportunity to learn from another ambitious student. With neither of us having yet taken a real business course at school, we had no choice but to put in countless hours to make up for the lack of experience. We were very committed meeting several times a week, on our lunches, after school and on the weekends, practicing sample case studies and studying business terms and concepts. Our hard work payed off as we scored a 90 on the role play, qualified for provincials and I won an award for having one of the highest exam scores in my event!</p>\r\n</div>\r\n</div>\r\n<div>\r\n<div>\r\n<p>After a successful run at the regional and provincial competitions, the teacher advisor took note of my dedication, hard work and strong competition skills and put me on the executive team as the executive administrator last year for the 2015/2016 school year. While this was an honor, it came with a lot of commitment and responsibility. We had already begun planning meetings and setting goals for this school year in the 2014/2015 school year and even met during the summer to finalize details. In addition to that we organized weekly fundraisers, selling pizza and summer, averaging profits of about $40 per week.</p>\r\n</div>\r\n</div>\r\n<div>\r\n<div>\r\n<p>One unique quality of my executive team is the care in which we take in ensuring the success of ALL members. In effort of this, we are given members to mentor and guide. I mentor three grade nine DECA members by following up on their progress, providing them feedback and giving them access to resources that will assist them. In addition to this, I was chosen by the other executive members to be in charge of exam training due to the fact that last year I was the only chapter member to be an exam finalist. Ultimately, almost HALF of our club was a finalist for the exams at regionals this year, including myself for the second year in a row.</p>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n<div title=\"Page 3\">\r\n<p>DECA has allowed me to gain realistic business knowledge and develop an appreciation of different business models. Being an executive has displayed my leadership skills, being a participant has exemplified my work ethic and commitment and being a mentor has taught me to motivate and has built my understanding of the importance of collective success.</p>\r\n<p>&nbsp;</p>\r\n<div title=\"Page 3\">\r\n<h3>Student Athletic Association</h3>\r\n<p>&nbsp;</p>\r\n<div title=\"Page 3\">\r\n<div>\r\n<div>\r\n<div>\r\n<p>I joined The Student Athletic Association (SAA) in grade 10 because I believed it was an opportunity for me to combine my passion for sports with my desire for leadership. However, upon becoming a part of this group I quickly discovered that it had very little to do with the athletics and more to do with truly defining what it meant to be a part of the Bishop Reding (my school) community. Over the past three years I have been deeply involved with SAA and have been given the privilege of being selected, out of many applicants, to be a part of the executive team for my grade 11 and 12 year.</p>\r\n</div>\r\n</div>\r\n<div>\r\n<div>\r\n<p>I am the executive of communications; therefore my first priority is to ensure the awareness of SAA&rsquo;s presence in the school. This primarily means finding the best way to keep the student body informed of what we&rsquo;re planning and how best to inspire them to be a part of it. In addition to working within communications I also contribute towards many SAA initiatives such as Pink Week, Spirit Week, Bullying Awareness, Movember (awareness for men&rsquo;s cancer) and the Athletic Banquet. One of the most notable of these events is Pink week in which we develop ideas that support breast cancer awareness and raise money for the breast cancer foundation. I partake in the sales team in which I have assisted in developing methods that we can use to raise money for the breast cancer foundation such as school buy&shy;outs, pink days and shirt sales, raising thousands of dollars over the past three years. This year, our goal had been to raise $2,000 and surpassed this mark by rising over $5000.</p>\r\n</div>\r\n</div>\r\n<div>\r\n<div>\r\n<p>SAA plans many large scale events and by being a part of all these events, I have experienced the importance of many people coming together to accomplish one objective. While I have taken part in organizing events outside of SAA, the magnitude of the events which SAA produces has taught me the importance of strong communication and teamwork in large scale initiatives.&nbsp;</p>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n<p>&nbsp;</p>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>",
            "date_created": "2019-04-05T15:26:26Z",
            "description": "My application for the AEO program at Ivey Business School in 2016.",
            "status": "accepted",
            "status_other": "",
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F9%2FAEO-App.pdf%20copy.pdf?alt=media&token=40b467d6-7118-49ca-b74a-b227dcd366de",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Oreoluwakitan",
                "last_name": "Ademidun",
                "username": "orekitan",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F31%2Fkitan-profile-pic.jpg?alt=media&token=d013a1f1-196e-415b-93e8-7b7597bc4d1b",
                "id": 31
            },
            "contributors": []
        },
        {
            "id": 10,
            "title": "Western National Scholarship Essay 2014",
            "slug": "western-national-scholarship-essay-2014",
            "body": "<div title=\"Page 2\">\r\n<div>\r\n<div>\r\n<h1>Importance of Equal Education in Nigeria</h1>\r\n<p><br />The world we live in is not a fair place and we are not all born into this world through ideal circumstances. Despite Thomas Jefferson&rsquo;s idealistic sentiment, all men are not created equal and not all people are privy to equal opportunities. This grim reality is illustrated in most places in the world, but especially true in third world countries. The country whose interests are dearest to my heart is the Federal Republic of Nigeria.</p>\r\n<p>&nbsp;</p>\r\n<p>Nigeria is a classic example of a nation where the divisions between the upper and lower classes are exceptionally stark and the divisions are exacerbated by a dwindling middle class. I won&rsquo;t discuss philosophically whether or not it is fair that certain people are born into greater privilege than others because that is simply an unfortunate but unavoidable fact of life. However, I am greatly concerned by the lottery we play in Nigeria concerning the education of our youth. This unequal access to education is the origin of what perpetuates classist divisions in Nigeria.</p>\r\n<p>&nbsp;</p>\r\n<p>To truly understand how severe the social divide in Nigeria is, consider these facts: Nigeria is the fifth largest petroleum exporter in the world (CIA, 2010). Approximately 142,000 Nigerians visited the UK in 2011, spending an average $172 per day on luxuries like designer clothes and shoes(Elbagir, 2013) and if the $1.5 million that Nigerians spent on UK schools was spent in Nigeria, this would amount to 60% of their educational budget (&ldquo;Why Nigerians Prefer Schooling Abroad&rdquo;, 2013). We must ask ourselves how it is possible that a country with such wealth also has 72 % of its population living on a dollar a day or less (Unesco, 2013), a 51% illiteracy rate (Unesco, 2013), and a mere 4% of secondary school students go on to enter post-secondary institution five years after graduating (Unesco, 2013).</p>\r\n<p>&nbsp;</p>\r\n<p>The primary cause of this statistical inequity is one which has plagued humans since the beginning of time, the human weakness of greed. Echoing, biblical history when Judas betrayed Jesus for thirty silver shekels, Nigerian politicians betray their own people for millions of dollars a year.</p>\r\n<p>&nbsp;</p>\r\n<p>There was a time when Nigerian schools delivered an effective education to the extent that there was little difference between sending your children to a local school and sending your children to a school abroad. There was also little distinction between a child who had been educated at a public school and one who had attended a private school because the public school system was quite strong. However, problems slowly began to arise after Nigeria gained independence from the British in 1967. What followed was a mad grab for power, similar to a more chaotic version of the oligarchy/privatization of Russia in the 1980&rsquo;s, through numerous military coups.</p>\r\n<p>&nbsp;</p>\r\n<p>As the British became less involved in Nigerian affairs, Nigerian politicians felt more liberated to channel public funds into personal accounts. Individuals in the private sector with the capability to oppose this injustice were content with sending their children to highly exclusive private schools while the dwindling middle and lower classes were left to send their children to schools that would not effectively prepare them for future jobs. Today, many Nigerians who have achieved financial stability are too worried about maintaining their wealth to be concerned about the welfare of the lower class.</p>\r\n<p>&nbsp;</p>\r\n<p>Unfortunately, I am not convinced that we as Nigerians are prepared to solve this problems by ourselves and the task of resolving this issue will have to fall on the proverbial shoulders of international non-profit organizations such as the Bill and Melinda Gates Foundation or the Rockefeller Foundation. I have a long-term vision to revamp the education system in Nigeria, and other third world nations, to ensure that everyone in this world is given a fair chance to strive for their goals. The organization would be based in a major Nigerian city such as Lagos and would be open to boys and girls ages 14-17 across the country, with future plans to expand across the continent. The initiative would be funded by donations and possibly by levying taxes on the top earners in Nigeria (by implementing luxury taxes and taxes on certain private schools).</p>\r\n<p>&nbsp;</p>\r\n<p>I believe that the Nigerian government would be willing to support such an initiative because of the potential recognition and voter support that they would receive. The initiative would also be funded by corporate donations from companies seeking tax write-offs and improved public relations. The aim of improved Nigerian schools would not be for students to simply graduate secondary school but for these graduates to attend world class universities across the globe. The non-profits could create partnerships with universities around the world whereby students coming from the schools would be able to enter for a discounted tuition rate, which would be subsidized my scholarships. If this initiative were to become successful the benefits would transcend beyond Nigeria and would be a source of inspiration for any nation with a struggling education system, especially third world counties.</p>\r\n<p>&nbsp;</p>\r\n<p>This model is not limited in its applicability to Nigeria, but rather could be applied in developing countries all over the world because education is a right which all human beings deserve access to. I believe that this is the most important human need, after basic needs such as food, clothing, and shelter have been met. Education is so important because it provides people with an opportunity to live better lives in the long term rather than simply giving them enough to survive today. Education is what I like to call the great equalizer and one must simply look at human history within the last fifty years to understand the true value of an education. Without access to a strong, affordable education, Barack Obama would not be the president of the United States.</p>\r\n<p>&nbsp;</p>\r\n<p>While, some may argue that Barack Obama is a rare exception and very few people have the means to go to Harvard, it is also important to understand that without a quality secondary school education he would not have even had the opportunity to earn the spot at Occidental College or Columbia University which eventually led him to Harvard. This is essentially the purpose of receiving an education, it provides people with a fair chance to strive for a better life with a better understanding of the value of education as a means to achieve it, and with the opportunity to reciprocate and allow others to experience the same advantages. The old adage comes to mind: give a man fish and you feed him for a day, teach a man to fish and you feed him for a lifetime. I would be so bold as to add that when we provide people with a sufficient education, we give them a fair opportunity to feed themselves, their peers and future generations.</p>\r\n</div>\r\n</div>\r\n</div>\r\n<div title=\"Page 5\">\r\n<p>&nbsp;</p>\r\n<p>[Word Count: 1,134]</p>\r\n</div>",
            "date_created": "2019-04-05T15:23:12Z",
            "description": "My application for the Western National Scholarship Essay program in 2014.\nI didn't win this scholarship 😕.",
            "status": "declined",
            "status_other": "",
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F10%2FWestern%20National%20Scholarship%20Essay.pdf?alt=media&token=33478c6e-a980-4204-a103-2e1e986c4265",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Tomiwa",
                "last_name": "Ademidun",
                "username": "tomiwa",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fljy9s5nm-Ezc5Hyf.jpg?alt=media&token=2391816e-c546-4b11-b232-0cc91f9f3547",
                "id": 1
            },
            "contributors": []
        },
        {
            "id": 8,
            "title": "Ivey AEO2 Activity Report 2017",
            "slug": "ivey-aeo2-activity-report-2017",
            "body": "<p dir=\"ltr\">Teamwork: how you worked with others to achieve a goal</p>\r\n<p dir=\"ltr\">Initiative: how you introduced or facilitated something</p>\r\n<p dir=\"ltr\">Achievement: what you accomplished</p>\r\n<p dir=\"ltr\">Commitment: the time that you have invested</p>\r\n<p dir=\"ltr\">Breadth: variety in your interests</p>\r\n<p dir=\"ltr\">&nbsp;</p>\r\n<h2 dir=\"ltr\">PBSN &ndash; Members&rsquo; Network Second Year Leader</h2>\r\n<h4 dir=\"ltr\">September 2016 &ndash; April 2017</h4>\r\n<p dir=\"ltr\">From being a first year mentee to becoming a Second Year Leader, my experience in the Pre-Business Students&rsquo; Network&rsquo;s (PBSN) Members&rsquo; Network has been an invaluable and enriching experience. When I initially decided to become a mentor, I believed that the purpose of mentorship was to impart my own knowledge and experience to others so as to help them to succeed. However, my journey as a mentor has taught me that successful mentorship does not have to conform to a set of guidelines or follow a similar path as other successful mentorships; success can be as simple as being there for someone when they are struggling and knowing when to offer support and help.</p>\r\n<p dir=\"ltr\">In the beginning, one of the biggest challenges that the other mentors and I faced was the lack of engagement from our mentees in response to our attempts at interaction. While the other mentors slowly became more withdrawn from the group due to the lack of &nbsp;response, I persisted in reaching out to my mentees individually in an effort to break down the communication barrier. Through these one-on-one interactions, I succeeded in fostering an environment of trust and open communication with each of my mentees, thus making them feel more comfortable reaching out to me for help and interacting with the other group members.</p>\r\n<p dir=\"ltr\">As a mentor, I believed that it was important to assist my mentees in achieving their full academic and career potential, which was why I initially focused on providing them with advice and resources pertaining to school, networking, and extracurriculars. However, when one of my mentees told me that his lung had collapsed and that he was in the hospital for lung surgery, I realized that the mentorship he needed most was emotional support and encouragement. After visiting him and talking to him about his mental and physical health, we worked out a number of short-term and long-term goals that would help him to stay on track during his road to recovery. In addition, I connected him with a friend of mine who had gone through a similar experience during first year to provide him with first-hand advice on how to cope with the situation. I also reached out to one of the Residence Advisors in his residence to ensure that there was always someone available to provide help and support.</p>\r\n<p dir=\"ltr\">This experience has taught me that while all mentors can provide academic and career advice, only successful mentors will be able to recognize and understand the kind of support and guidance that their mentees truly need. Since then, I regularly check in on all of my mentees to see how they are doing in terms of school and extracurriculars, but most importantly, to provide them with support and encouragement and to let them know that I am there for them. I feel that by persevering in reaching out to them, it has led to a stronger bond between us, which makes my experience as a mentor truly rewarding.</p>\r\n<p dir=\"ltr\">&nbsp;</p>\r\n<p><strong id=\"docs-internal-guid-096b3560-7fff-b73c-cf3b-e474daf21596\">&nbsp;</strong></p>\r\n<p dir=\"ltr\">\f</p>\r\n<p dir=\"ltr\"><strong>Teamwork: how you worked with others to achieve a goal</strong></p>\r\n<p dir=\"ltr\"><strong>Initiative: how you introduced or facilitated something</strong></p>\r\n<p dir=\"ltr\"><strong>Achievement: what you accomplished</strong></p>\r\n<p dir=\"ltr\"><strong>Commitment: the time that you have invested</strong></p>\r\n<p dir=\"ltr\"><strong>Breadth: variety in your interests</strong></p>\r\n<p><strong>&nbsp;</strong></p>\r\n<h2 dir=\"ltr\">Meal Exchange &ndash; Media and Promotions Executive</h2>\r\n<h4 dir=\"ltr\">October 2016 &ndash; April 2017</h4>\r\n<p>&nbsp;</p>\r\n<p dir=\"ltr\">Being a part of the Meal Exchange executive team has allowed me to challenge myself in a variety of settings and roles and to be more creative in my problem-solving. As a Media and Promotions Executive, I am able to take a more active and hands-on approach to event planning by creating the graphics for our promotional materials and devising promotional campaigns for our events.</p>\r\n<p dir=\"ltr\">In the beginning of the year, one of the problems that we faced was not budgeting enough time for the creation of promotional graphics for our events, which often led to delays in the release of promotions, poorly executed marketing campaigns, and lower reach and event turnout. In order to resolve this issue, I designed a set of poster templates in advance that only required the date, time and location to be filled out for each of our upcoming events. Through this initiative, I was able to establish a more efficient and less time-consuming process for our department and, as a result, we were able to release our promotions earlier on and generate more exposure for our events.</p>\r\n<p dir=\"ltr\">This year, Meal Exchange held its most successful Trick or Eat campaign yet and succeeded in collecting over 1356 lbs of non-perishable food items for the London Food Bank. This achievement was a result of the collective efforts of our departments in organizing the event as well as our extensive promotional efforts on campus and via social media. Through our marketing initiatives, we were able to attract over 80 volunteers to the event, which enabled us to generate more awareness within the community in regards to our initiatives and further expand the reach of our organization.</p>\r\n<p dir=\"ltr\">One of Meal Exchange&rsquo;s main initiatives is our volunteering trips to Ark Aid Street Mission, an organization in London which provides food and clothing to people and families in need. On one of these trips, I was assigned to serve coffee and tea alongside two other volunteers while pushing around a small trolley. In the beginning, each of us were in charge of asking a specific person for their order and then proceeding to fill the order separately; however, I soon noticed that some of the patrons were beginning to feel impatient with the pace that we were going at and were becoming more agitated at the servers. In order to remedy the situation, I suggested that each person take charge of a specific step in the process so as to form an assembly line. By implementing my suggestion, we were able to remove the inefficiencies that we had and increase the pace and speed of our service, which led to higher customer satisfaction. &nbsp;</p>\r\n<p dir=\"ltr\">My involvement in Meal Exchange has taught me the importance of being able to identify situations that warrant improvement and taking the initiative to affect those changes. Moreover, as a Media and Promotions Executive, I was able to be more creative and versatile in my endeavours and make a difference in the community and within my organization.</p>\r\n<p dir=\"ltr\">&nbsp;</p>\r\n<p dir=\"ltr\">\f</p>\r\n<p dir=\"ltr\"><strong>Teamwork: how you worked with others to achieve a goal</strong></p>\r\n<p dir=\"ltr\"><strong>Initiative: how you introduced or facilitated something</strong></p>\r\n<p dir=\"ltr\"><strong>Achievement: what you accomplished</strong></p>\r\n<p dir=\"ltr\"><strong>Commitment: the time that you have invested</strong></p>\r\n<p dir=\"ltr\"><strong>Breadth: variety in your interests</strong></p>\r\n<p><strong>&nbsp;</strong></p>\r\n<h2 dir=\"ltr\">Chinese International Volunteer Organization (CIVO) &ndash; Public Relations Executive</h2>\r\n<h4 dir=\"ltr\">October 2016 &ndash; April 2017</h4>\r\n<p dir=\"ltr\">&nbsp;</p>\r\n<p dir=\"ltr\">Joining the Chinese International Volunteer Organization (CIVO) as a Public Relations Executive has given me an opportunity to grow on both a personal and professional level. Not only was I able to push myself to take risks and break down communication barriers but I was also able to play a crucial role in the development of this organization and the fulfillment of its visions and goals.</p>\r\n<p dir=\"ltr\">When I first joined CIVO, one of the challenges that I faced was having to communicate primarily in Chinese with the rest of the team, which was a foreign experience for me. Rather than choosing to back down from the challenge, however, I was motivated to utilize my fluency in English and my knowledge of Chinese to impact the organization in a unique way. My contributions to CIVO has made me an integral part of the organization and I am now depended upon by my fellow executives to translate promotional materials between English and Chinese, produce and edit English versions of documents, and reach out to a more diverse audience through my own social networks. As a result, I am able to act as a link between the two cultures and gain a better understanding of both languages.</p>\r\n<p dir=\"ltr\">Although my team and I are mainly responsible for reaching out to local organizations in regards to volunteering and collaborative initiatives, we often work in conjunction with many of the other departments to plan events, create marketing campaigns, and coordinate budgets for our initiatives. Furthermore, each department works closely with one another to shape the strategic direction of our organization. Over the past few months, we have seen significant progress towards our goal of increasing brand awareness and recognition within the London community, with a growth in membership of over 100 members. This change can be attributed to the extensive promotional efforts of our entire executive team as well as my personal advocacy of our initiatives through social media and word-of-mouth.</p>\r\n<p dir=\"ltr\">In order to generate more exposure for our organization amongst students, I would often act as a liaison between CIVO and other clubs on campus such as Meal Exchange to discuss partnership opportunities and proposals for event collaborations. In addition, I would relay information regarding volunteer opportunities held by other organizations to our members in an effort to encourage them to take on a more active role within the community. By reaching out to various other organizations and community groups and leveraging my own social networks, I was able to assist CIVO in expanding our reach to a more diverse demographic.</p>\r\n<p dir=\"ltr\">Despite being a fairly new organization, I believe that through the perseverance and dedication of our members, CIVO will be able to positively impact the community through its initiatives. All in all, having the opportunity to play such a crucial role within the organization has taught me the importance of being open to new opportunities and embracing my own capabilities.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\">\f</p>\r\n<p dir=\"ltr\"><strong>Chatime</strong></p>\r\n<p dir=\"ltr\">- Proactively works side by side with upper levels of management to ensure consistent, high quality customer service is presented to each client</p>\r\n<p dir=\"ltr\">- Effectively utilizes both English and Chinese to educate customers on company products and policies</p>\r\n<p dir=\"ltr\">- Proficiently operates store POS system to facilitate financial transactions including cash, debit/credit, coupon redemption and discounts</p>\r\n<p dir=\"ltr\">- Consistently maintains a strong understanding of company values and customer needs, responding quickly to complex requests in a fast-paced environment</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\"><strong>Real Fruit Bubble Tea</strong></p>\r\n<p dir=\"ltr\">- Responsible for opening and closing the store as per company procedures with an attention to detail &nbsp;</p>\r\n<p dir=\"ltr\">- Diligently maintained store front cleanliness and proper inventory levels at all times while handling front of store operations</p>\r\n<p dir=\"ltr\">- Prepared and served drinks in accordance with company standards while ensuring customer satisfaction</p>\r\n<p dir=\"ltr\">- Oversaw team members and developed best practices to balance workload during peak hours</p>\r\n<p>&nbsp;</p>",
            "date_created": "2019-04-05T15:13:41Z",
            "description": "My AEO2 activity report for Ivey Business School. This is a report of extra curricular activities I participated in while in university in the AEO program as part of my progression requirements for starting the HBA program in 3rd year.",
            "status": "accepted",
            "status_other": "",
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F8%2FIvey%20AEO2%20Activity%20Report.pdf?alt=media&token=84488d88-074e-46a1-8d07-a15b386ac059",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": [
                {
                    "id": 1,
                    "slug": "ivey-business-school-aeo2-application-2016",
                    "user": {
                        "id": 1,
                        "title": "Software Engineering Student",
                        "username": "tomiwa",
                        "last_name": "Ademidun",
                        "first_name": "Tomiwa",
                        "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fprofile-pictures%2Ffacebook-profile-picture.jpg?alt=media&token=8754c657-bbdc-4d8e-ae1d-d4047ac09c6d",
                        "secondary-school": "",
                        "post_secondary_school": "Algoma University"
                    },
                    "title": "Ivey Business School AEO2 Application 2016",
                    "description": "My AEO2 University application for Ivey Business School 2016.\nThis is the application I submitted after my 2nd year of university to keep my spot in the HBA1 as part of the AEO program.\n           I applied to the software engineering and business program. \n\nThe admissions person I talked to mentioned they cared a lot about community involvement and leadership which I tried to highlight in the first 2 examples.",
                    "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F1%2FIvey%20AEO2%20Application.pdf?alt=media&token=a8058c38-6baa-4e64-addf-6c0eb8f56e89"
                },
                {
                    "id": 6,
                    "slug": "ivey-business-school-aeo-application-2015",
                    "user": {
                        "id": 626,
                        "title": "",
                        "username": "OkPaul",
                        "last_name": "Okundaye",
                        "first_name": "Paul",
                        "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F626%2Fprofile-pictures%2Fpaul-profile-picture.png?alt=media&token=60650357-56f2-4a97-8416-08b08fbbc4aa",
                        "secondary-school": "",
                        "post_secondary_school": "Ivey Business School"
                    },
                    "title": "Ivey Business School AEO Application 2015",
                    "description": "As part of my AEO application to the Ivey Business School I had to submit an essay describing 3 activities in which I was involved. I also tried to highlight how each activity showcases my leadership skills.",
                    "essay_source_url": null
                },
                {
                    "id": 9,
                    "slug": "ivey-aeo-application-2016",
                    "user": {
                        "id": 31,
                        "title": "",
                        "username": "orekitan",
                        "last_name": "Ademidun",
                        "first_name": "Oreoluwakitan",
                        "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F31%2Fkitan-profile-pic.jpg?alt=media&token=d238f4dc-05f4-4fff-9649-fedaf0d51616",
                        "secondary-school": "",
                        "post_secondary_school": "Ivey Business School"
                    },
                    "title": "Ivey AEO Application 2016",
                    "description": "My application for the AEO program at Ivey Business School in 2016.",
                    "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F9%2FAEO-App.pdf%20copy.pdf?alt=media&token=40b467d6-7118-49ca-b74a-b227dcd366de"
                }
            ],
            "scholarship": null,
            "user": {
                "first_name": "Carol",
                "last_name": "Li",
                "username": "carolli",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F633%2Fprofile-pictures%2Fcarol-li.jpg?alt=media&token=c773b2f0-1275-4ec6-b4f0-e13388aa47c8",
                "id": 633
            },
            "contributors": []
        },
        {
            "id": 3,
            "title": "Queen's Commerce and Engineering Application 2014",
            "slug": "queens-commerce-and-engineering-application-2014",
            "body": "<h3>Queen&rsquo;s PSE (300 Words)</h3>\r\n<p><em> In an essay of 300 words or fewer (approximately 1950 characters with spaces), write about your goals for your time at Queen's University and beyond. Your answer will be evaluated for content and writing style. </em></p>\r\n<p>&nbsp;</p>\r\n<p>My primary goal during my time at Queen's University is to broaden my perspective and motivate my desire for proactive change in the society around us. Without indulging in too many clich&eacute;s and hollow phrases, I want my time at Queen's to include moments where I am constantly being inspired and challenged by the intelligent people that are part of the Queen's community. I want to leave with a degree that I hope will give me a competitive advantage in the job market and an alumni network that will benefit me in my professional endeavors. I want to leave Queen&rsquo;s with an awareness of all the possibilities for success that exist in our global village.</p>\r\n<p>&nbsp;</p>\r\n<p>My long term goal beyond my time at Queen&rsquo;s University involves taking advantage of emerging markets in places like China, Dubai, and Nigeria. My main interests include property development and alternative energy sources, industries which I hope to become more exposed to during my time here at Queen&rsquo;s. Initially I would love to work with a property development firm in one of these countries, become acquainted with the business culture and eventually start my own business that will specify on catering to the emerging middle class in these countries.</p>\r\n<p>&nbsp;</p>\r\n<p>It is quite evident how a degree in business or engineering would benefit me if I decided to go this route; but I also believe that a Queen&rsquo;s degree will be even more beneficial due to its recognition around the world and the popular exchange program in its third year commerce program which would help me develop contacts globally even from the infant stages in my career. I truly believe that a degree from Queen&rsquo;s University will be an integral part of me achieving my goals.</p>\r\n<p>&nbsp;</p>\r\n<h3><strong>Queen&rsquo;s Commerce Essay (2 X 300 words) </strong></h3>\r\n<h4><strong>School of Business Essay Questions Please answer both questions. </strong></h4>\r\n<p>&nbsp;</p>\r\n<p><em>1. In 300 words, or fewer, please demonstrate the research you have done to ensure that Queen&rsquo;s Commerce Program is the right fit for you. </em></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Immediately, one of the most attractive aspects of the Queen&rsquo;s commerce program was its national prestige and acclaim. Commerce has consistently distinguished itself, evident by finishing in the top 5 business schools in studies done by the Globe and Mail and Maclean&rsquo;s. Queen&rsquo;s is also well known for consistently sending students to work for top companies in the Investment Banking industry such as Goldman Sachs and Credit Suisse, which is one of the fields I am interested in. Attending a school with such strong connections with these companies would certainly offer me an advantage when searching for jobs and internships. Another benefit which attracts me to Queen&rsquo;s university is the numerous networking opportunities offered by the school, for example the networking event that Queen&rsquo;s organized with the Boston Consulting Group is one of many unique opportunities which is only available to students at certain elite level business schools in the country and being accepted into the Queen&rsquo; program would provide me with many similar networking opportunities.</p>\r\n<p>However, for me the factor which distinguished Queen&rsquo;s Commerce from all the other business schools in the country is the exchange program. Truthfully, when I read about this opportunity I became very excited and my entrepreneurial visions immediately began materializing. I have a long term goal of working in countries with emerging markets such as China, Dubai and Nigeria and going on an exchange to one of these countries would provide me with the perfect opportunity to develop contacts with individuals in this country. For example, the partnerships Queens has with Peking University, Guanghua School of Management or Tsinghua University. The combination of all these various factors is why I believe that Queen&rsquo;s is the right business school for me.</p>\r\n<p>&nbsp;</p>\r\n<p><em>2. The greatest lessons in life tend to come from challenging experiences. In 300 words, or fewer, please tell us about a challenging experience you have faced, and what you have learned from it. </em></p>\r\n<p>&nbsp;</p>\r\n<p>My grade eleven year of high school was a very difficult time for me, yet, it was definitely a character building experience that taught me a lot. I had it all planned out, I would hand in my application for school prefects-get accepted and then I would apply for en executive position in student council and get accepted to that as well. However, the problems started when a teacher I am close with pulled me aside and told me that the only complaint about me was that I appeared to often be concerned only with my own interests and was all about &ldquo;Team Tomiwa&rdquo;, a phrase I will never forget.</p>\r\n<p>&nbsp;</p>\r\n<p>To summarize, I did not get selected for either position and became very angry and resentful, laying blame at everyone but myself. I vowed to never to contribute to the school again and would never join another school club again. However, after talking with my parents and the principal, we all agreed that I still had leadership potential but first I had to acknowledge my own flaws. After humbling myself and asking the teachers which didn&rsquo;t select me for feedback on my weakness, we all worked together to look for opportunities where I could still contribute to the school community. This was my first real exposure to rejection, disappointment, and self-doubt. However this very bitter time in my life taught me that sometimes in life you are not always given what you deserve and worse yet is that sometimes you get exactly what you deserve.</p>\r\n<p>&nbsp;</p>\r\n<p>I also learned the importance of self-confidence, the significance of trusting others and working in a team and the virtues of selflessness and persevering through difficult times. Skills that do not only translate into success in business but also into success in life.</p>",
            "date_created": "2019-04-01T13:42:09Z",
            "description": "My applications for both the Queen's Commerce and Engineering program. The first part is for both engineering and Commerce programs. The second part was specifically for the Queen's Commerce program.",
            "status": "accepted",
            "status_other": "",
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F3%2FQueens%20PSE%20and%20Commerce%20Application%202014.pdf?alt=media&token=52c7bd24-980a-4df3-854d-45008c4aac30",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Tomiwa",
                "last_name": "Ademidun",
                "username": "tomiwa",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fljy9s5nm-Ezc5Hyf.jpg?alt=media&token=2391816e-c546-4b11-b232-0cc91f9f3547",
                "id": 1
            },
            "contributors": []
        },
        {
            "id": 7,
            "title": "LORAN SCHOLARS PROGRAM Application 2014",
            "slug": "loran-scholars-program-application-2014-",
            "body": "<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><strong>1. Describe what you consider to be your most significant volunteer contribution to date in terms of its value to your school or larger community. Why was it important to you and to others?&nbsp;</strong></p>\r\n<p>&nbsp;</p>\r\n<p>I founded and facilitated a leadership conference for middle school students in Grade 6 and Grade 7 in the Peel Region. The leadership conference is called MYLEAD, which stands for Middle School Youth Leadership Empowerment and Aspiration Development, and it was created to aid middle school students become leaders in their schools and take initiative.</p>\r\n<p>The conference is run by high school student council members, who serve as the leadership counselors, so that the delegates feel connected to their leadership counselors and are more comfortable around them since the age difference is not that large. I selected grade 6 and grade 7 students so that they could use the leadership skills and knowledge they gain to make a difference while they are still in middle school. The format which MYLEAD uses is that, the feeder middle schools collectively send 30 students to the high school, and the student council members facilitate the conference at their high school.</p>\r\n<p>The conference consists of leadership development sessions, team building sessions, a volunteer activity, and a fun group activity. The very first MYLEAD was held at my school, Chinguacousy Secondary School. It was a huge success; making it as a top story in the Brampton Guardian Newspaper which is read by the 600,000 people that populate the city. As a student trustee of the Peel District School Board, i will be working hard to implement this leadership conference into high schools in Peel this year.</p>\r\n<p>This project is important to me because it has always been one of my personal goals since I volunteered as a Leadership Counselor at OELC and it has helped me grow as a leader. It is also important in my community because it helps create more young leaders that can make positive changes that benefit our society.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>2. Describe a time you challenged yourself by taking on a task/project you felt was beyond your scope and capability at the time. Why did you do it? What happened?</strong>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>A daunting task that I challenged myself with was when I ran for student trustee of the Peel District School Board. The student trustee represents the student voice of all 150,000 students in public schools, located in Brampton, Mississauga and Caledon, on the school board. Initially i thought i had no chance of winning, and i even considered removing myself from the elections.</p>\r\n<p>It wasn't until i gave my first public campaign speech that i realized that i have the power to make change in my community. Some part of me still doubted that i was going to win until i received an email from the Peel District School Board, on April 2. 2014, congratulating me for being elected as a Student Trustee. This day was very memorable for me because April 2 is my birthday and I could not have asked for a better present. I am thankful for growing up in Nigeria and not in Canada because that is what drives me to get involved.</p>\r\n<p>I grasp at every opportunity to get involved and make change in my community that i am presented with because these opportunities were not available where i grew up. This burning passion fueled my campaign and helped me convince my peers across the Peel District School Board to put their trust and faith in me. Overcoming this obstacle has given me a new perspective on life and as a result of this i am trying to make changes for youth on a provincial scale.</p>\r\n<p>Getting elected as student trustee helped me get past my fear and i was able to run for, and win, an executive position as the Administration Officer on the Ontario Student Trustees' Association, which collectively represents the student voice of the 2.4 million students in Ontario.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>3. Using one of the leadership roles listed above, briefly describe the common goal or task you were in charge of achieving. What were the outcomes? Using concrete examples, describe how you engaged the members of your group in the work. What were the greatest difficulties you encountered in managing others?</strong></p>\r\n<p>&nbsp;</p>\r\n<p>As the Athletic Council Executive in charge of events, i lead the group to run the Grade Nine Sport Days at our high school. The Grade Nine Sport Days is a two day event that the athletic council holds for grade nine students at the beginning of the school year to help the new students relax and integrate into high school comfortably. The event consists of one day of dodgeball games and another of speedball games.</p>\r\n<p>It was a successful event and the grade nine had lots of fun and made new friends. The event even guided some grade nine students to take initiative and apply to be members of the athletic council. The event took quite a lot of planning and i took the leading role at the planning meetings. I used clear communication, confidence and my good people skills to make sure that meetings were productive.</p>\r\n<p>I made sure that everyone's ideas and opinions were taken into consideration to make sure that they were engaged and always contributing to discussion. My leadership skills at the planning meetings, helped solidify and ensure the success of the event. Although the event went well, i did encounter some difficulties during the meetings. One major difficulty i found with managing others was that everyone had different opinions on things and often the opinions of different members would clash and lead to arguments.</p>\r\n<p>I was able to overcome these issues using my conflict resolution skills to make sure that everyone understood that we were not running this event for our own personal likes but for the grade nine students. This caused people change their views and make their decisions based on what would be best for the grade nine students and not what they would personally want.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>4. Describe a time when you took the initiative to address an unmet need at school or in the community. What was the need and what steps did you take? What were the results of your actions?</strong>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>For a certain period of time at my high school, our administrators took away the morning announcements over the P.A in the morning and transitioned into showing the announcements on the tv's in the hallways. This change was detrimental to our everyday lives as students because it was very inconvenient to stop in the hallways on the way to class to read the many announcements on the televisions, not all the announcements would be displayed and whenever there were technical difficulties everyone would be in the dark as to what events were going on at our school.</p>\r\n<p>The student council discussed and brainstormed what steps we could take to bring the announcements back and satisfy our student body. I took a leading role in the student council by helping collect signatures from students and teachers for a petition to bring announcements back. We collected a substantial amount of signatures and forced the administrators to reconsider. In the end, the announcements were re-instated but they were read at the end of first period.</p>\r\n<p>Now this year as student council president, many teachers and students have come up to me and presented their concerns with the announcements being at the end of the period. So i have taken action once again towards this issue, and i am currently in talks with the principal and vice-principals to reach a solution that benefits both the students and staff.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
            "date_created": "2019-03-27T16:11:50Z",
            "description": "My application for the 2014 Loran Scholars program. I was not selected for this award.",
            "status": "declined",
            "status_other": "",
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F7%2FLoran%20Application.pdf.pdf?alt=media&token=3a5f73fd-9259-429b-a981-fffc8f3df03f",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Paul",
                "last_name": "Okundaye",
                "username": "OkPaul",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F626%2Fprofile-pictures%2Fpaul-profile-picture.png?alt=media&token=60650357-56f2-4a97-8416-08b08fbbc4aa",
                "id": 626
            },
            "contributors": []
        },
        {
            "id": 6,
            "title": "Ivey Business School AEO Application 2015",
            "slug": "ivey-business-school-aeo-application-2015",
            "body": "<h2>STUDENT COUNCIL</h2>\r\n<p>When I first started high school back in grade nine, I was not involved in any extra-curricular activities. I just let life pass me by and I seriously lacked motivation due to me still going through the culture shock of emigrating from Nigeria to Canada the past year in grade eight.</p>\r\n<p>Thank fully one of my teachers recognized my potential saw how I was wasting my abilities so she sent me to the Ontario Education Leadership Centre so see how much of a difference I could make in the world if I applied myself and took initiative.</p>\r\n<p>When I attended OELC, I met some really inspirational leaders whom I learned a lot from, I made some important friends and my perception of the concept of leadership was forever changed. I took a risk and went to a conference with about 300 people who I did not know in the slightest; at a place I had never been to before.</p>\r\n<p>There, I was inspired and encouraged to join my student council by the loving people and the positive atmosphere of leadership present there. I have been on my student council since Grade 10, serving as the grade representative in Grade 10 and 11, to ultimately become the president this year.</p>\r\n<p>At the beginning of the year, I asked myself and the rest of my council to reflect on my past two years on student council and what we felt needed to be changed. Then I realized that that was the wrong course of action because we needed to know how the student body felt. So I set about creating and implementing a student satisfaction survey during the beginning of the year to find out what the students want because I believe it is important to take everyone&rsquo;s opinions into consideration when making decisions.</p>\r\n<p>Our student council also made a more efficient use of the grade reps by making sure they were constantly in tune with the needs and wants of their grade. I think our student council has done well so far this year and everyone in the school including teachers have commented on the significant improvement. Due to our inclusiveness this year we have been able to put on events like our Terry Fox BBQ, Holiday Assembly, Halloween Fair and new initiative like an Anti-Bullying Campaign and Fun Fridays with Music, Karaoke and Video Games in the cafeteria.</p>\r\n<p>I have made sure everyone on our student council understands the importance of working hard together. I have also ensured that we are a more cohesive group by arranging get-togethers outside of school and introducing a student council secret Santa. At the beginning of the year we were just a group but now we are a family. My vision for the rest of the school year is to carry on the momentum we have right now and make sure that every single student at the school feels like their voice is being heard.</p>\r\n<p>&nbsp;</p>\r\n<h2>BRAMPTON MAYORS YOUTH TEAM</h2>\r\n<p>&nbsp;</p>\r\n<p>My journey on the Brampton Mayors Youth Team started when I volunteered at a Children&rsquo;s Mental Health Association fair in which I met the mayor. I had previously got knowledge of the opportunity on the internet but I wasn&rsquo;t if I should have applied until I met the Mayor of the city at that fair.</p>\r\n<p>She was there addressing the public at this very important event, and I built up my courage and introduced myself to her. I asked her about the Mayor&rsquo;s Youth Team and she told me that I should most definitely apply. I always think back to that day and I am very grateful for the confidence she instilled in me that day. The Mayor's Youth Team's purpose is to liaise between Brampton youth and the Mayor and City Council, and to help make Brampton a better place for youth to live in. We put together multitudes of events for youth to participate in to encourage a sense of togetherness and unity in our community. Our second major mandate is to actively volunteer in our community to give back and get involved.</p>\r\n<p>When I first joined the Mayor&rsquo;s Youth Team I was a general member but it was my significant contributions during the meeting and my active volunteering through the organization that made our Youth Coordinator take notice of me.</p>\r\n<p>&nbsp;</p>\r\n<p>As the months went by, I became an integral member of the group and started chairing some meetings. Although everything seemed to be going fine, I noticed that there was a severe lack of organization in our group and it was starting to take a negative toll. People stopped attending meetings regularly, during meetings people spoke over each other, had side conversations and outside of meetings people did not volunteer as much. A couple other members and I saw this as an opportunity to take initiative and we started a re-organization of the group. We helped stabilize things and write up a new code of conduct for members of our group which led to a lot more organization. With the help of our Youth Coordinator, we established an executive council and a general council which led to staggering amounts of productivity.</p>\r\n<p>&nbsp;</p>\r\n<p>Due to all of the tireless hours we put into reform of the group, The Brampton Mayor&rsquo; Youth Team is thriving once again. Last year we were able to put on great events for the youth of Brampton such as Amazing Race Brampton, an art exhibit, an open mic night, a youth jam concert and a &ldquo;career dating&rdquo; night where youth can find their perfect career match. With our new found structure we were able to put on all these events for the youth which led us to achieve the Platinum Level Youth Friendly designation by Play Works Partnership and now Brampton is officially Ontario&rsquo;s most youth friendly community. My goal for the rest of the year is to continue to make the city of Brampton a better place for youth in my role as Executive Manager for the Brampton&rsquo;s Mayor Youth Team.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<h2>PDSB AND OSTA STUDENT TRUSTEE</h2>\r\n<p>A daunting task that I challenged myself with was when I ran for student trustee of the Peel District School Board. The student trustee represents the student voice of all 150,000 students in public schools, located in Brampton Mississauga and Caledon. Initially I thought I had no chance of winning, and I even considered removing myself from the elections. It wasn't until I gave my first public campaign speech that I realized that I have the power to make change on a larger scale in my community and possibly province. Some part of me still doubted that I was going to win until received an email from the Peel District School Board, on April 2 2014, congratulating me for being elected as a Student Trustee. This day was very memorable for me because April 2 is my birthday and I could not have asked for a better present.</p>\r\n<p>&nbsp;</p>\r\n<p>My burning passion for student voice fueled my campaign and helped me convince my peers across the Peel District School Board to put their trust and faith in me. Getting elected as student trustee helped me get past my fear and I was able to run for, and win, an executive position as the Administration Officer on the Ontario Student Trustees' Association, which collectively represents the student voice of the 2.4 million students in Ontario. I truly feel that being a student trustee is an extremely important position to be in because it is the chain that exists to link the school board and its students. Without student trustees, the voice of the students in the school board would not be accurately represented and students would not have a say in important decisions that will ultimately affect them the most.</p>\r\n<p>&nbsp;</p>\r\n<p>As a Peel District School Board trustee, I have visited all 18 high schools that I represent and I have gotten to know all their student councils as well because I believe that you cannot represent people without knowing them. Due to this, I have been able to realize the flaws affecting students and I have taken steps to fixing them. I have standardized the student council budgets throughout the board, I have started, along with my partner trustee, our first student senate which consists of Student Council President&rsquo;s from all high schools in Peel, and I have created and facilitated a leadership conference for middle schools students called MYLEAD which was a top story in one of our local newspapers in Brampton read by the over 600,000 residents.</p>\r\n<p>&nbsp;</p>\r\n<p>On a provincial scale, I have spoken at a Canadian Education Association conference, attended an EQAO stakeholder seminar, and I have attended an Economic Roundtable with student leaders from across Canada. Being a student trustee has also sparked my interest in student government and I hope to get involved with the Student Union at university. Student&rsquo;s need to be heard and my only hope is that I will leave a significant impact for student voice at the end of my term.</p>",
            "date_created": "2019-03-27T16:03:18Z",
            "description": "As part of my AEO application to the Ivey Business School I had to submit an essay describing 3 activities in which I was involved. I also tried to highlight how each activity showcases my leadership skills.",
            "status": "accepted",
            "status_other": "",
            "essay_source_url": null,
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Paul",
                "last_name": "Okundaye",
                "username": "OkPaul",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F626%2Fprofile-pictures%2Fpaul-profile-picture.png?alt=media&token=60650357-56f2-4a97-8416-08b08fbbc4aa",
                "id": 626
            },
            "contributors": []
        },
        {
            "id": 5,
            "title": "Next36 Application 2018",
            "slug": "next36-application-2018",
            "body": "<p dir=\"ltr\"><strong>What is the most entrepreneurial thing you have done? What motivated you and what were the results? (200 words)</strong></p>\r\n<p><strong id=\"docs-internal-guid-ad13f1b1-7fff-7e9d-7301-5ced2d491c3f\">&nbsp;</strong></p>\r\n<p dir=\"ltr\">In 2014, I applied to an organization called Global Vision, which gave young people the opportunity to bring local businesses from their community to a new market. The focus was China, a country I had little experience with but was very intrigued by, which &mdash;&nbsp;along with overconfidence from DECA competitions &mdash; encouraged me to apply.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\">Once selected, there was little guidance on how to form the pitch, or what the exact details of the trade mission would be. I began by making a list of a variety of businesses home to Mississauga; design agencies, manufacturing companies, and tech startups. In 2 months, after hundreds of emails, packed days of meetings, and many rejections, I had secured $6000 to fund the trip.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\">To me, this experience embodied the grind of entrepreneurship. Like a startup, the value proposition can change and the early days are dependent on your perseverance, ability to think critically about the problems of your target market, and above all, make others believe in what you are doing. I created something out of nothing, and that set me on an untraditional path towards tech and building a company.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\"><strong>Describe a time when you were challenged by a supervisor, professor, or colleague about a decision you made. How did you handle the situation and what was the outcome? What did you learn from this experience? (200 words)</strong></p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\">This past year, I deferred a year of school to join the Growth team at Clearbit in San Francisco, CA. This followed internships at Shopify in sales and business operations, along with various contract marketing positions with Toronto-based startups. Needless to say, I had a lot of confidence in my abilities and the impact I could make at this 20-person organization.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\">Within a few weeks of starting, I shipped the revamp of our Zapier integration to thousands of our users via an email campaign. My boss challenged the focus of the campaign, which highlighted the way self-serve (monthly) customers could use our product with Zapier. He had reservations on how clear the value prop was, which I justified based on my conversations with several self-serve customers.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\">The campaign had good engagement, but it targeted a number of potential annual customers, who saw it as a cheaper way to accomplish their goals. While my boss was surprised by the campaign results, he shared how it disrupted sales cycles, frustrating our sales team. I learned that while shipping things quickly is important, doing due diligence and testing slowly is the way to maximize results while minimizing the fallout of failed tests.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\"><strong>Give an example of a time when you identified a problem or opportunity and acted on it. What were the results? (200 words)</strong></p>\r\n<p dir=\"ltr\">I&rsquo;ve always found that the idea of a network focuses too much on two people &mdash; what value I add to someone, and how they reciprocate. Over the past few years, I&rsquo;ve met a number of people who are great friends, colleagues, and mentors to me. I saw an opportunity in the value they could bring to each other.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\">I started by making a Google Sheet of people who I really resonated with, added a few notes, and made an effort to reconnect with them. This time, however, it would be purely for the purpose of discovering their interests and how I could find other people to help them.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\">Personally, I felt a lot more gratified by those conversations, as I focused more on listening and learning instead of seeking something. Externally, many of my introductions were based on similarity in career interests, but a number were also based on similar places in life &mdash; how do you handle your career while having a child? Although it&rsquo;s a question I can&rsquo;t answer, this new approach helped me find people who could, adding value where I couldn&rsquo;t before.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\"><strong>What are some obstacles you have had to overcome in your life to get to where you are today? (200 words)</strong></p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\">There are factors in my life that should have pointed towards risk aversion. My parents are first-generation immigrants, and hence wanted me to pursue a career as a doctor or lawyer. They were unemployed throughout my high school years, which should have further exasperated those concerns. Those &lsquo;obstacles&rsquo; ended up motivating me to strive for greatness at whichever path I chose to follow, even if it wasn&rsquo;t paved. &nbsp;</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\">The biggest obstacle in my life thus far is myself. I have a certain mindset that should guide my decision-making, but it has been clouded in the past by parental influence or the herd mentality of my friends. It made certain logical decisions a lot harder than they should be, like choosing an arts degree over business so I have more time to pursue my ambitions in tech. Deferring a year to do growth at Clearbit allowed me to be part of a rapidly scaling startup, but there was the fear of being &lsquo;behind&rsquo; or &lsquo;closing doors&rsquo; to certain career paths. Overcoming these hesitations helped me carve the path I&rsquo;m on today, and made me more confident in my decisions without the need for external validation.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p dir=\"ltr\"><strong>Is there anything else you would like to tell us that will help us evaluate your application? (100 word limit)</strong></p>\r\n<p>&nbsp;</p>\r\n<p dir=\"ltr\">My decision to apply to the Next36 doesn&rsquo;t stem solely from curiosity in entrepreneurship and technology. I&rsquo;ve loved technology since early in freshman year, interning with amazing teams at Shopify Plus. I wanted more autonomy and impact, so I went smaller, working with Turnstyle, #paid, and eventually a year-long internship with Clearbit. In these roles, I was most excited to help build and launch new products. I&rsquo;m confident in my abilities to market and sell a product, but I think I can learn a lot from the Next36 and I hope I can be a part of it.</p>",
            "date_created": "2019-03-27T15:04:15Z",
            "description": "My application for the Next36, an accelerator for young entrepreneurs in Canada. Me and my startup, The Path were selected to participate in the program.",
            "status": "accepted",
            "status_other": "",
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F5%2FNext%2036%20App.pdf?alt=media&token=0a2a07ae-05f2-4ee9-ae5c-5b31044489fe",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Trevor",
                "last_name": "Sookraj",
                "username": "trevorsookraj",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F629%2Fprofile-pictures%2Ftrevor-sookraj.jpg?alt=media&token=ebf88b32-8a18-4bd5-83e6-d33fcf112a9d",
                "id": 629
            },
            "contributors": []
        },
        {
            "id": 4,
            "title": "RBC General and Capital Markets Diversity Scholarships 2017",
            "slug": "rbc-general-and-capital-markets-diversity-scholarships-2017",
            "body": "<p><strong>Essay Question 1: Students have tremendous potential to be ambassadors for change and lead meaningful action. What is the best way to educate, engage and empower youth to bring about positive change in the world?</strong></p>\r\n<p><strong>Answer in 400 words or less:</strong></p>\r\n<p>In today&rsquo;s digital world of electronic devices, apps and social media, I think it&rsquo;s important to step back sometimes and go old school. That is to say, speaking in person and interacting with youth in person is very important. A great way for youth to interact with other like-minded youth, and to learn and be mentored by community leaders is through leadership conferences. The best way to educate, engage and empower youth to bring about positive in change in the world is by providing opportunities for youth to develop useful leadership skills and also providing avenues for them to use those skills.</p>\r\n<p>For example, I think leadership conferences are a very good way of engaging youth and enlightening them about the importance of community involvement. I myself have attended more than 4 leadership conferences at places like Ontario Educational Leadership Centre, Central Ontario Leadership Seminar and The Global Vision Economic Round Table. I truly believe that it is my experiences at these conferences that have helped me become the leader I am in my community today. Those conferences even inspired me to create and run my own leadership conference called MYLEAD (Middle School Youth Leadership Empowerment and Aspiration Development), which provided youth in my city, Brampton, with the opportunity to build leadership skills and group dynamics, which they will use to better their middle schools and community as a whole.</p>\r\n<p>I believe that the examples I have given are truly a testament to manifestation of skills learnt from leadership conferences, and I don&rsquo;t think there will ever be enough leadership conferences for youth. These conferences are also a great means of networking for youth, and I believe that networking is an essential skill that a lot of youth are lacking today. Networking is a skill with many real-life applications, especially in the workplace. For example, in the business world networking is a great way to make connections and get affiliations and partnerships for your organization and right now I believe that many youth are not learning this skill. When students go through leadership conferences, they depart with a wide array of skills that will help them navigate the world of today, and will help push them to become students leading change in their communities.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Essay Question 2: What is the most important action you&rsquo;ve taken as a student to create change? What was the result?</strong></p>\r\n<p><strong>Answer in 200 words or less:</strong></p>\r\n<p>I think that the most important action I have taken as a student to create change is running for the position of Student Trustee of the Peel District School Board. Running for election was a big step for me, and it required a lot of confidence but I was able to overcome the hurdle and I was elected as the student trustee. I think this is the most important thing I have done to date because it has helped me make positive changes that have affected multitudes of youth in the Peel Region and in Ontario as a whole. As student trustee, I represent the 160,000 students in the Peel Region on the board and as one of the executive members of the Ontario Student Trustee&rsquo;s Association; I help represent the 2.4 million</p>\r\n<p>students in Ontario. The result of this is that I have been able to make integral decisions and influence important stake holders in education to make the system better for students. On a regional level, I have helped students by doing things such as lowering cafeteria prices, helping student council&rsquo;s get fair budgets and uniting the student council presidents of Peel.</p>\r\n<p>&nbsp;</p>\r\n<div title=\"Page 2\">\r\n<div>\r\n<div>\r\n<div>\r\n<p><strong>Please describe your interest in a career in Capital Markets. (maximum 300 words)</strong></p>\r\n<p>In September 2015, I started my first year at Western University studying business with an inclination towards finance but no real idea of what I truly wanted to do. An upper year friend of mine encouraged me to attend meetings at the two major finance clubs at our school and through these meetings, I began to learn more about finance. I found that the problem solving, numerical and detail-oriented aspects of it appealed to me and I decided to pursue a career in finance. I secured a position as the Director of Events of Western Capital Markets, the largest sole finance preparation club at Western.</p>\r\n<p>&nbsp;</p>\r\n<p>Throughout the year, I spent time increasing my financial acumen by self-teaching, attending club meetings and participating in various conferences and competitions. Everything I learned aided me in securing a summer internship at Scotia Wealth Management. Now, I am the Director of Education of Western Capital Markets; in this role, I help teach vital financial basics to all our general members. This summer, I am working as an Investment Banking Analyst at the Toronto office of Kirchner Private Capital Group, a merchant bank with six offices in North America.</p>\r\n<p>&nbsp;</p>\r\n<p>I believe that a career in finance will provide me with endless opportunities to challenge myself and develop both personally and professionally. Working in finance also requires one to be adaptable between working on your own and working with a team which is something that appeals to me because I am very adaptable between various social settings and dynamics. I have worked very hard to get to this point and I implore you to give me the chance to convince you of what I already know and believe &ndash; I have the conviction to make it in the world of finance.</p>\r\n</div>\r\n</div>\r\n</div>\r\n</div>",
            "date_created": "2019-03-25T14:01:29Z",
            "description": "My RBC Scholarship Application and applications for the RBC Capital Markets Diversity Scholarship. The first 2 answers are for the general RBC scholarships and the third question is specifically for the RBC Capital Markets Diversity Scholarship.",
            "status": "accepted",
            "status_other": "",
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F4%2FRBC-Scholarship-Essays-2017-Paul-Okundaye.pdf?alt=media&token=0d6e3138-5edd-4b81-b9e0-7660f9472bf8",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": [
                {
                    "id": 484,
                    "name": "RBC Capital Markets Diversity Scholarship",
                    "slug": "rbc-capital-markets-diversity-scholarship",
                    "img_url": "https://cdn.worldvectorlogo.com/logos/rbc-royal-bank.svg",
                    "deadline": "2019-06-01T03:59:00Z",
                    "description": "Students who identify as a visible minority, female, Aboriginal or Indigenous background, LGBT+, Veterans, and/or persons with disabilities. Students in full-time undergraduate studies graduating in December 2019 or Spring 2020, who are enrolled in a business, engineering or economics program at a university in Canada.\r\n\r\nUp to 4 awards worth $5,000 each PLUS a 2019 summer analyst position with RBC Capital Markets in Toronto"
                },
                {
                    "id": 6,
                    "slug": "ivey-business-school-aeo-application-2015",
                    "user": {
                        "id": 626,
                        "title": "",
                        "username": "OkPaul",
                        "last_name": "Okundaye",
                        "first_name": "Paul",
                        "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F626%2Fprofile-pictures%2Fpaul-profile-picture.png?alt=media&token=60650357-56f2-4a97-8416-08b08fbbc4aa",
                        "secondary-school": "",
                        "post_secondary_school": "Ivey Business School"
                    },
                    "title": "Ivey Business School AEO Application 2015",
                    "description": "As part of my AEO application to the Ivey Business School I had to submit an essay describing 3 activities in which I was involved. I also tried to highlight how each activity showcases my leadership skills.",
                    "essay_source_url": null
                },
                {
                    "id": 8,
                    "slug": "ivey-aeo2-activity-report-2017",
                    "user": {
                        "id": 633,
                        "title": "",
                        "username": "carolli",
                        "last_name": "Li",
                        "first_name": "Carol",
                        "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F633%2Fprofile-pictures%2Fcarol-li.jpg?alt=media&token=c773b2f0-1275-4ec6-b4f0-e13388aa47c8",
                        "secondary-school": "",
                        "post_secondary_school": "Ivey Business School"
                    },
                    "title": "Ivey AEO2 Activity Report 2017",
                    "description": "My AEO2 activity report for Ivey Business School. This is a report of extra curricular activities I participated in while in university in the AEO program as part of my progression requirements for starting the HBA program in 3rd year.",
                    "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F8%2FIvey%20AEO2%20Activity%20Report.pdf?alt=media&token=84488d88-074e-46a1-8d07-a15b386ac059"
                }
            ],
            "scholarship": 484,
            "user": {
                "first_name": "Paul",
                "last_name": "Okundaye",
                "username": "OkPaul",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F626%2Fprofile-pictures%2Fpaul-profile-picture.png?alt=media&token=60650357-56f2-4a97-8416-08b08fbbc4aa",
                "id": 626
            },
            "contributors": []
        },
        {
            "id": 2,
            "title": "Ivey Business School AEO Application 2014",
            "slug": "ivey-business-school-aeo-application-2014",
            "body": "<p><strong>Ivey Essay (3 X 500 words) </strong></p>\n<p>&nbsp;</p>\n<p>Consider all the activities (extracurricular, community involvement, paid/volunteer work experience, entrepreneurial ventures) that you have been involved in during the past 4 years. Select 3 activities that you feel highlight your leadership experience best. Please limit each description to one activity.</p>\n<p>Please focus your description on elements that demonstrate: <strong>teamwork, initiative, achievement, commitment, </strong>and<strong> breadth</strong>.</p>\n<p>&nbsp;</p>\n<p>Select the &lsquo;Add Activity&rsquo; button below and use the form for each of your three activities. Complete all of the required fields. For the activity description, use an essay format, NOT bullet points. Please limit your description for each activity to 500 words and note that grammar and spelling will be assessed.</p>\n<p><span style=\"text-decoration: underline;\">Clubs/Societies/Orgs</span></p>\n<ol>\n<li>Extracurricular Executive Member, Athletic Council, October 2013-present&nbsp;</li>\n<li>Community Involvement Student Representative, HCDSB Mental Health, October 2013-present</li>\n<li>Entrepreneurial Venture Academic Tutor September 2012-present ,</li>\n</ol>\n<p>&nbsp;</p>\n<div title=\"Page 1\">\n<div>\n<div>\n<div>\n<p><span style=\"text-decoration: underline;\"><strong>Intramural Soccer</strong></span></p>\n<p>The creation of an intramural soccer league is an excellent example of an initiative which I started and have followed through with. I am a very avid soccer fan and have wanted to share the beautiful game with as many students as possible, while promoting school amity and healthy living. The first step was approaching a large, diverse group of students and trying to gauge the interest level in what I was planning to do, this required strong communication and persuasive skills because I had to really market the event as something fun and enjoyable, despite the fact that this was the inaugural year. Next I met frequently with the head of the physical education department and my head soccer coach trying to organize various logistics such as legal issues, teacher supervisors and gym space. These meetings taught me how to confidently present and defend an idea, especially when people are skeptical of your venture or idea. We were finally able to get a gym space but it was early in the morning and I was worried that people would not be willing to wake up early in the morning. We had a fairly decent turnout the first couple of</p>\n</div>\n</div>\n</div>\n</div>\n<div title=\"Page 2\">\n<div>\n<div>\n<div>\n<p>weeks, but we were noticing a steady decline in attendance each week and I decided to suspend the sessions and rethink a strategy to increase the attendance. I met heavy resistance with people telling me that the gym times were fine, that I just didn&rsquo;t organize it properly; many people told me that I would never get a gym space after school. However, I refused to take no for an answer without looking for alternatives first. I talked with various teachers, negotiated persistently, and constantly emailed various teachers trying to see if anyone would be willing to give me an after school gym space. Eventually, I had a gym space for Friday after school and had about two weeks to aggressively market this new time to generate as much anticipation as possible. My advertising was pervasive and relentless, it began with posters and announcements, but that was too conventional, so then I went to gym classes and groups of people and tried to get them excited about the event. I would walk up to groups of people that I didn&rsquo;t know, some friends or acquaintances who I thought played soccer and get them interested in the event, put a little gentle pressure on them. On the day of the session I was surprisingly nervous, due to the disappointing morning sessions, but my anxiety turned out to be in vain because the turnout surpassed everyone&rsquo;s expectations. There were so many people that we even had other teachers and students come and see why the gym was so animated. The event turned out to be a huge success and many students were asking when the next intramural session would be. I am looking forward to continuing the intramural soccer sessions in the New Year to a very receptive student body.</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\"><strong>Mental Health</strong></span></p>\n<p>As a student representative for the Halton Catholic District School Board Mental Health Leadership Committee (HCDSB-MHLC), I have many responsibilities assigned to me out of formality and tradition, yet very few of those roles actually have an impact on the lives of the students I am meant to represent. I decided that rather than simply attending meetings and</p>\n</div>\n</div>\n</div>\n</div>\n<div title=\"Page 3\">\n<div>\n<div>\n<div>\n<p>nodding my head in agreement, I wanted to have something to show for all the work I had done with the committee and actually be able to say that I had made a difference on the committee in some way. There was a young girl who was my age that recently committed suicide in our community due to online bullying and after noticing a trend in online bullying in my own school as well, I decided to create an anti-bullying campaign which targeted a sort of &ldquo;new wave&rdquo; of bullying that we are seeing in this social media age. The intent was to educate students to the dangers of their actions and to become more aware of the consequences and repercussions behind their actions. The first step was compiling all the work we had done with the MHLC with research done on my own into a presentation format which would be well received by students in grades 9 and 10, my primary demographic. When creating my presentation I really wanted to make it in a manner that would be really provocative, I added some, controversial yet appropriate pictures and texts that were about bullying into my presentation because I wanted to leave a resonating impact which would cause people to think.. I asked the school chaplain to mentor me by helping me revise and refine the presentation in a manner that would appease the adults, she was skeptical about some of the pictures but I assured her the purpose was to provoke thought not to offend. I also planned meetings with various student groups in the school to seek advice and ideas on what would engage the student body and also discuss how we could collaborate on other platforms to promote the campaign. The next process in my campaign was a variety of meetings and presentations with various teachers, counsellors and the school principal, showing them of my presentation and asking for permission to present this to classes. As expected, there was mixed receptions to the controversial elements of the presentation, while some thought it was inappropriate for a school setting others thought that it was perfectly appropriate for educating students, after a little discussion some elements were taken out; I however, was not</p>\n</div>\n</div>\n</div>\n</div>\n<div title=\"Page 4\">\n<div>\n<div>\n<div>\n<p>upset because my goal had been partially achieved and the presentation was generating conversation. The only disappointment was that I would have to wait until second semester before I could start presenting to classes. I am eagerly awaiting the opportunity to enlighten the students at my school with this innovative campaign.</p>\n</div>\n</div>\n</div>\n</div>\n<p><span style=\"text-decoration: underline;\"><strong>Tutor</strong></span></p>\n<p>&nbsp;</p>\n<p>The creation of my own tutoring company was hard but the good moments make it worth it [revise sentence]. Most of the things which I do in my life are a product of the serendipity of seemingly random events simultaneously intersecting in my life. As I was beginning my grade eleven year of high school I noticed that more of my friends were beginning to get minimum wage jobs and earning some extra cash, although I have always wanted financial independence, trying to squeeze school, athletics, extracurricular with a $9.65 an hour that wouldn&rsquo;t stimulate me or benefit me long term in any way was not particularly appealing to me, so I had to get creative. I also noticed that the new school year was full of students who were motivated to start the year with devotion to their studies and were eager to get tutors. The first opportunity began with an announcement over the PA system about anyone interested in tutoring a grade six student after school. The parent was originally reluctant about letting a student tutor her child because of his learning disabilities, so they suggested I have a trial first. I am typically very hard on myself and I believe that this is the best way to push lazy students who had potential, but his disability presented a different challenge thus a different strategy. The parents were impressed by how I was willing to go the extra mile to ensure that he understood the material and was engaged in the lessons. I would spend my own time working on supplementary activities and email his father suggestions and revisions to ensure he understood the lesson. His mother was very happy with my work, invited me to stay and over 18 months later I still tutor him twice a week. Once I felt ready to expand my venture I went to various schools and libraries putting up posters there to market my business, this was at first very frustrating because it was around October/November and I had no car so I would have to walk long distances to schools only for some posters to be taken down, and I wouldn&rsquo;t receive sufficient phone calls. However, persevering through these minor setbacks and advertising even more aggressively was successful because at my peakaround exam times- I was tutoring seven kids a week. I also learnt how to promote myself in a humble yet confidently reassuring way to parents, some who would blatantly ask me how smart I was and unfazed, I would tell them the marks I was getting in school and they would be satisfied, then I would deliver funny yet informative tutoring sessions to their students to ensure them that I was the right person for the task. I am currently enjoying tutoring and I hope to continue tutoring my current students through my final year of high school.</p>",
            "date_created": "2018-06-13T13:33:02.659480Z",
            "description": "My AEO University application for Ivey Business School 2014.\n           I applied to the software engineering and business dual degree program. Ivey places an emphasis on leadership so I really try to highlight how I demonstrate strong leadership in the examples I give in my essay.",
            "status": "accepted",
            "status_other": null,
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F2%2FIvey%20AEO%20Application%202014.pdf?alt=media&token=ee61734a-1667-4b24-8ee1-0ba178247b4b",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Tomiwa",
                "last_name": "Ademidun",
                "username": "tomiwa",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fljy9s5nm-Ezc5Hyf.jpg?alt=media&token=2391816e-c546-4b11-b232-0cc91f9f3547",
                "id": 1
            },
            "contributors": []
        },
        {
            "id": 11,
            "title": "Wellington ­Halton District Women Scholarship Application 2014",
            "slug": "wellington-halton-district-women-scholarship-application-2014",
            "body": "<div title=\"Page 1\">\r\n<h5 style=\"text-align: center;\"><strong>\"Is The Canadian Senate Relevant Today?\" (500 words)</strong></h5>\r\n<p>Canada is a glorious country with a rich history, progressive freedoms for it citizens and an extremely unique array of cultures. However, in such a country, it is important to have a government which, not only protects the integrity and history of this country but must also be able to make the over 6 million immigrants who have made this country home, feel comfortable in their new family.</p>\r\n<p>&nbsp;</p>\r\n<p>Arguably, no other branch of government addresses this need better than the Canadian senate. Before one can question the relevancy of the Canadian Senate, we must truly understand what their role in Canadian government is. The senate is appointed by the governor general based on advice from the Prime Minister, made up of 105 members from various regions in Canada, with the four major regions(Ontario, Quebec, the Maritime provinces, and the Western provinces) getting 24 seats each and the rest going to (Newfoundland and Labrador, the Northwest Territories, Yukon, and Nunavut).</p>\r\n<p>&nbsp;</p>\r\n<p>This is a very crucial set up because the involvement of both the Governor General and Prime Minister in the appointing process ensures that senators are appointed on a fair, bipartisan basis and that their interests will coincide with the welfare of the citizens and not with fulfilling a hidden political agenda. The fact that the four major regions also get an equal number of seats, regardless of population and GDP size ensures that the needs of all the regions are being fairly addressed. The main power from the senate however, comes from their ability to propose and pass new bills that affects the lives of millions of Canadians every day. Typically, we accept laws as rules and regulations without questioning why we have to follow these laws, however by understanding what role the senate plays in these</p>\r\n</div>\r\n<div title=\"Page 2\">\r\n<div>\r\n<div>\r\n<div>\r\n<p>rules, we can get a better understanding of what kind of values and morals they want to instill in Canadian culture. In present day Canada, the Senate&rsquo;s relevance is demonstrated through its ability to delicately balance both the preservation of the history and culture of Canada&rsquo;s heritage while welcoming and accommodating the needs of new Canadian immigrants and their culture. Such an example is Senator Jean&shy;Robert Gauthier's Bill S&shy;3's, An Act to amend the Official Languages Act which was passed into law in late November 2005. It was an amendment to the Official Languages Act that allows Canadians to take the federal government to court if it does not live up to its obligation to protect and promote both French and English minorities in Canada.</p>\r\n<p>&nbsp;</p>\r\n<p>Another bill which protects the rights of Canada&rsquo;s heritage is the Family Homes on Reserves and Matrimonial Interests or Rights Act which is an respecting family homes on First Nation reserves and matrimonial interests or rights to structures and lands on those reserves. Conversely, the Canadian senate maintains its credibility by not only protecting the rights of people who have lived in Canada for years but also by accommodating those who have recently called this country home.</p>\r\n<p>&nbsp;</p>\r\n<p>For example, the Immigration and Refugee Protection Act which received Royal Assent in November 2001. This act ensured that people who had proven they would be able to make contributions to Canadian society would have a good chance of entering Canada, but also that those who were less fortunate and seeking to escape the harsh conditions of their country would also have a fair chance at starting a better life in Canada. I myself am here today in this country as a Canadian citizen, born in Nigeria due to this act, and I have the Canadian senate partly to thank for that.</p>\r\n<p>&nbsp;</p>\r\n<p>Whenever individuals question the relevancy of the Canadian Senate, one must explain to them that their ability to ensure the protection of the rights and freedoms of past, present, and future Canadians is what makes the Senate an important part of this wonderful country called Canada.</p>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n<div title=\"Page 3\">\r\n<div>\r\n<div>\r\n<p>&nbsp;</p>\r\n<p><strong>Community Involvement Extra&shy;Curricular Activities</strong></p>\r\n<ul>\r\n<li>\r\n<p>Senior soccer team member</p>\r\n</li>\r\n<li>\r\n<p>Halton Catholic District School board Student Senate member</p>\r\n</li>\r\n<li>\r\n<p>DECA club</p>\r\n<p><strong>Community Activities</strong></p>\r\n</li>\r\n</ul>\r\n<ul>\r\n<li>\r\n<p>Erin Mills Eagles OYSL soccer team</p>\r\n</li>\r\n<li>\r\n<p>Audio &amp; Visual department church volunteer</p>\r\n</li>\r\n<li>\r\n<p>Academic Tutor</p>\r\n</li>\r\n<li>\r\n<p>Town of Milton Camp Counsellor</p>\r\n<p><strong>Leadership Roles</strong></p>\r\n</li>\r\n</ul>\r\n<ul>\r\n<li>\r\n<p>Student Representative Halton Mental Health Leadership Committee</p>\r\n</li>\r\n<li>\r\n<p>Black History Month Organizer and co&shy;host</p>\r\n</li>\r\n<li>\r\n<p>Religion Retreat Leader</p>\r\n</li>\r\n<li>\r\n<p>Student Athletic Council Executive</p>\r\n</li>\r\n</ul>\r\n</div>\r\n</div>\r\n</div>\r\n<div title=\"Page 4\">\r\n<div>\r\n<div>\r\n<div>\r\n<p>&nbsp;</p>\r\n<p><strong>Future Plans</strong></p>\r\n<p>After I graduate high school my plan is to enroll at the University of Western Ontario or Queen&rsquo;s University in the faculty of either Engineering or Business/Commerce at each school. I have already gained acceptance into three of my four chosen programs and am just waiting on an acceptance from the University of Western Ontario Ivey AEO (Advanced Entry Opportunity) business program, this program would allow me to get a dual degree in both Engineering and Honours Business Administration.</p>\r\n<p>&nbsp;</p>\r\n<p>The two faculties I&rsquo;m applying to both have the highest tuition costs in their respective universities and with two younger siblings in my house who also plan on attending University within the next five years, financial resources are strained in my family. My parents have invested a lot in me and my sisters, sacrificing everything we had in Nigeria to bring us to a new country to start a new life. They have invested a lot of money in not only my academic career but also in my athletic pursuits and interests, in the process sacrificing some of their own interests as well.</p>\r\n<p>I have promised myself that I will do everything I can to let my parents know that their sacrifices have not been in vain, which is why I have invested so much time and effort into getting awarded a scholarship to not only ease the financial burden on them, but also as a means of showing my gratitude towards them.</p>\r\n<p>&nbsp;</p>\r\n<p>The attitude of gratitude and giving back is another reason why I want to pursue the fields of engineering or business; I want to use the skills which I have learnt in University towards solving some of the infrastructural problems that we face in Canada but especially my home country of Nigeria. I also believe that a background in finance, would provide me with a better understanding of some of the economic problems that face third and second world countries and ultimately apply these skills to improve the lives of those affected by poverty and corruption in places like India, Nigeria, and Brazil.</p>\r\n<p>&nbsp;</p>\r\n<p>I would ask the Wellington&shy;Halton District Women&rsquo;s institute to provide me with this award so that they may help me to help others.</p>\r\n</div>\r\n</div>\r\n</div>\r\n</div>",
            "date_created": "2018-06-10T15:55:15Z",
            "description": "I wrote this essay in 2014, the topic was \"Is the Canadian Senate relevant today?\". I don't think I get selected for this scholarship 😕. Though, I can't remember.",
            "status": "declined",
            "status_other": "",
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F11%2FWellington%20%C2%ADHalton%20District%20Women%20Scholarship%20Application.pdf?alt=media&token=f896653d-1b82-4579-9be6-5bbf5110b5ec",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Tomiwa",
                "last_name": "Ademidun",
                "username": "tomiwa",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fljy9s5nm-Ezc5Hyf.jpg?alt=media&token=2391816e-c546-4b11-b232-0cc91f9f3547",
                "id": 1
            },
            "contributors": []
        }
    ]
}