{
	"count": 121,
	"next": "https://atila-7.herokuapp.com/api/blog/blog-posts/?page=2",
	"previous": null,
	"results": [
		{
			"id": 155,
			"contributors": [
				{
					"user": 1289,
					"first_name": "Aaron",
					"last_name": "Doerfler",
					"username": "aarondoerfler",
					"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1289%2Fi7aqzlpa-headshotzoom.jpg?alt=media&token=a6071b1c-afd6-43d3-b008-f57e347caa2b"
				},
				{
					"user": 1816,
					"first_name": "Lauren",
					"last_name": "Mercer",
					"username": "llmercer",
					"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fscholarship-images%2Fedo55xjv-Profile%20Photo.jpg?alt=media&token=1ee1db2a-f81b-4391-ade7-e19265600bda"
				}
			],
			"title": "Atila’s Guide to Getting Scholarships for School",
			"slug": "atila-scholarship-guide",
			"alternate_slugs": [],
			"body": "<h2>Introduction&nbsp;</h2><p>The average university student graduates with <a href=\"https://www150.statcan.gc.ca/t1/tbl1/en/tv.action?pid=3710003601\">$28K in student debt</a>, yet at the same time, every year there are <a href=\"https://www.cbc.ca/news/canada/calgary/alberta-scholarships-university-post-secondary-funding-1.4642463\">millions of dollars in scholarships that go unclaimed</a>!&nbsp;</p><p>So this tells us that there is definitely a demand for scholarships and while the demand is more than the supply, some of that supply goes unused. Our guide hopes to solve that problem.</p><p>But even though school is expensive, you shouldn’t have to sacrifice your education. Keep reading to check out our tips on how you can get money for school.</p><p><i>Note: Some of the links are specific to students in Canada and the US but most of the advice and links here are relevant to students in every country.</i></p><p>Leave your comments and feedback on this <a href=\"https://www.reddit.com/r/atila/comments/pq93bs/atilas_guide_to_getting_scholarships_for_school/\">post</a> at <a href=\"https://www.reddit.com/r/atila/\">r/atila</a>!</p><h2>Apply for Scholarships&nbsp;</h2><h3>Scholarship Websites&nbsp;</h3><p>All of these websites allow you to directly search their scholarship databases to find and apply to the scholarships relevant to you.</p><p>Of course one of these websites is <a href=\"https://atila.ca/\">Atila</a>. And although we love Atila, this isn’t a sales pitch. We want you to know about, and use, all of the other great scholarship resources as well. Here’s a list of the best and most comprehensive scholarship websites:</p><p>&nbsp;&nbsp;</p><p>Canadian Students</p><ol><li><a href=\"https://atila.ca/\">Atila</a></li><li><a href=\"https://yconic.com/\">Yconic</a></li><li><a href=\"https://www.scholarshipscanada.com/\">ScholarshipsCanada</a></li><li><a href=\"https://scholartree.ca/\">Scholartree</a></li><li><a href=\"https://studentawards.com/\">StudentAwards</a><br><br>&nbsp;</li></ol><p>American Students</p><ol><li><a href=\"https://bold.org/\">Bold.org</a></li><li><a href=\"https://www.scholarships.com/\">Scholarships.com</a></li><li><a href=\"https://www.fastweb.com/\">Fastweb</a></li><li><a href=\"https://www.reddit.com/r/scholarships/\">r/scholarships</a></li></ol><h3>&nbsp;</h3><h3>Assorted Scholarship Lists</h3><p>There are all kinds of scholarship lists and link lists all over the internet.</p><p>The first two links are crowdsourced lists of scholarships so they tend to have more information. The other three are just some examples of the types of lists you can find from browsing the internet.</p><ol><li><a href=\"https://docs.google.com/spreadsheets/d/1lCjI-upHZJ1pZHRG7f5OVmJbv1SNWJ9h8SsS61eYcRU/edit#gid=0\">Atila Mega Scholarships List</a></li><li><a href=\"https://github.com/atilatech/awesome-students/\">atilatech/awesome-students</a></li><li><a href=\"https://beacons.ai/scholarshipguru\">https://beacons.ai/scholarshipguru</a></li><li><a href=\"https://linktr.ee/accessscholarships\">https://linktr.ee/accessscholarships</a></li><li><a href=\"https://linktr.ee/Scholist.app\">https://linktr.ee/Scholist.app</a></li></ol><p>To find even more, <a href=\"https://www.google.com/search?q=linktr.ee+scholarships\">Google: “linktr.ee scholarships”</a></p><h3>Check if your part-time job or your parent’s job has Employees for Scholarships</h3><p>Ask your parents or legal guardian if there is a scholarship for employees or children of employees. Here are some scholarships specifically for employees or children of employees at various companies:</p><ol><li><a href=\"http://www.scholarships4students.com/mcdonald's_national_employee_scholarship_program.htm\">McDonald’s National Employee Scholarship Program</a> - varies per restaurant, ask your manager</li><li><a href=\"https://www.rbc.com/dms/enterprise/scholarships/scholarship-program-for-the-children-of-rbc-employees.html\">Children of RBC Employees Scholarship Program</a> - information is available through the RBC intranet site for employees</li><li><a href=\"https://www.timhortons.com/restaurant-opportunities\">Tim Horton’s Scholarship Program</a> - varies per restaurant, ask your manager</li></ol><h3>School Directories</h3><p>Different high schools, universities and colleges have scholarship lists where you can find even more scholarships. Some of them are for students of the school but many also have external scholarships that anyone can apply for.&nbsp;</p><p>Simply Google: “[school_name] scholarships” or even better “[school_name] external scholarships”</p><p>Here are some examples of school websites that have external scholarships</p><ol><li><a href=\"http://westgate.lakeheadschools.ca/student_services/scholarships_bursaries_awards.htm\">Westgate Collegiate External Scholarship Page</a></li><li><a href=\"https://www.dal.ca/admissions/money_matters/awards-financial-aid/scholarships/external_scholarshipsbursaries.html\">Dalhousie University External Scholarship Page</a></li><li><a href=\"https://langara.ca/student-services/financial-aid/external-awards/index.html\">Langara College External Scholarship Page</a></li></ol><h3>Scholarship Content Creators</h3><p>There are so many content creators on TikTok, Instagram, Twitter and Youtube that talk about scholarships.</p><ol><li><a href=\"https://www.tiktok.com/@espdaniella/video/7001864331310714118\">Scholarships Guru (@espdaniella) - TikTok</a></li><li><a href=\"https://www.youtube.com/channel/UC0chOy9Fc5qGy7iCzgBBE8Q\">Keeping up with Ken - YouTube</a></li><li><a href=\"https://www.youtube.com/c/MarisaRose/featured\">Marisa Rose - YouTube</a></li><li><a href=\"https://www.tiktok.com/@nikhil.desai\">Nikhil Desai (@nikhil.desai) - TikTok</a></li></ol><p>For a crowdsourced list of more student content creators see here: <a href=\"https://docs.google.com/spreadsheets/d/1lCjI-upHZJ1pZHRG7f5OVmJbv1SNWJ9h8SsS61eYcRU/edit#gid=652209883\">Atila Student Resources Mega List - Student Content Creators</a></p><h3>Secret Hack for Finding Obscure Scholarships: Offline Scholarships!</h3><p>There are a lot of great resources on the internet to help you find the scholarships that you’re eligible for but a very underrated way to find other scholarships is going offline. These scholarships can be the best ones since not a lot of people know about them!</p><p>There are some scholarships that are still paper-based scholarships distributed through flyers, PDFs or on very obscure websites.&nbsp;</p><p>For example, local schools, rotary clubs, legions, radio stations and businesses may offer scholarships that are kept offline or on really obscure websites that few people know about. If that is the case, check different local announcement boards around town, or in the offices of each of the examples provided.</p><p>Here’s how to find them:</p><ol><li>Go to your guidance counsellor or financial aid office and ask if they have any scholarship posters or binders with scholarships that were sent to them.<br><br>&nbsp;</li><li>Visit the website of your local rotary club, legion, chamber of commerce and ask if they have scholarships.&nbsp;<br><br>&nbsp;</li><li>If you don’t see anything sometimes they don’t upload them to the website or they put it in an obscure place. Don’t be afraid to call or email to inquire about them.</li></ol><h3>Bonus: Asking for Scholarships that Don’t Exist</h3><p>This one is a bit unusual but I think it could work really well. There are certain categories of organizations that typically offer scholarships to students, but a specific organization within that organization may not offer a scholarship.&nbsp;</p><p>If you call or email one of those companies and ask if they offer scholarships, perhaps even mention the name of another similar organization to theirs which offers scholarships. They might actually create a scholarship just because you asked and if you were the one that asked, it would give you a very high chance of winning.</p><p>Here are some categories of organizations that typically offer scholarships. this would work well with</p><ol><li>Local chapters of a professional organization in your field of interest<ol><li>Professional Engineers of Ontario</li><li>Chartered Professional Accountant<br>&nbsp;</li></ol></li><li>Chambers of Commerce<ol><li>Milton Chamber of Commerce</li><li>Montreal Chamber of Commerce</li></ol></li><li>Ethnic or Religious Organizations<ol><li>Edmonton Multicultural Coalition</li><li>African Communities of Manitoba (ACOMI)<br><br>&nbsp;</li></ol></li><li>Literally any for-profit company<ol><li>Carlson Construction</li><li>Sheppard Realty</li></ol></li></ol><h3>Sample Email or Phone Script</h3><p>Here’s a sample email or phone call script template you can use.</p><p>Hey {organization_name} or even better: {name_of_person_working_at_organization},&nbsp;</p><p>My name is {full_name} and I’m a student at {school_name}. I {impressive_extracurricular_you_do_or_fact_about_yourself} and I’m currently searching for scholarships to apply for.</p><p>I was on the {organization_name} website and I noticed I couldn’t find any scholarships. I know that a lot of {organization_category} typically offer scholarships, for example I know that {similar_organization_name} has a scholarship{link_to_similar_organization_scholarship}. So I assumed that you might have one as well.</p><p>If you have one, could you please provide me a link to the scholarship?&nbsp;</p><p>If you don't have one yet and you decide to start one, could you please notify me?</p><p>Thank you so much for your time and enjoy the rest of your week.</p><p>Kindly,</p><p>{full_name}</p><p>Protip: Bonus points if impressive_extracurricular_you_do_or_fact_about_yourself is relevant to the organization</p><h2>Managing Your Scholarships</h2><p>Now that you’ve found scholarships, you’ll need a way of managing</p><h3>Track Deadlines using Google Calendar (or Yahoo, Microsoft calendar etc.)</h3><ol><li>After you find scholarships that you are interested in, create a calendar event for the due date.<br><br>&nbsp;</li><li>Set the location to be the URL of the scholarship.<br><br>&nbsp;</li><li>Set a notification 1 week, 3 days and 24 hours before the deadline. For scholarships that require more work, you can add more notifications.</li></ol><p>This will help you plan time to write your application and make you less likely to procrastinate finishing the application. Plus, it is super easy to find and hard to forget when notifications keep rolling in. Below you will see an example of an event created using Google Calendar.</p><figure class=\"image\"><img src=\"https://lh6.googleusercontent.com/YJv-M1t8zPQ48S-hMyL43G_X60Lsp5GA1G07KL7hCd6UvRXEQH8Oit1YXSEybXO-1qrdGiErzHiCbx_ak3vtRDvVMmteKoVqHS2-QF9roRHUX8Gbn1iGkRxUWtgZKAwA54ljeck6=s0\"></figure><h3>Save Scholarships in Cloud</h3><p>Another easy way to keep track of all of your previous scholarship applications is to save them to a Google Drive folder or Microsoft One folder. As you start to apply to multiple scholarships, you will find that a lot of them ask similar questions.</p><p>By having previous applications easily accessible, you can search for previous answers to similar questions to help you get started on your application.</p><p>Personally, we recommend Google Drive over Microsoft One for the following reasons:<br><br>&nbsp;</p><ol><li>Google Drive is free (up to 15GB), and accessible offline (Microsoft One is free as well)<br><br>&nbsp;</li><li>All your files are stored in the cloud. I think saving documents as Microsoft Word documents that only exist locally on your laptop is a bad idea.<br><br>&nbsp;</li><li>Google Drive has better search functionality so it makes it very easy to find past scholarships or applications.<br><br>&nbsp;</li><li>Really good collaboration tools so you can share an application with someone to help you review and work on it together in real-time. Much easier to share a Google Doc than a Microsoft Word document or PDF.</li></ol><figure class=\"image\"><img src=\"https://lh4.googleusercontent.com/eoLtmpC-luM7v-PPblWapMJywsZg8kwb7IXT1ANzPQ35aPYK72cJLxlEP-AqVDtgEL0HTKX3asKl8ctbwtvq1vkEC66si2a97FNrFyiZP-wDkYTjuvzG4YkCwJHljNLSEY6eAR-l=s0\"></figure><figure class=\"image\"><img src=\"https://lh4.googleusercontent.com/vht_srd3NGpIY_Y1JbA60BFZ0qJ-0lWhGpAzyTa6RPDup5CohLFGqK8z8yb72bW1KUAeF7G2Gojk048ZiWhwR_ej_ZQsVEZBYa4hBQv8XYbEV0Rl3Vdp2vqRgkzspkm3OuOyKSMf=s0\"></figure><h3>Use a Scholarship Helper Chrome Extension</h3><p>Use a scholarship helper chrome extension to help you automate the process of saving a scholarship to a calendar. For example, the Atila Scholarship Helper Chrome Extension allows you to easily save scholarships to your calendar, export to a spreadsheet in Google Drive and add personal notes.</p><figure class=\"image\"><img src=\"https://lh3.googleusercontent.com/I4IH2F2hZIVahuIxYqrW5P7f2h-Nj31xylATkg0jCfJtBacuDQiB_Tf2UrUjuR29KvQv57CICU0Zve8IE6Dp031tJYOLJpSC13dULa-gNBs2NEsW_p9vpEo82Y6mprPDFHPglwjb=s0\"></figure><h2>Clearing up Assumptions People Make About Scholarships</h2><h3>&nbsp;</h3><h3>Assumption: I don’t have the grades or Extracurriculars to win a scholarship</h3><h3>&nbsp;</h3><h3>Reality: Many scholarships don’t have grade requirements or require you to have a lot of extracurriculars or volunteer experience.&nbsp;</h3><p>&nbsp;</p><p>Sometimes they just require that you’ve done something cool or to write about a topic that you’re interested in, such as:</p><ol><li>Ayn Rand Institute Essay Contests | <a href=\"https://atila.ca/scholarship/ayn-rand-institute-atlas-shrugged-essay-contest\">Atlas Shrugged</a> | <a href=\"https://atila.ca/scholarship/ayn-rand-institute-anthem-essay-contest-cz2jzxih\">Anthem</a> | <a href=\"https://atila.ca/scholarship/ayn-rand-institute-the-fountainhead-essay-contest\">The Fountainhead</a></li><li><a href=\"https://atila.ca/scholarship/environmental-artworks-foundation-of-alberta-poster-photograph-contest-hg9hcq11\">Environmental Artworks Foundation of Alberta Poster &amp; Photograph Contest</a></li><li><a href=\"https://atila.ca/scholarship/poetry-nation-poetry-contest-kpnsi9pt\">Poetry Nation Poetry Contest</a><br>&nbsp;</li></ol><h3>Assumption: I have student loans but I already graduated so it’s too late for me</h3><h3>Reality: There are scholarships to pay off student loans, even if you have already graduated:</h3><ol><li><a href=\"https://atila.ca/scholarship/forget-your-student-debt-no-essay-grant-fq1hd6re\">Forget Your Student Debt. No-Essay Grant</a></li><li><a href=\"https://atila.ca/scholarship/fab-aid-student-debt-relief-initiative\">FAB AID Student Debt Relief Initiative</a></li><li><a href=\"https://atila.ca/scholarship/scholly-stimulus-program-tin38hx0\">Scholly Stimulus Program</a></li></ol><h3>Assumption: I Want a Scholarship that requires Little Effort</h3><h3>Reality: Most low-effort scholarships are basically just lottery scholarships</h3><figure class=\"image\"><img src=\"https://lh5.googleusercontent.com/lWBrnM51ymgGp7d1M2PMcEjQXgH9at-fDr1KxL5CL7oX0GsSh9a2MSix7Cow7gFpezk5v5uJvvbmaWbdS1XPmifjuKIsRj_TkjeSIelnc9qacD767-nucDLi0qxnfjgF6MGbj28J=s0\"></figure><p>We get it, being a student is hard. With school, work, extracurriculars, personal life it can be hard to find time to apply for scholarships. But nothing good in life comes easy. While there are scholarships that don’t require you to write an essay or do any work. Just “click to apply” those scholarships usually have a lot of applicants and because there is little information about yourself it ends up being based on luck instead of merit.</p><p>While there’s nothing wrong with applying to some of those scholarships some of the time. We wouldn’t recommend it as a sustainable way to get scholarships</p><h3>Assumption: It’s a waste of my time I’m not going to Win&nbsp;</h3><h3>Reality: Applying for scholarships pays better than most student jobs</h3><p>This is a very common assumption people often make. In fact, we hear this so often that we made <a href=\"https://docs.google.com/spreadsheets/d/1I0T3thpmZqxWStMy32LwmM923bFk-T7Datrgq0_06Oo/edit#gid=0\">an entire spreadsheet to calculate this</a>. Suppose the following:</p><ol><li>Apply to 20 scholarships, with an average value of $2,000</li><li>Spend 2 hours on each scholarship</li><li>Have a 5% win rate so you win 1 scholarship</li></ol><p>You would have made $50/hour!&nbsp;</p><p>Now, compare this to a part-time job. The average student in Canada makes CAD $16.55/hr ($12.97 USD) (<a href=\"https://ca.indeed.com/career/student-worker/salaries\">Indeed Canada</a>, <a href=\"https://ca.talent.com/salary?job=student\">Talent</a>) and in the US it’s USD $8.47/hr ($10.82 CAD)&nbsp; (<a href=\"https://www.indeed.com/career/student-worker/salaries\">Indeed USA</a>, <a href=\"https://www.payscale.com/research/US/Job=Student_Worker/Hourly_Rate\">Payscale</a>).</p><p>So you can make triple the amount of money from applying to scholarships than you do from the average part-time job.</p><figure class=\"image\"><img src=\"https://lh4.googleusercontent.com/tg2bQox4CTdLGC7jtDX7zNo3273pWKU7TeAcnTg1c3xNy-w7ZWq_DX3siaEwZQb3GNIIz7zP8bCNksfxHDyQ7IU2ncm88MGexEyuJZ_L-sUDQIMo7si4yHf1fG3bipMGwuT9wIUs=s0\"></figure><p>When you consider the fact that as you apply for more scholarships, you can start reusing essay responses, transcripts, reference letters. Also, combined with the tools and tips we suggested here you could save even less time and find higher-paying scholarships with less competition. That number could be even higher.</p><p>There’s also a lot of intangible benefits to scholarships beyond just the money:<br>&nbsp;</p><ul><li>Some scholarships offer internships and jobs in addition to the money</li><li>Networking opportunities with the sponsors and other winners</li><li>Improve your communication skills and some scholarships require you to make something cool ( <a href=\"https://atila.ca/scholarship/atila-women-creators-scholarship-6jkhii4p\">this one</a> or <a href=\"https://atila.ca/scholarship/atila-continuous-learning-scholarship-j11gu8k5\">this one</a>), which you can add to your portfolio whether or not you win</li><li>It looks good on your resume or LinkedIn</li></ul><h2>Conclusion</h2><p>As a student, there are so many resources available to help you pay for school and earn money. Hopefully, this guide has given you some ideas about how to fund your education!&nbsp;</p><p>If you have any comments or questions about this blog post, let us know! We read every comment and reply to most.&nbsp; You can leave a comment about this blog post on post on the r/Atila subreddit. Or join our discord.&nbsp; You can also follow or DM us on Twitter or Instagram @atilatech</p>",
			"date_created": "2021-09-10T03:07:50Z",
			"description": "The average university student graduates with $28K in student debt, yet at the same time, every year there are millions of dollars in scholarships that go unclaimed!\n\nOur guide hopes to solve both of those problems.",
			"header_image_url": "https://i.imgur.com/95qV22q.png",
			"published": true,
			"up_votes_count": 0,
			"down_votes_count": 0,
			"up_votes_id": [],
			"down_votes_id": [],
			"metadata": {},
			"related_items": null,
			"user": {
				"first_name": "Tomiwa",
				"last_name": "Ademidun",
				"username": "tomiwa",
				"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fljy9s5nm-Ezc5Hyf.jpg?alt=media&token=2391816e-c546-4b11-b232-0cc91f9f3547",
				"id": 1
			}
		},
		{
			"id": 154,
			"contributors": [],
			"title": "How we Write Frontend React Code and Create Pull Requests at Atila",
			"slug": "how-we-write-frontend-react-code-and-create-pull-requests-at-atila",
			"alternate_slugs": [],
			"body": "<h2>Atila’s Frontend Tech Stack</h2><p>&nbsp;</p><ul><li>React<ul><li>Redux</li></ul></li><li>Ant Design + a little bit of Boostrap</li><li>Storybook</li><li>Jest and Enzyme</li><li>CircleCi</li><li>Netlify</li><li>Most of our team uses VCCode for our javascript IDE because it’s free and <a href=\"https://www.geeksforgeeks.org/top-10-extensions-for-reactjs-in-vscode/\">there are so many</a> <a href=\"https://marketplace.visualstudio.com/itemdetails?itemName=dsznajder.es7-react-js-snippets\">great extensions</a><ul><li>Also, <a href=\"https://www.windowscentral.com/microsoft-announces-visual-studio-code-web-then-pretends-it-didnt?amp\">there might be a web-based version of VS Code coming soon</a> (?)</li></ul></li></ul><p>For Atila’s&nbsp; (old) tech stack, See: <a href=\"https://atila.ca/blog/tomiwa/why-we-chose-angular-over-react-and-django-over-ruby-on-rails-for-atila-the-essential-software-startup-techstack/#why-angular-and-not-react\">Why We Chose Angular over React and Django Over Ruby on Rails for Atila.ca: The Essential Software Startup Tech Stack</a></p><h2>Before the Pull Request</h2><ol><li>Make an issue first<ol><li>If someone else is working on this issue, what’s the minimal amount of information they need to get started without having to ask you for clarification</li><li>The goal is to enable others to <a href=\"https://about.gitlab.com/company/culture/all-remote/asynchronous/\">work async</a></li><li>Add permalinks or past PRs that have similar functionality</li><li>Use pictures or videos for conveying information that can’t be conveyed</li><li>Include Figma Link</li></ol></li></ol><h3>PRs should be Async</h3><p>The goal is to minimize synchronous communication when creating and reviewing a PR.</p><ul><li><a href=\"https://blog.doist.com/asynchronous-communication/\">https://blog.doist.com/asynchronous-communication/</a></li><li><a href=\"https://about.gitlab.com/company/culture/all-remote/asynchronous/\">https://about.gitlab.com/company/culture/all-remote/asynchronous/</a></li><li><a href=\"https://buffer.com/resources/asynchronous-communication/\">https://buffer.com/resources/asynchronous-communication/</a></li></ul><h2>During the Pull Request</h2><ol><li>Descriptive title, and description<ol><li>What issue does it close?</li><li>What did it do before? What does it do now?</li><li>How can a reviewer verify that this works?</li><li>Don’t feel obligated to repeat information already in issue, but also try to have all necessary context in one place</li><li>As little information as possible as much as necessary</li><li>Make a template<ol><li>Examples:</li><li><a href=\"https://github.com/atilatech/client-web-app/blob/master/pull_request_template.md\">https://github.com/atilatech/client-web-app/blob/master/pull_request_template.md</a></li><li><a href=\"https://github.com/stevemao/github-issue-templates\">https://github.com/stevemao/github-issue-templates</a></li><li><a href=\"https://github.com/devspace/awesome-github-templates\">https://github.com/devspace/awesome-github-templates</a></li></ol></li></ol></li><li>Include multimedia examples in the PR description<ol><li>Screenshots</li><li>Figma Link (if not included in Issue)</li><li>Use <a href=\"https://storybook.js.org/\">Storybook</a> for easy previewing without setting up data or navigating in UI into desired component</li><li>Link to Live Demo in Staging<ol><li>Use Netlify CLI deploy in your CI to get the unique deploy URL</li><li>Set up mock data using <a href=\"https://github.com/ctimmerm/axios-mock-adapter\">axios-mock-adapter</a></li></ol></li><li>Loom recording (use <a href=\"https://chrome.google.com/webstore/detail/loom-for-chrome/liecbddmkiiihnedobmlmillhodjkdmb\">Loom Chrome Extension</a> for Github Integration)<br><br>&nbsp;</li></ol></li><li>Use Development/Debugging Tools:<ol><li><a href=\"https://chrome.google.com/webstore/detail/react-developer-tools/fmkadmapgofadopljbjfkapdkoienihi?hl=en\">React Devtools Extension</a></li><li><a href=\"https://github.com/reduxjs/redux-devtools\">Redux Devtools Extension</a></li><li>Storybook</li></ol></li><li>Add Tests and Documentation<ol><li>Test on Mobile</li><li><a href=\"https://deviq.com/principles/boy-scout-rule/\">Boy scout rule</a> lite:<ol><li>“Always leave the code in a better state than you found it”</li><li>If you found an existing piece of code or process confusing, document it for future reference</li><li>Test coverage % must be at least better or the same as when you started<br><br>&nbsp;</li></ol></li></ol></li></ol><h2>After the Pull Request<br><br>&nbsp;</h2><p>After the Pull Request is finished, you will need other people to help you review it. This is where humans get involved and it’s no longer a purely technical exercise but also social and psychological.</p><p>For technical people, we underestimate the importance of the human element of coding. But communicating with other humans effectively is just as important as communicating with computers effectively.</p><ol><li>Before asking others to review your code, read: <a href=\"https://mtlynch.io/code-review-love/\">https://mtlynch.io/code-review-love/</a><ol><li>Review your own code first</li><li>Don’t just answer the question for 1 person, answer it for EVERYONE</li><li><a href=\"https://mtlynch.io/code-review-love/#8-respond-graciously-to-critiques\">Respond graciously to critiques</a></li></ol></li><li>Code reviewers read: <a href=\"https://mtlynch.io/human-code-reviews-1/\">https://mtlynch.io/human-code-reviews-1/</a><ol><li>2 Reviewers, at least one should run the code on their local machine</li><li><a href=\"https://mtlynch.io/human-code-reviews-1/#let-computers-do-the-boring-parts\">Let computers do the boring parts</a></li><li><a href=\"https://mtlynch.io/human-code-reviews-1/#settle-style-arguments-with-a-style-guide\">Settle style arguments with a style guide</a></li><li><a href=\"https://mtlynch.io/human-code-reviews-1/#start-reviewing-immediately\">Start reviewing immediately</a></li><li><a href=\"https://mtlynch.io/human-code-reviews-1/#start-high-level-and-work-your-way-down\">Start high level and work your way down</a></li><li><a href=\"https://mtlynch.io/human-code-reviews-1/#be-generous-with-code-examples\">Be generous with code examples</a></li><li><a href=\"https://mtlynch.io/human-code-reviews-1/#never-say-you\">Never say “you”</a></li><li><a href=\"https://mtlynch.io/human-code-reviews-1/#frame-feedback-as-requests-not-commands\">Frame feedback as requests, not commands</a></li><li><a href=\"https://mtlynch.io/human-code-reviews-1/#tie-notes-to-principles-not-opinions\">Tie notes to principles, not opinions</a></li></ol></li></ol>",
			"date_created": "2021-09-05T16:26:08.498249Z",
			"description": "The process we follow when writing frontend code on Atila. Including React and Github best practises and advice on how to make life easier for the developer and the code reviewer.",
			"header_image_url": "https://lh4.googleusercontent.com/q0VLeQyAmFMbqOli5Q1ZO0eeE6h52dA-joff3vKe8wlaJNjHjbnJlH6CAqTSVx02rF_M4ru1S1cbwtcNpWWnWyVe2_HoDyV4buzza6cR8ITqHTmFLZty2Y2af9zpJAef5C9tSk0X=s0",
			"published": true,
			"up_votes_count": 0,
			"down_votes_count": 0,
			"up_votes_id": [],
			"down_votes_id": [],
			"metadata": {},
			"related_items": null,
			"user": {
				"first_name": "Tomiwa",
				"last_name": "Ademidun",
				"username": "tomiwa",
				"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fljy9s5nm-Ezc5Hyf.jpg?alt=media&token=2391816e-c546-4b11-b232-0cc91f9f3547",
				"id": 1
			}
		},
		{
			"id": 152,
			"contributors": [],
			"title": "The Dispersal of Human Capital",
			"slug": "the-dispersal-of-human-capital",
			"alternate_slugs": [],
			"body": "<p>If you’re a knowledge worker (i.e. you work in Tech, Consulting, Finance, Sales, Design, Media, Content Creation, Law etc.), pay close attention to what's happening around you.</p><p>Now is the time to invest in yourself, because the market value for your labour is about to go through the roof.</p><p>This is because of what I call the <a href=\"https://www.profgalloway.com/the-great-dispersion/\">dispersal</a> of human capital.</p><p>&nbsp;</p><p>If you have a comment, leave it on <a href=\"https://www.reddit.com/r/tomiwa/comments/p1njw2/the_dispersal_of_human_capital/\">the Reddit post for this essay</a> on <a href=\"https://www.reddit.com/r/tomiwa/\">r/tomiwa</a>.</p><p>&nbsp;</p><p>Let’s start with a quick story. I <a href=\"https://www.ivey.uwo.ca/hba/student-life/hba-student-profiles/tomiwa-ademidun/\">studied software engineering and business in University in Canada</a>. After graduating, a lot of my ambitious engineering friends went to California to work in tech and my ambitious business friends went to New York to work in finance. Then two things happened:</p><p>The lucky ones ended up making 2-3X more than those of us who stayed in Canada even though we all did the same work. The unlucky ones got their visas denied (some of them found out at the airport!).</p><p>In this new world of remote work, neither of these two things will happen again.</p><p>The last 12 months have shown us that we can work remotely from anywhere in the world and still be productive. The next 12 months will show us the implications of what this really means.</p><p>Currently, the labour market is hugely arbitraged by location. I’ve <a href=\"https://atila.ca/schools\">written before</a> about how your salary as a new grad software engineer at Google can be 40% more simply by living in NYC or Silicon Valley instead of Waterloo, even though they are in the same time zone, have the same level of experience and are doing the same work.</p><figure class=\"image\"><img src=\"https://lh6.googleusercontent.com/8c6u88zbs3a0RiimQdNRsTBudUFtHi9BnXbBArzosF_ieBKho5S4lcDR2w-cxX1Lr5418qQmbMNLzTh7ShRdjbAmdptpyY4hhsIRYDO-_wVe68-4cF9JBsHcl1wM2TD_r87bENI9\"></figure><p>Prediction: companies will stop “rewarding” employees for living in high-wage cities and “punishing” employees that live in low-wage cities. Everyone will get compensated based on value-added not location and it will be up to employees to decide where they want to live.&nbsp;</p><p>See <a href=\"https://www.helpscout.com/blog/remote-employee-compensation/\">Remote Employees Shouldn’t Be Paid Less Based on Geography</a> and <a href=\"http://blairreeves.me/2020/05/22/paying-remote-employees-fairly/\">Paying Remote Employees Fairly</a> for more on this.</p><h2>&nbsp;</h2><h2>What Fully Remote Really Means</h2><h3>&nbsp;</h3><h3>The Labor Market goes Hyper-Efficient</h3><p>One of the reasons we collectively pretend that the “hybrid model” is a good idea is because it avoids the elephant in the room on the implications of fully remote companies. So let's address it.</p><p>Once most companies go fully remote, it means that the labour market will become global and hyper-efficient.</p><p>For those of you who studied economics, you know that efficient markets are better collectively, but not necessarily better individually.</p><p>In layman's terms, those who are good at what they do will make a lot of money and those who are overpriced will see their compensation go down or given to someone else altogether.</p><p>People will complain to their governments and some form of protectionism will slow this down. However, you can’t stop the train of progress, you can only temporarily slow it down.</p><p>Also, there's the whole taxes thing but I see these as logistical details that will get sorted out.</p><p>To see how this plays out in the long term, I strongly recommend reading <a href=\"https://amzn.to/2Uj0Hdx\">The Sovereign Individual</a>.</p><p>&nbsp;</p><h3>Who has more Leverage?</h3><p>Ultimately the return to in-office comes down to leverage. Who has more leverage? Employees or management?</p><p>I think that high-skilled knowledge workers who can easily find other jobs, have enough leverage and can ask for remote-friendliness the same way people negotiate salary or vacation time.</p><p>Companies will realize that to retain the top talent they will have to become more remote-friendly or pay people more to come into the office.</p><p>Ironically, although a lot of people ask for remote-friendly work, a remote-first society will not necessarily be in everyone’s best interests.</p><p>A lot of people in high-wage countries are overpaid but are protected by the fact that companies had to hire employees based on physical proximity.</p><h3>&nbsp;</h3><h3>Outsourcing is the past, the future is Upsourcing</h3><p>I think people are too worried about their jobs being outsourced to low-wage countries and are not worried enough about their jobs being upsourced to high-impact people.</p><p><a href=\"https://twitter.com/tomiwa1a/status/1425054843413143565\">Upsourcing is a term I made up</a> and it’s when your job is outsourced to a MORE expensive or equally expensive person in a different country, but that person is more productive/better than you for an equal amount of money. So they generate more output per dollar paid.</p><p>The same way people used to stereotype that made in China was just for cheap products and services, then companies like OnePlus, Huawei, TikTok etc showed that you can get high-quality products in China. It’s simply a case of you get what you pay for, just like every other country.</p><p>Similarly, people think that outsourcing is merely for cost-cutting and people overseas can’t do high-quality work, speak good English or understand “Western cultural norms”. But that’s a myth perpetuated by companies only looking overseas when they want to cut costs. You get what you pay for.</p><p>Things get very interesting when companies start to look overseas not to optimize for costs, but to optimize for talent.</p><p>Once companies start offering San Francisco, NYC or even Boston salaries to engineers, bankers, consultants, designers, content creators and even senior management and executives in Lagos, Bangalore, Moscow, São Paulo, Toronto, etc. I'm sure they will be impressed by the results.</p><p>Once companies go fully remote (or even mostly remote), the physical location of a company no longer has any correlation to the physical location of the workforce.</p><p>The only thing that MAYBE matters is timezone and that can be handled with <a href=\"https://twitter.com/tomiwa1a/status/1407500603203391493\">async work</a>.</p><h2>&nbsp;</h2><h2>My advice</h2><p>When a market becomes more efficient, it means <a href=\"https://en.wikipedia.org/wiki/Price_discovery\">price discovery</a> sets in quicker so you want to make sure you're fairly valued or undervalued, not overvalued. Here's my advice:</p><h3>Upskill</h3><p>Whatever field you work in, now is the time to make sure you’re good at it. Level up your skills invest in your <a href=\"https://atila.ca/blog/tomiwa/open-the-gates#signalling-credentialing-networking-and-educatio\">education, credentialing, signalling and networking</a>. Develop your soft skills, develop your technical skills. Like I said earlier, the labour market is about to get super-efficient. This means that people will start getting paid something closer to their true worth. Make sure you deserve what you want to be worth.</p><h3>Network</h3><p>Now is the time to start building relationships with people in your career. Think beyond just people in the same country as you. Think of people in different countries as well. Send people cold emails and DMs. Leverage the internet and social media to engage with people that you want to work for and with. Send them a one-pager, slide deck, infographic, anything about something you think is both impressive to them and relevant to your work.</p><p>More advice on this here: <a href=\"https://atila.ca/blog/tomiwa/how-i-got-interviews-at-google-facebook-and-bridgewater/\">How I got interviews at Google, Facebook and Bridgewater</a>.&nbsp;</p><h3>Test the Market&nbsp;</h3><p>You don’t have to limit your job search to companies in your region or even in your country. Like I said, even if you don’t want to move or you are worried about not getting a Visa, both of those issues might turn out not to be relevant. See what options are out there, you might be surprised by what you find.</p><h2>Income Inequality</h2><p>This means that people will no longer have to leave their city or country to make high incomes.</p><p>This also has interesting implications for <a href=\"https://twitter.com/tomiwa1a/status/1407487298879492097\">income inequality</a>.&nbsp;</p><p>In the past, a group of consulting friends in NYC made more than an equivalent group of consulting friends in Toronto or Bengaluru. But, that was okay, because both groups of people in each location were the same relative to each other.</p><p>Now, amongst a group of consulting friends in Toronto, one of them might be working for an NYC office, one might be working for a London office and only one of them might be working for a Toronto office. The salary ranges between people living in the same city working the exact same job will widen.</p><h2>The Hybrid Model Pump Fake</h2><p>Prediction: Claims of companies adopting a hybrid model will prove to be greatly exaggerated.</p><p>Working fully remote for 12 months then switching to hybrid is like switching from listening to CDs to streaming Spotify because your neighbourhood HMV closed then switching back to listening to CDs. If a new HMV opens up 12 months later, are you going to start listening to CDs 3 days a week?</p><h2>The New Watercooler</h2><p>Some people claim they want to return to the office because they miss the social aspect. But social isolation wasn’t caused by remote work, it was caused by the pandemic restrictions.</p><p>Once things start opening up again, you will no longer need work to get your socializing. Gyms, daycare, community organizations, restaurants, sports, bars etc. everything will be open again. Also, because we are working remotely you will be able to quickly go with your friends to an afternoon spin class at 12 pm instead of the 6 PM slot that is always booked. Remote work will allow people to socialize more, not less.&nbsp;</p><p>For people who want a change of scenery but without a long commute, we will see the rise of neighbourhood and suburban co-working spaces.&nbsp;</p><p>Coworking spaces will be the new way that we network and get to know people in our neighbourhood. I predict that coworking spaces are going to become very popular. Not just for tech-savvy digital nomads in exotic locations like Bali and Thailand. Coworking spaces will be popular in suburbs and in local communities as well for people who just want to leave their house and meet people.</p><p>Bonus prediction: Clubs and dating apps have proven to be underwhelming options for meeting people. I’m predicting that in the near future a lot of relationships (platonic and romantic) will be formed in coworking spaces.</p><p>Ironically, this would have been a perfect opportunity for WeWork, but we’ll get to the real estate implications in part 2).</p><p>For a great article about the future of WeWork in a remote work world, read Dror Poleg and Packy McCormick’s fascinating conversation: <a href=\"https://www.notboring.co/p/we-good-now\">We Good Now?</a></p><h2>The Future is Distributed</h2><p>This is not mutually exclusive and universal. Yes, some companies and people truly do prefer working from the office. There will be a mix of both. For example, here’s an interesting article on someone who seems to prefer working from the office: <a href=\"https://www.thecut.com/2021/06/ask-a-boss-i-hate-working-from-home.html\">‘Am I the Only One Who Hates Working From Home?’</a>.&nbsp;</p><p>Whether this person represents a majority or minority of people, I don’t know. Anecdotally, I think most people prefer remote work. Quite frankly, even some of the people claiming they “can’t wait” to be back in the office, I don’t believe them. I think it’s a case of <a href=\"https://en.wikipedia.org/wiki/Revealed_preference\">stated vs revealed preferences</a>. Although they might “say” they want to be back in the office, they are underestimating how much they’ve gotten used to the convenience and productivity of working from home. Especially once other parts of society start to open up as well.</p><p>The internet didn’t completely kill the newspaper industry, it dealt it a fatal blow. Similarly, remote work doesn’t mean the absolute end of the work from the office. But the days of working from the office being mainstream is behind us.</p><p>The writing is on the wall, the future is here and it’s <a href=\"https://twitter.com/tomiwa1a/status/1407511522960621569\">distributed</a>.</p><p>&nbsp;</p><p>Next, I will talk about the Dispersal of Human Education, in part two I will talk about the Dispersal of Human Living in terms of Real Estate and why most people think real estate is a safe investment but I think it’s the riskiest investment you can make.</p><h2>Part 1.5: The Dispersal of Human Education</h2><p>I accidentally realized that I had already written all my thoughts on the dispersal of human education here: <a href=\"https://atila.ca/blog/tomiwa/open-the-gates\">Open The Gates of Education Freedom: How to Make University Higher Quality and More Affordable</a>.</p><p>&nbsp;</p><p>Image Credits: <a href=\"https://www.gettyimages.com/search/photographer?family=creative&amp;photographer=NicoElNino\">NicoElNino</a> / Getty Images</p>",
			"date_created": "2021-08-10T11:44:59.393423Z",
			"description": "If you’re a knowledge worker (i.e. you work in Tech, Consulting, Finance, Sales, Design, Media, Law etc.)\n\nNow is the time to invest in yourself, because the market value for your labour is about to go through the roof.\n\nThis is because of what I call the dispersal of human capital.",
			"header_image_url": "https://lh5.googleusercontent.com/ewAAG-Vt6VmNl9iD0Oymfs9IDjLZGiL3UpYrw4yrRevoQKtQYRcRiyopUHZvsa7RbvIZITxP3fdI3ca76e-p6L7gtfbLrDrEgdpbb1mgLbewf82TCd1vEQOXw1mGk4u2BxMXO-cm",
			"published": true,
			"up_votes_count": 0,
			"down_votes_count": 0,
			"up_votes_id": [],
			"down_votes_id": [],
			"metadata": {},
			"related_items": null,
			"user": {
				"first_name": "Tomiwa",
				"last_name": "Ademidun",
				"username": "tomiwa",
				"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fljy9s5nm-Ezc5Hyf.jpg?alt=media&token=2391816e-c546-4b11-b232-0cc91f9f3547",
				"id": 1
			}
		},
		{
			"id": 119,
			"contributors": [],
			"title": "How We Designed the Atila Black and Indigenous Scholarship Graphic",
			"slug": "how-we-designed-the-atila-black-and-indigenous-scholarship-graphic",
			"alternate_slugs": [],
			"body": "<p><a href=\"https://twitter.com/llmercer_/status/1420650946137182210\">Link to Twitter thread</a></p><p><a href=\"https://www.tiktok.com/@atila.tech/video/6991494155302145286?_d=secCgYIASAHKAESMgowiQLLmsIWkCntpTiIKqO1LQ1jn0t5aF%2B3U%2Fgjf74LV9UMgPzZcb8eH%2FbE5KmUH9COGgA%3D&amp;checksum=e7032eb4278fa2493c2081c2a8955374fc7e354e32e45651a232e6ad40567aaf&amp;language=en&amp;preview_pb=0&amp;sec_user_id=MS4wLjABAAAAyf94NurHh_Oo7Xxi24V7F0Z4Jpi5ZXdgvfo_8xjZRodvjnKMjweOJXzDiWIashwW&amp;share_app_id=1233&amp;share_item_id=6989368715875847430&amp;share_link_id=0ba89d51-df02-4a6e-aadc-ac3559ae2284&amp;source=h5_m&amp;timestamp=1627358648&amp;u_code=dgech481a0le71&amp;user_id=6916974111122211846&amp;utm_campaign=client_share&amp;utm_medium=android&amp;utm_source=copy&amp;_r=1&amp;is_copy_url=0&amp;is_from_webapp=v1&amp;sender_device=pc&amp;sender_web_id=6964910393975588358\">Link to TikTok video</a></p><p>Recently, we redesigned the graphic for the <a href=\"https://atila.ca/scholarship/atila-black-and-indigenous-scholarship-oj0gx3at\">Atila Black and Indigenous Scholarship</a>. With the use of <a href=\"https://www.figma.com\">Figma </a>and some unique sources of inspiration, we were able to create meaningful designs to represent both Black and Indigenous students!</p><h2>&nbsp;</h2><h2>The Kente Graduation Cloth</h2><p>The <a href=\"https://www.instagram.com/p/CJbKoG2MWJD/\">original graphic</a> for the Atila Black and Indigenous Scholarship can still be found on <a href=\"https://www.instagram.com/atilatech/\">our instagram</a>. This happened to be the initial source of inspiration for creating the new graphic.&nbsp;</p><figure class=\"image\"><img src=\"https://lh6.googleusercontent.com/2D_2tcadYKkYtLL1Ut4RHSn0YlScUY3lQgqCkt9jafQRerl-tzSfhACBMUIyWsa2AX5QdHJq4-T5U9Iguss_zdmV6FiP30bFUPe0zTQITNOL_pJLI7j8epKMc9O2UhRibIVmTRqj\"></figure><p>If you look at the image in the bottom left corner, you can see one of the students wearing a <a href=\"https://www.aaihs.org/the-history-and-significance-of-kente-cloth-in-the-black-diaspora/\">Kente graduation cloth</a>. While each stole and its <a href=\"https://en.wikipedia.org/wiki/Warp_and_weft#:~:text=Warp%20and%20weft%20are%20the,%2Dand%2Dunder%20the%20warp.\">warp and weft motifs</a> represent something unique to the wearer, for Black students the tradition of wearing a Kente cloth at graduation signifies the successful completion of their degree while honouring their African heritage.</p><p>I knew that I had to include the Kente cloth in the design. I started with a base image from <a href=\"https://storyset.com/\">Storyset by Freepik</a>, and then edited away. I changed the colour scheme and orientation, altered the gown, and added the stole.&nbsp;</p><figure class=\"image\"><img src=\"https://i.imgur.com/AcFOxus.jpg\"></figure><p>Once satisfied with the design, I had to make sure that the Kente cloth colours were correct. A quick online search of <a href=\"https://www.google.com/search?q=kente+graduation+cloth&amp;rlz=1C1GCEA_enCA903CA903&amp;sxsrf=ALeKk01kmH2kwjl0x38G2Wlyjgx6JkQcBA:1624056885036&amp;source=lnms&amp;tbm=isch&amp;sa=X&amp;ved=2ahUKEwjwwuito6LxAhXM7Z4KHaGWA48Q_AUoAXoECAEQAw&amp;biw=1920&amp;bih=969#imgrc=W6iG_MDYAiweoM\">Kente graduation cloth images</a> provided a great photo with clear, bold colours.&nbsp;</p><p>Using the “Inspect” tool, I was able to obtain the exact hex colour codes from the online image for each colour in the stole. Check out the GIF below to see how I inspected the colours on Google Chrome.</p><figure class=\"image\"><img src=\"https://i.imgur.com/SzjERec.gif\"></figure><p>The hex color codes used in the design are #a91726 for red, #fbce3d for yellow, and #05a172 for green.&nbsp;</p><figure class=\"image\"><img src=\"https://i.imgur.com/Xou5xJC.jpg\"></figure><h2>&nbsp;</h2><h2>A Cree Content Creator</h2><p>Once the design representing Black students was complete, it was time to create a design to represent Indigenous students. I’ll admit, inspiration didn’t immediately jump out at me.&nbsp;</p><p>What finally sparked an idea was actually some mindless scrolling on Instagram. I came across a post from a Cree content creator who I follow. Her name is Kendra Jessie and she is Sucker Creek First Nation from Alberta. You can find her on Instagram at <a href=\"https://www.instagram.com/kendrajessie/\">kendrajessie</a>. Her photos in traditional clothing were the source of inspiration, but there was <a href=\"https://www.instagram.com/p/CHZLGg4AXa4/\">one image in particular </a>that I chose to model the design after.</p><figure class=\"image\"><img src=\"https://i.imgur.com/TcfOBoK.jpg\"></figure><p>Once again, I started with a base image from Storyset by Freepik. This time, the base image required significantly more alterations to create the final design. I changed the limb positions, created entirely new clothing pieces, and modified the colour scheme.&nbsp;</p><p>(Fun fact: The ribbons flowing from the cape are actually all the exact same shape. I just copied and pasted the shape many times over and changed the orientation, sizing, and colour of each iteration to create the effect.)</p><figure class=\"image\"><img src=\"https://i.imgur.com/GlyBAFs.jpg\"></figure><p>There was also a lot of fine detail work that went into this design. Just one of the detailed pieces created to include on the traditional dress required over 10 layers on Figma!</p><figure class=\"image\"><img src=\"https://i.imgur.com/FIZsh6C.jpg\"></figure><p>Afterwards, “Inspect” was used again to get the hex codes from Kendra’s image and ensure that accurate colours were used in the design.</p><p>&nbsp;</p><p>Voila! With a meaningful design for Black and Indigenous students each, the Atila Black and Indigenous Scholarship graphic was complete!</p><p>You can see the graphic for yourself <a href=\"https://www.instagram.com/p/CQE7BaJM_f7/\">here </a>and <a href=\"https://atila.ca/scholarship/atila-black-and-indigenous-scholarship-oj0gx3at\">here</a>.</p><p>&nbsp;</p><ul><li><a href=\"https://www.aaihs.org/the-history-and-significance-of-kente-cloth-in-the-black-diaspora/\">The History and Significance of Kente Cloth in the Black Diaspora</a></li><li><a href=\"https://www.sankofaedition.com/blogs/know-sankofa/what-is-a-kente-cloth-graduation#:~:text=While%20a%20typical%20graduate's%20stole,traditional%20West%20African%20Kente%20cloth.&amp;text=Kente%20was%20integrated%20by%20black,adopted%20into%20hip%20hop%20fashion\">What is a kente cloth graduation?</a></li></ul>",
			"date_created": "2021-07-29T03:37:36.144432Z",
			"description": "Recently, we redesigned the graphic for the Atila Black and Indigenous Scholarship. See how we were able to create meaningful designs to represent both Black and Indigenous students from some unique sources of inspiration!",
			"header_image_url": "https://i.imgur.com/IVO5kBB.png",
			"published": true,
			"up_votes_count": 0,
			"down_votes_count": 0,
			"up_votes_id": [],
			"down_votes_id": [],
			"metadata": {},
			"related_items": null,
			"user": {
				"first_name": "Lauren",
				"last_name": "Mercer",
				"username": "llmercer",
				"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fscholarship-images%2Fedo55xjv-Profile%20Photo.jpg?alt=media&token=1ee1db2a-f81b-4391-ade7-e19265600bda",
				"id": 1816
			}
		},
		{
			"id": 118,
			"contributors": [],
			"title": "Use your Personal Email (preferably gmail), not Your School Email, When Signing up for an account on Atila",
			"slug": "use-your-personal-email-preferably-gmail-not-your-school-email-when-signing-up-for-an-account-on-atila",
			"alternate_slugs": [],
			"body": "<p>We noticed that users who signed up with their school emails or non-gmail domains weren’t receiving emails from Atila, causing them to miss out on important scholarship information. We recently notified users who signed up with their school emails to switch to using their personal email addresses. We also recommended users with non-gmail domains (hotmail, outlook, live, yahoo, etc.) to switch to gmail if they have one.&nbsp;&nbsp;</p><p>Here is a message showing one of our emails getting blocked by outlook:</p><figure class=\"image\"><img src=\"https://lh3.googleusercontent.com/xnSVP-DTxOJN-lLcCX3xq3mpQ5MiTTLzbKoUfDkqHpftdo2oo6DWZSQl4O8LtraxTndBBfRNW16G3AFW5HL4xjl4vgvT1Sh_JHEDKzGvJuxi6HVWwpNNdloyWSokgA39GHxnw05R\" alt=\"Screenshot from 2020-11-01 08-12-03\"></figure><p>Here is an example of our email getting blocked by a school server:</p><figure class=\"image\"><img src=\"https://lh4.googleusercontent.com/aYLG5BeXR-GyHrNL-ZkzqVm9VcVPVl-U0A2_Cfq0jhIagq2W_rcwlqWT6a2BXQmIkCnqAjVFiFD7vVtJKsSpU6B_9pNkdF9E48xAEHuUtNxXwf9Y69fCbChCv4fY3aJ1P3n4dB4M\" alt=\"Screenshot from 2020-11-01 08-16-02\"></figure><p>To prevent this problem from escalating, we added a message on our registration page to encourage incoming users to register with their personal, preferably a gmail, address.</p><figure class=\"image\"><img src=\"https://lh4.googleusercontent.com/KmqUzqKHixd0gqH1JwJ81D-ZczRl0TAgNy_6iE30TsbrFQ4Va9TOXNQBG3Jg58BoC-Xp9PLPxBbkff1-erzYF8WnZN_PzE2kClm4PTMStO6ZxK9VkN0rQWmPZfKFezT9pjpo9xsZ\"></figure>",
			"date_created": "2021-07-28T05:59:30.000259Z",
			"description": "Here is why we recommend new users to register with their personal email!",
			"header_image_url": "",
			"published": true,
			"up_votes_count": 0,
			"down_votes_count": 0,
			"up_votes_id": [],
			"down_votes_id": [],
			"metadata": {},
			"related_items": null,
			"user": {
				"first_name": "Angelina",
				"last_name": "Wu",
				"username": "alona",
				"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F2247%2Fxitdd3c2-IMG_20210609_122726%20(2).jpg?alt=media&token=bc2b0fed-675e-4f12-ab71-ced200ad85bb",
				"id": 2247
			}
		},
		{
			"id": 117,
			"contributors": [
				{
					"user": 1,
					"first_name": "Tomiwa",
					"last_name": "Ademidun",
					"username": "tomiwa",
					"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fljy9s5nm-Ezc5Hyf.jpg?alt=media&token=2391816e-c546-4b11-b232-0cc91f9f3547"
				}
			],
			"title": "“What’s The Word Count?”: Analyzing the Correlation Between Essay Length and Quality",
			"slug": "whats-the-word-count-analyzing-the-correlation-between-essay-length-and-quality",
			"alternate_slugs": [],
			"body": "<h2>Introduction</h2><p>We analyzed 350 scholarship application essays to see if there was a correlation between essay length and quality.</p><p>Here’s a highlight of what we learned:</p><ul><li>Yes, there is a strong correlation. Longer applications tend to score better<ul><li>70% of an application score can be determined by its length</li></ul></li><li>However, the relationship is logarithmic not linear<ul><li>In other words, longer applications tend to perform better but up to a point</li><li>A longer application is not necessarily a better application</li></ul></li><li>The longest application won the scholarship award 60% of the time</li><li>The average scholarship winner had the 2nd longest application</li><li>The average scholarship winner wrote 565 words for each application</li></ul><h3>Quantity != Quality&nbsp;</h3><p>Note: Longer essays tend to perform better but up to a point; a longer essay is not necessarily a better essay.&nbsp;</p><p>Quantity is \"correlated\" to Quality. Subtle but BIG difference.</p><figure class=\"image\"><img src=\"https://lh5.googleusercontent.com/lqGEXf72UgP5WZCv_xuifgbdS_uhZtldN5ruPY6G_NkwjJs54tEwUd3MVt1nxuSEtQ2F4vZ-EPUiO2PtA33cnnM5DOJB_VkdpcX9cj6vWYzeVPXGKbgQ7DQe97N1zW_b2qlhjvCI\"></figure><p>&nbsp;</p><p><strong>If you have any questions or comments about this article. Share it on </strong><a href=\"https://www.reddit.com/r/atila/comments/ozxshx/whats_the_word_count_analyzing_the_correlation/\"><strong>the Reddit post for this article</strong></a><strong> on </strong><a href=\"https://www.reddit.com/r/atila/\"><strong>r/atila</strong></a><strong> and read the comments from others.</strong></p><p>&nbsp;</p><p>&nbsp;</p><figure class=\"image\"><img src=\"https://lh6.googleusercontent.com/kymj11ieYbGK5mPGKjvbjOt2DY3VNDTrsmTYQ8DEz1uTZpFCMBdq9AaJrZ9Q3aArvSe-aoe4wpqRLCv3otbZy0Vx--uDnJNTEicr3jY5L1BTLBsSf3F8KcUcSyQXViCem6ZWFVRi\"></figure><p><i>Relationship between average word count and score with logarithmic best fit curve</i></p><figure class=\"table\"><table><tbody><tr><td>Category</td><td>Average Word Count</td></tr><tr><td>Scholarship Winners</td><td>565</td></tr><tr><td>Scholarship Finalists</td><td>354</td></tr><tr><td>Scores 9-10</td><td>408</td></tr><tr><td>Scores 8-8.9</td><td>319</td></tr><tr><td>Scores 7-7.9</td><td>190</td></tr><tr><td>Scores 6-6.9</td><td>126</td></tr><tr><td>Scores 5.9 and below</td><td>68</td></tr><tr><td>Total Applications</td><td>349</td></tr></tbody></table></figure><p><i>Average word count for different performance buckets</i></p><h2>&nbsp;</h2><h2>Recommendations</h2><h3>Instead of Enforcing Word Counts, Suggest Word Counts based on other Good Essays</h3><p>One reason why we conducted this analysis is that we want to see if we could use this information to help students write better essays and help teachers provide better instructions when assigning essays to students.</p><p>At Atila, we don’t enforce word counts in scholarship applications because we believe that writing should be <a href=\"https://twitter.com/tomiwa1a/status/1418917180935127043\">as long as necessary but as short as possible</a>. Word counts are often arbitrary and can end up cutting people’s expression if they have more to say or force jargon if they have nothing more to say.</p><p>However, word counts are helpful because they help provide a useful benchmark of how much time and detail is expected in an application. Instead of enforcing word counts in scholarship applications, we’ve recently started sharing the table at the end of this page with students while they write their scholarship essays. This will help students make their own decisions about how much they want to write for a given application.</p><p>One of our <a href=\"https://atila.ca/values\">values</a> at Atila is to bet on people. We believe we should give students the freedom to make their applications as long or as short as they feel is right and that they will make the right choice if we provide the right guidance.</p><p>For example, at Atila we <a href=\"https://twitter.com/tomiwa1a/status/1418932327191830530\">suggest</a> that student applications should be at least 300 words to get a score of 8 but that the average scholarship winner has a word count of 500. The goal is to update this table periodically so that students have a better idea of how many words to write for a “good application”.</p><h3>Advice for Teachers and Students</h3><p>If you work in education and writing or grading essays is part of your work, try this method instead of enforcing word counts:</p><ol><li>Get the word counts of past essays you have graded<ol><li>There are many <a href=\"https://www.google.com/search?q=free+word+counter\">free word count software</a> on the internet that makes your life easier</li><li>If you don’t have the ability or time to word count all your essays just pick the best applications<br><br>&nbsp;</li></ol></li><li>Make a table to see the correlation between the length of the application (word count) and the quality (what grade it received), similar to the one we showed above. Here is a <a href=\"https://docs.google.com/spreadsheets/d/1tIoYfPQAczrGUmkHVQWCXMk4sDCSnEf1NzhRjrZxato/edit?usp=sharing\">Google Sheet with some test data</a> which you can use.<br><br>&nbsp;</li><li>Provide a “suggested” word count and provide a table showing the relationship between past essay scores and their word counts (or you can use ours!). Then let the students decide how many words they should write.<br><br>&nbsp;</li></ol><p>If you’re a student, send your teacher this blog post and tell them to consider trying this method!</p><p>If there’s enough interest, we could write a python script that does this automatically for your essays. Tweet us <a href=\"https://twitter.com/atilatech?lang=en\">@atilatech</a> and if enough people want it, we could build it.</p><h2>Detailed Analysis</h2><h3>Hypothesis</h3><p>From our team’s collective experience from reviewing applications, the apps that stand out are the ones that have ample points to support their argument. We look for points that provide justification and attention to detail for their research. A well-written application should also be in layman terms and have no distracting jargon. However, in order to explain ideas clearly, a high word count may be necessary. We acknowledge that it may be the case that high word count is not a function of application score, but rather the number of interesting points that the author writes. As average word count per long answer question increases, the application score should also increase.&nbsp;</p><p>Another interesting point to explore is whether maximum word count - when comparing different questions in a single application - has any correlation with score. Assuming there is some correlation between average word count and score, the presence of an outlier-type application response would theoretically boost an application’s status. In other words, having a standout application response next to several mediocre ones by a candidate should be enough to secure some percentage of score increase.&nbsp;</p><h3>Methodology</h3><p>There are 5 scholarships that are applicable for analysis in the Atila database. Every application from these five scholarships has a max_word_count, average_word_count, and average_user_score.&nbsp;</p><p>To determine the average/max word count for a certain bucket (Ex. Scholarship Winners), take the sum of all average/max word count and divide by the number of applications in the bucket. This method was used for all calculations on average values. The function STDEV was used for determining the standard deviation of each scholarship.</p><h3>Findings</h3><figure class=\"table\"><table><tbody><tr><td>Scholarship ID</td><td>Average Word Count</td><td>Standard deviation</td><td>Winner average_word_count</td><td>Winner_is_highest_word_count</td><td>Winner_avg_word_count_position</td></tr><tr><td>733</td><td>177</td><td>123</td><td>645</td><td>TRUE</td><td>1</td></tr><tr><td>739</td><td>205</td><td>174</td><td>546</td><td>FALSE</td><td>2</td></tr><tr><td>720</td><td>302</td><td>209</td><td>895</td><td>TRUE</td><td>1</td></tr><tr><td>711</td><td>117</td><td>91</td><td>347</td><td>FALSE</td><td>4</td></tr><tr><td>719</td><td>208</td><td>118</td><td>437</td><td>TRUE</td><td>1</td></tr><tr><td>Results</td><td>202</td><td>162</td><td>574</td><td>60.00%</td><td>1.8</td></tr></tbody></table></figure><p><i>Analysis of 5 direct application scholarships on Atila’s website.&nbsp;</i></p><p>From the data above, no scholarship winner placed below fourth on word count, with an average of second place across all scholarships.</p><p>It’s important to note that all scholarship sample sizes are <a href=\"https://www.investopedia.com/terms/c/central_limit_theorem.asp#:~:text=Key%20Takeaways-,The%20central%20limit%20theorem%20(CLT)%20states%20that%20the%20distribution%20of,for%20the%20CLT%20to%20hold.\">at/above 30</a> (Central Limit Theory dictates that sample sizes &gt;= 30 are considered sufficient to calculate sample means). Thus, the impact from lack of available data - including variance at the extremes and presence of outliers - are not prevalent. Although 5 scholarships aren’t enough to declare a relationship, the overwhelming placements of high word count applications indicate a definitive relationship between word count and score. However, without analysis of key correlation measures such as the R-squared coefficient, an accurate conclusion cannot be drawn. The extent to which they are related will be explored further.&nbsp;</p><figure class=\"image\"><img src=\"https://lh5.googleusercontent.com/sagjGzzzEH-yq-mG6dbILnu5XkAEKje4Af6osLlYlkiPHBAAWZ5GPepPKqVmZ8wzOd9yvyv-9SETxWE8fi13XJEbJuWq_gqLCiVlk-S8SXKarZuE4N_iGydb0nKfML365G5ZK3we\"></figure><p><i>Relationship between average word count and score with logarithmic best fit curve&nbsp;</i></p><p>With the above set of data points, the relation between average user score and average word count can be best described as a logarithmic relation. The R-squared correlation from the above graph is 0.714. Seeing that R-squared measures the percentage of variance of a dependent variable that can be explained by the variance of an independent variable, there are several implications present.&nbsp;</p><p>Firstly, in statistics related to the social sciences, it’s notoriously hard to know the relationship between two variables, as there are always other factors in play that skew data. According to <a href=\"https://www.investopedia.com/terms/r/r-squared.asp\">Investopedia</a>, since predicting human behaviour is difficult, having an r-squared of over 0.5 is considered significant. With the r-squared figure at 0.714, we can say that change in average word count accounts for almost ¾ of the variance in user score. This revelation is significant because of the boundary-less properties of both its variables; both word count and score are implemented in school curriculums and college applications in addition to scholarships. Imagine a high school teacher telling students that how much a person writes accounts for almost 75% of their score increase. This finding can cause writers to rethink their core philosophies.&nbsp;</p><p>Additionally, the high ratio of population standard deviation to population mean (162-202) is an indication of the presence of outliers stretching the data set in two directions. Usually, this is a cause for concern, as outliers are data aberrations that don’t accurately represent the line of best fit. However, in the business of scholarships applications (and any written answer, for that matter), selecting the best out of a population is precisely selecting the outliers. Applications are reviewed on the basis that they stand out from the crowd, exhibiting special qualities that few others possess. Thus, the presence of these outliers, coupled with a high R-squared coefficient, means that the applicants who write significantly more than their playing field tend to receive higher scores.&nbsp;</p><figure class=\"image\"><img src=\"https://lh6.googleusercontent.com/mX-P7GiJHJg1PHHDNVEbDV_w8Y6q7YixugN1ATFh3NwUaD2Xyg_SyrJGqhMlXb7L8tc1DqQzDZNjz0dJln6GueCba48v_gFQ5KVj5gWfdRtlE4razTTLNlbZRY6OMfkxRYxI5ZSH\"></figure><p><i>The relationship between maximum word count and score is slightly less correlated than average word count; this may be due to lack of completeness in an application&nbsp;</i></p><p>Similar to average word count, the R-squared correlation of the relationship between maximum word count and user score is 0.692. With virtually identical figures, it can be concluded that there is also a relationship there. The slight decrease in correlation can be explained by the criteria for scoring Atila applications, where completeness of application is assessed. Some applications may exhibit exemplary responses for one question, but lack depth for another, thereby lowering their score.</p><h2>Conclusion</h2><p>From analyzing the data from Atila’s direct application scholarships, an application’s average word count has a strong correlation with how well it scores. This could be because of many factors related to reviewer psychology. One such study conducted by Andrew Tomkins, Min Zhang, and William D. Heavlin showed how “<a href=\"https://www.pnas.org/content/114/48/12708\">single-blind reviewing confers a significant advantage to papers with famous authors</a>”. Similar to this study, reviewers may be tempted to give higher scores to longer applications because it looks more legitimate.</p><p>Another explanation is one we explored earlier, which is that it is frequently impossible to express breadth of ideas in a concise manner. In order to fully describe nuanced opinions with multiple examples and points, responses will inevitably be long.</p><p>Regardless of reason, there is ample evidence that word count is related to score. Keep that in mind when your next written assignment is due. If you have any questions, tweet us at <a href=\"https://twitter.com/atilatech?lang=en\">@atilatech</a>, message us on Instagram <a href=\"https://www.instagram.com/atilatech/\">@atilatech</a>, or start a thread at <a href=\"https://www.reddit.com/r/atila/\">r/atila</a>.</p>",
			"date_created": "2021-07-24T18:37:22Z",
			"description": "We analyzed 350 scholarship application essays to see if there was a correlation between the essay length and quality.\r\n\r\nHere’s a highlight of what we learned:\r\n\r\n- Yes, there is a strong correlation. Longer applications tend to score better\r\n- 70% of an application's score can be determined by its length\r\n- However, the relationship is logarithmic not linear (longer is not always better)",
			"header_image_url": "https://imgur.com/iNO7W30.jpg",
			"published": true,
			"up_votes_count": 0,
			"down_votes_count": 0,
			"up_votes_id": [],
			"down_votes_id": [],
			"metadata": {},
			"related_items": null,
			"user": {
				"first_name": "Eric",
				"last_name": "Wang",
				"username": "ericwang451",
				"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1972%2Fpoysmr85-hi.png?alt=media&token=0a951337-b510-45b7-b612-e39c26bf8864",
				"id": 1972
			}
		},
		{
			"id": 116,
			"contributors": [
				{
					"user": 1289,
					"first_name": "Aaron",
					"last_name": "Doerfler",
					"username": "aarondoerfler",
					"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1289%2Fi7aqzlpa-headshotzoom.jpg?alt=media&token=a6071b1c-afd6-43d3-b008-f57e347caa2b"
				},
				{
					"user": 2247,
					"first_name": "Angelina",
					"last_name": "Wu",
					"username": "alona",
					"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F2247%2Fxitdd3c2-IMG_20210609_122726%20(2).jpg?alt=media&token=bc2b0fed-675e-4f12-ab71-ced200ad85bb"
				}
			],
			"title": "A Case Study on the Skateboards for Hope Scholarship",
			"slug": "a-case-study-on-the-skateboards-for-hope-scholarship",
			"alternate_slugs": [],
			"body": "<p><a href=\"https://skateboardsforhope.com/\">Skateboards for Hope</a> was Atila’s very first external sponsor, and Canada’s first ever action sport scholarship that we created together was a huge success!&nbsp;</p><p>The <a href=\"https://atila.ca/scholarship/skateboards-for-hope-scholarship-0eeakm66\">Skateboards for Hope Scholarship</a> was a $500 scholarship eligible to any Canadian student who performs an extreme sport. Once the scholarship closed and the Skateboards for Hope team reviewed all of the amazing applications, they decided to include prizes for the second and third place winners as well! The second place winner received a Landyachtz Longboard and Skateboards for Hope merch, and the third place winner received a Nyjah Huston Skate Deck and S3 Wheels. To say the least, they were stoked!</p><p>To read more about the winners and finalists of the Skateboards for Hope Scholarship, check out our blog post <a href=\"https://atila.ca/blog/llmercer/meet-the-winner-and-finalists-of-the-skateboards-for-hope-scholarship/\">here</a>.</p><p>As each scholarship, sponsor, and target audience is unique, every scholarship requires a unique design and marketing strategy that is tailored for success.&nbsp;</p><p>See how we designed and promoted the Skateboards for Hope Scholarship and hear testimonials from the winner and finalists below!</p><p>&nbsp;</p><h2>The Graphics</h2><p>&nbsp;</p><h3>Scholarship Promotion&nbsp;&nbsp;</h3><p>The graphics used to promote the Skateboards for Hope Scholarship were designed by <a href=\"https://ca.linkedin.com/in/linda-zhang-21a2b9179\">Linda Zhang</a>, previously a marketing intern at Atila. She used a graphic design software called <a href=\"https://www.figma.com/\">Figma </a>to create <a href=\"https://www.instagram.com/p/CLKSucZsxcm/\">this Instagram carousel</a>.&nbsp;</p><figure class=\"image\"><img src=\"https://lh3.googleusercontent.com/29w-VAoVX_IJSv82ZgPgp2_TQJqqnaM_9q7CqObDg9369eLLJhxAZ7rnB5aBGvPWaZ9LNtLQxJibIMWq9iYvuCCc_T9cLbRAXII8iJ8F4qLEsQBbbFYk5qlURaIG80xyFimHgJMj\"></figure><p>We wanted to make it clear that the scholarship was open to students participating in not just skateboarding but any action sport; a skier and surfer were included in the second and third slide to reflect that. We also dedicated the third slide to inform users of <a href=\"https://skateboardsforhope.com/\">Skateboards for Hope</a> and emphasize their values of creating an all-inclusive skateboarding community.&nbsp;</p><figure class=\"image\"><img src=\"https://i.imgur.com/x9smtzi.jpg\"></figure><p>Finally, we created <a href=\"https://www.instagram.com/p/CLsfLHiMOhB/\">this French version</a> of the original design to post on our Instagram. This was to reach out to students in francophone communities and encourage them to also apply!</p><figure class=\"image\"><img src=\"https://lh4.googleusercontent.com/_4DPdkO6LsTjkaeNwSIBdDkigplRWTKdFxHgqg14pBt-FSHmqSZ-urZTTG68O8XNXc69u0Z3M8PTUo50asuqdFiJHT-G9hTDfik2OCiqqUVDyaQlRfhNQ--uLm_zcXCxPnVRHppu\"></figure><h3>&nbsp;</h3><h3>Sharing the Winner &amp; Finalists</h3><p>Once the scholarship closed and the winner was chosen, it was time to share who had won! Using <a href=\"https://www.figma.com/\">Figma</a> once again, current marketing intern <a href=\"https://www.linkedin.com/in/lauren-mercer-150a3a181/\">Lauren Mercer</a> designed the graphics to share the winner and finalists of the Skateboards for Hope Scholarship. That Instagram carousel can be found <a href=\"https://www.instagram.com/p/CQ6yZntMj2l/\">here</a>.</p><p>Each of the ten slides were created to showcase the winner, the finalists, and the stories behind their applications. The first two slides included photos and excerpts from each student, as well as specially designed figures to represent each of them. The students really appreciated their personalized caricatures!</p><figure class=\"image\"><img src=\"https://lh5.googleusercontent.com/j1b32E12Ac2JxilLYDU8BarjU6eckJ2_i70OdgZRI0cBBg36iKWo2BIqcIjr7VjiecmQz0WeR1zGTT7BjiKGVh1W8V-JqfB7OAQyyqskURxCbu4guZAimScqfJSFTdF4423ijv1L\"></figure><p>&nbsp;</p><figure class=\"image\"><img src=\"https://i.imgur.com/J8nR4vX.jpg\"></figure><p>&nbsp;</p><p>The remaining slides contain photos, excerpts, and thank you messages from the winner and each finalist. Before we posted the Instagram carousel, the Skateboards for Hope team and each student had the opportunity to approve the designs and provide feedback.&nbsp;</p><figure class=\"image\"><img src=\"https://i.imgur.com/gDmRcbM.jpg\"></figure><p>Fun fact: colours from the new <a href=\"https://skateboardsforhope.com/our-ambassadors/\">Skateboards for Hope website</a> were used as inspiration for the colour palette for the winner and finalists graphics!&nbsp;&nbsp;</p><p>&nbsp;</p><h2>The Video</h2><p>One of our software and design interns, <a href=\"https://www.linkedin.com/in/angelina-wu-60643a209/\">Angelina Wu</a>, created a fantastic video to showcase the talents of the winner and finalists.&nbsp;</p><p>As part of the scholarship application, students were required to submit a video of themselves performing an extreme sport. Along with Skateboards for Hope, we decided that a video compilation of the winner and finalists performing their sports would be a great way to share the students' talents in a way that was unique to the first action sport scholarship in Canada!&nbsp;</p><p>Check out the video on <a href=\"https://www.instagram.com/p/CQ9Ps0pAX_t/\">Instagram </a>and <a href=\"https://youtu.be/BsgTiEwbKIc\">Youtube</a>.</p><p>&nbsp;</p><figure class=\"media\"><div data-oembed-url=\"https://youtu.be/BsgTiEwbKIc\"><div style=\"position: relative; padding-bottom: 100%; height: 0; padding-bottom: 56.2493%;\"><iframe src=\"https://www.youtube.com/embed/BsgTiEwbKIc\" style=\"position: absolute; width: 100%; height: 100%; top: 0; left: 0;\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe></div></div></figure><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><h2>How Did We Promote the Scholarship</h2><p>When it came time to promote the Skateboards for Hope Scholarship, we relied on many strategies to ensure we reached a wide audience of students all across Canada.&nbsp;</p><p>&nbsp;</p><h3>Instagram</h3><p>Beginning many weeks before the scholarship deadline, each member of the team sent at least <strong>5-10 DM’s per week</strong> to action sport organizations in their assigned region requesting that they share the scholarship with their members.&nbsp;</p><p>Many organizations, and even some high schools, were more than willing to repost the scholarship on their story or feed</p><figure class=\"image\"><img src=\"https://i.imgur.com/rXjuawo.jpg\"></figure><figure class=\"image\"><img src=\"https://i.imgur.com/2CtIqts.jpg\"></figure><p>&nbsp;</p><h3>Email&nbsp;</h3><p>At the same time that we began messaging organizations through Instagram, we also began promoting through email. Each team member sent at least <strong>5-10 emails per week</strong>, on top of the Instagram DM’s, to high school and action sport organizations in their assigned region.&nbsp;</p><figure class=\"image\"><img src=\"https://i.imgur.com/rI0eT9L.jpg\"></figure><h3>&nbsp;</h3><h3>Ads</h3><p>Check out the section on metrics further below to see just how many people we were able to reach through our Facebook and Instagram ad campaigns!</p><p>&nbsp;</p><h2>Replies</h2><p>We received an amazing, positive response to the scholarship from high schools, university clubs, and action sports organizations across Canada. Here are some of their replies.</p><p>&nbsp;</p><p><strong>From an Academic Advisor at Magrath High School in Magrath, AB</strong></p><figure class=\"image\"><img src=\"https://i.imgur.com/iftLkz6.jpg\"></figure><p>&nbsp;</p><p><strong>From a Scholarship Committee Member at Ecole Secondaire Sisler High School in Winnipeg, MB</strong></p><figure class=\"image\"><img src=\"https://i.imgur.com/MWiU7W2.jpg\"></figure><p>&nbsp;</p><p><strong>From the President of the Carleton Ski and Snowboard club in Ottawa, ON</strong></p><figure class=\"image\"><img src=\"https://i.imgur.com/dufaeqB.jpg\"></figure><p>&nbsp;</p><p><strong>From Yash Presswalla, the Executive Director of the Impact Skate Club in Toronto, ON</strong></p><figure class=\"image\"><img src=\"https://i.imgur.com/MBbAbjh.jpg\"></figure><p>&nbsp;</p><p><strong>From a Bicycle Shop in Vancouver, BC</strong></p><figure class=\"image\"><img src=\"https://i.imgur.com/XKp6EPQ.jpg\"></figure><h2>&nbsp;</h2><h2>Metrics on Reach</h2><p>&nbsp;</p><h3>Facebook</h3><p>Below are the metrics we collected from the French ad that we ran to promote the Skateboards for Hope Scholarship. The ad was seen by <strong>1359 people</strong> and it collected <strong>13 link clicks</strong>, which means that cost per result was about 77 cents.&nbsp;</p><figure class=\"image\"><img src=\"https://lh5.googleusercontent.com/HsKqJrqeiZAOTnMOuN-k0C9LOXmTFWCk-GEDE2ERCoxiTGeHohSufL8-xqu-lPqBlhzFPr6h2zEQJJN7IL-5sxsvv03cY4bOgKaISavCB7amNS5tR1GS8iXt7e94Fzw_9C1wt4pV\"></figure><figure class=\"image\"><img src=\"https://lh5.googleusercontent.com/HsKqJrqeiZAOTnMOuN-k0C9LOXmTFWCk-GEDE2ERCoxiTGeHohSufL8-xqu-lPqBlhzFPr6h2zEQJJN7IL-5sxsvv03cY4bOgKaISavCB7amNS5tR1GS8iXt7e94Fzw_9C1wt4pV\"></figure><figure class=\"image\"><img src=\"https://lh5.googleusercontent.com/CiEJSeK8lH8N7p-pHScObcOTUeqYjb_mUpMYN2DsUYSAZrrX1YrVnQJ6A4rxFGLLybpjaUJ8USEF-plAP7s5OVKFr5NyCGvVuoxbu4IsyiD10dQ1UraMLb5BLJnUykcGlm82XDoy\"></figure><p>We also let Facebook determine which platform was the best for our target demographic of students between the ages of 16 and 24, and as you can see, Instagram is heavily favourited with just over 1300 people reached. Additionally, our ad reached more women than men at 69% to 31% respectively.</p><p>The English ad had slightly better results, as shown below, reaching a total of <strong>1826 people</strong> while collecting <strong>35 link clicks</strong> and a cost per result ranging from 11 cents to 42 cents in the same amount of time.&nbsp;</p><figure class=\"image\"><img src=\"https://lh5.googleusercontent.com/db7ZJvBwVrm336BFIKWO-Bk972OoQLpduXo2hXkxIbognOsiDOzyzyTryRiEC1_uiVUZRF3M36KVwK1XF6rSXrbYXQq0zMUhkApAvu9jdXLyh83PBavK10mcGqJoYAk3j8Yywq7-\"></figure><figure class=\"image\"><img src=\"https://lh3.googleusercontent.com/eLn4l-klzBLJMBf3s_MW8xSLVuGDaFalOL93_BgNvx2QvJDBlp6ZeecZj5OSUPzY6_RNtKUtu9Th3SPtgZmFXq6xMk1WeZ9Oi59BbuMVDmYzisCm-4aa5P6ShPddtm2TjXTg9Jeq\"></figure><figure class=\"image\"><img src=\"https://lh4.googleusercontent.com/YlS74s3rSYLvA8eqai0LA62AMsytOTxX2yD-G-7lbXFz47JFOEXQ8jycoc6YwMQ74f_hV1tv0CTnQUQyqynGMtk2VI2gqdUZp3wSG4qrOjjfR3QoMNNLcodkwmmNRBhvK9D0WwFD\"></figure><p>Similar to the French ad, Instagram was where most people saw our ad (a total of 1691 people), but more interestingly, we had a slightly more even distribution between women and men (63% female to 37% male).</p><p>&nbsp;</p><h3>Instagram</h3><p>These last two images are of our <a href=\"https://www.instagram.com/p/CLKSucZsxcm/\">English </a>and <a href=\"https://www.instagram.com/p/CLsfLHiMOhB/\">French </a>Instagram posts to promote the Skateboards for Hope scholarship. For an account with 380 followers, we were able to reach a combined total of <strong>3599 people</strong>, while gathering <strong>4386 impressions</strong>!&nbsp;</p><figure class=\"image\"><img src=\"https://i.imgur.com/q2YCN8s.jpg\"></figure><p>This was a result of a few things: one, the amazing designs by <a href=\"https://ca.linkedin.com/in/linda-zhang-21a2b9179\">Linda Zhang</a>, and two, how we promote our scholarships. Of course, we also had help from Betty and her team at Skateboards for Hope, and together, we were able to effectively promote the first action sports scholarship in Canada!</p><p><strong>Note:</strong> Facebook ads are now an add-on feature. We would be happy to provide this for you if you choose!</p><p>&nbsp;</p><h2>Testimonials</h2><p>But how do you know if students ACTUALLY like, use, and recommend Atila? Because they tell us! See some of the wonderful reviews and testimonials below that Atila received from the Skateboards for Hope Scholarship.</p><figure class=\"image\"><img src=\"https://i.imgur.com/eGBiKrQ.jpg\"></figure><figure class=\"image\"><img src=\"https://i.imgur.com/N4AcQlW.png\"></figure><figure class=\"image\"><img src=\"https://i.imgur.com/iGfcFnD.jpg\"></figure>",
			"date_created": "2021-07-15T02:29:17.113295Z",
			"description": "The Skateboards for Hope scholarship was Atila's first externally sponsored scholarship! See how we designed and promoted the Skateboards for Hope Scholarship and hear testimonials from the winner and finalists.",
			"header_image_url": "https://i.imgur.com/19HGBB7.jpg",
			"published": true,
			"up_votes_count": 0,
			"down_votes_count": 0,
			"up_votes_id": [],
			"down_votes_id": [],
			"metadata": {},
			"related_items": null,
			"user": {
				"first_name": "Lauren",
				"last_name": "Mercer",
				"username": "llmercer",
				"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fscholarship-images%2Fedo55xjv-Profile%20Photo.jpg?alt=media&token=1ee1db2a-f81b-4391-ade7-e19265600bda",
				"id": 1816
			}
		},
		{
			"id": 115,
			"contributors": [],
			"title": "How Atila Navigates Social and Political Issues",
			"slug": "how-atila-navigates-social-and-political-issues",
			"alternate_slugs": [],
			"body": "<p>The nature of Atila’s platform means that we will eventually find ourselves in positions where we have to form opinionated stances on touchy subjects. We should start learning how to handle these situations now so we get better with time as we grow.</p><p>For example, I remember talking to a lawyer about the best way to incorporate Atila and she asked me, “What’s your policy if someone wants to create a scholarship for white supremacists?”</p><p>Me: “Obviously, white supremacists and all other hate groups are not allowed on our platform. But it’s more of a common sense/unwritten rule. I guess there’s no official written policy.”</p><p>The lawyer wasn’t exactly thrilled to hear that.</p><p>Right now we're small so we don’t really have to face these types of issues very often. And when we do, the stakes are pretty small. We have a couple thousand users and about 400 followers on Instagram. No one cares what we think. But as we grow, this will change.</p><p>Already we’ve had two minor incidents with<a href=\"https://imgur.com/a/ZK6Firb\"> someone who disagreed with the idea of the Justice for Indian Farmer’s Scholarship</a> and <a href=\"https://imgur.com/a/ZK6Firb\">someone who said the naming of our BIPOC scholarship was discriminatory</a>.</p><p>These two incidents inspired me to reflect on something I’ve been thinking about for a while: How involved should we be on social or political issues?</p><p>There’s a wide spectrum of company involvement in social issues, ranging from abstaining as much as possible as<a href=\"https://blog.coinbase.com/coinbase-is-a-mission-focused-company-af882df8804\"> Brian Armstrong at Coinbase call their \"mission focused\" approach</a>, to a<a href=\"https://www.fastcompany.com/90626274/pour-one-out-for-the-tech-bro-uniform-patagonia-ditches-corporate-logos-on-its-vests\"> high social involvement approach by Yvon Chouinard at Patagonia</a> and many in-between, for example, the<a href=\"https://www.newsweek.com/shopify-ceo-sends-email-staff-saying-company-not-family-we-cannot-solve-every-societal-1592545\"> email Tobi Lutke sent to his team at Shopify</a>.</p><p>Atila is a for-profit company, so it’s important we stay focused on things that make us money. Especially because I believe that money is still the best tool for making any kind of social impact we want to have. But there’s more to life than making money (<a href=\"https://en.wikipedia.org/wiki/Maslow%27s_hierarchy_of_needs\">Maslow's Hierarchy of Needs</a> illustrates this point excellently). I’ve always seen Atila as a vehicle for transporting us to the type of society we want to have. This inevitably means getting involved in social or political issues when appropriate. So naturally, I think a balanced approach works best.</p><p>I’m still thinking through what that means in practice. Currently, it means being laser focused on getting as many scholarships and students on the platform as possible. If we choose to get involved in social or political issues we should focus on issues that relate to giving students financial and education freedom. We can always make exceptions. It’s not precisely a rule, but more of a rule of thumb.</p><p>Also, I think that while Atila is still small (and even as we grow!), we can afford to take more risks, experiment with different ways to handle these situations, share our thought process with our users and the public, then learn and iterate based on their feedback.</p><p><i>Read the</i><a href=\"https://imgur.com/a/ZK6Firb\"><i> screenshots of the internal conversation we had on Slack</i></a><i> to understand the context of what inspired me to write this (shared with my team member's permission).</i></p><p><i>If you have a question, comment or feedback, leave a comment on the</i><a href=\"https://www.reddit.com/r/atila/comments/oh0h5e/how_atila_navigates_social_and_political_issues/\"><i> Reddit thread for this post</i></a> on<a href=\"https://www.reddit.com/r/atila/\"> r/atila</a>. I read every comment.</p>",
			"date_created": "2021-07-09T17:30:04.420303Z",
			"description": "The nature of Atila’s platform means that we will eventually find ourselves in positions where we have to form opinionated stances on touchy subjects. \n\nWe should start learning how to handle these situations now so we get better with time as we grow.",
			"header_image_url": "",
			"published": true,
			"up_votes_count": 0,
			"down_votes_count": 0,
			"up_votes_id": [],
			"down_votes_id": [],
			"metadata": {},
			"related_items": null,
			"user": {
				"first_name": "Tomiwa",
				"last_name": "Ademidun",
				"username": "tomiwa",
				"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fljy9s5nm-Ezc5Hyf.jpg?alt=media&token=2391816e-c546-4b11-b232-0cc91f9f3547",
				"id": 1
			}
		},
		{
			"id": 114,
			"contributors": [],
			"title": "Presenting the Atila Student Clubs Visualizer",
			"slug": "presenting-the-atila-student-clubs-visualizer",
			"alternate_slugs": [],
			"body": "<p>We’re building a graph to visually explore every student club in Canada and their relationships with each other.</p><p>You can try it out at <a href=\"https://atila.ca/clubs\">atila.ca/clubs</a> and watch a <a href=\"https://www.youtube.com/watch?v=UP1AIY1wRnk\">live demo</a>.</p><p>You can search and filter by different clubs using categories such as school, program, career, activity, location, ethnicity, gender, religion etc.</p><p>&nbsp;</p><figure class=\"media\"><div data-oembed-url=\"https://www.youtube.com/watch?v=UP1AIY1wRnk\"><div style=\"position: relative; padding-bottom: 100%; height: 0; padding-bottom: 56.2493%;\"><iframe src=\"https://www.youtube.com/embed/UP1AIY1wRnk\" style=\"position: absolute; width: 100%; height: 100%; top: 0; left: 0;\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe></div></div></figure><h2>Sample searches</h2><p>Here are some examples of things you can use this tool to find:</p><ol><li><a href=\"https://atila.ca/clubs?__or__eligible_schools=University%20of%20Toronto&amp;__or__eligible_schools=University%20of%20Alberta\">Clubs for students at the University of Toronto or University of Alberta</a></li><li><a href=\"https://atila.ca/clubs?other_demographic=STEM&amp;other_demographic=Women\">Clubs for Women in STEM</a></li><li><a href=\"https://atila.ca/clubs?__or__ethnicity=Black&amp;__or__ethnicity=Indigenous\">Clubs for Black, East-Asian, South-Asian or Indigenous students</a></li><li><a href=\"https://atila.ca/clubs?eligible_programs=Medicine\">Clubs for students interested in Medicine</a> or <a href=\"https://atila.ca/clubs?__or__eligible_schools=Dalhousie%20University&amp;__or__eligible_schools=Humber%20College&amp;eligible_programs=Medicine\">Nursing at Humber College or Dalhousie University</a></li><li><a href=\"https://atila.ca/clubs?__or__religion=Christianity&amp;__or__religion=Judaism&amp;__or__religion=Islam\">Clubs for Christian, Jewish or Muslim students</a></li><li><a href=\"https://atila.ca/clubs?__or__sports=Weightlifting&amp;__or__sports=Basketball\">Clubs for students interested weightlifting or basketball</a></li><li><a href=\"https://atila.ca/clubs?__or__other_demographic=LGBTQ\">Clubs for LGBTQ students</a></li><li><a href=\"https://atila.ca/clubs?__or__eligible_programs=Software%20Engineering&amp;__or__industries=Investment%20Banking&amp;__or__industries=Management%20Consulting\">Clubs for Software Engineering, Investment Banking or Consulting</a></li></ol><h2>What are some Potential Use Cases?</h2><ol><li><strong>Prospective students</strong> deciding on schools to attend would be interested to know all the different clubs that exist for their interests and demographics</li><li><strong>Current students</strong> interested to know what clubs they can join in their school or in other schools</li><li><strong>Student club executives</strong> looking for other clubs that exist in their space in case they want to collaborate</li><li><strong>For Profit companies or Non-Profit organizations</strong> looking for clubs they might want to partner with for campus outreach or hiring opportunities</li></ol><h2>Crowdsourced</h2><p>The best part is that we are crowdsourcing the data so anyone can add a club they think should be part of the network. If you see any incorrect or missing information you can suggest an edit.</p><p>If you have any comments or questions, feel free to leave a comment on the Student Clubs Visualizer Post on the <a href=\"https://www.reddit.com/r/atila/\">r/atila</a> subreddit.</p>",
			"date_created": "2021-07-07T14:01:25.418767Z",
			"description": "We’re building a graph to visually explore every student club in Canada and their relationships with each other.\n\nYou can try it out at atila.ca/clubs",
			"header_image_url": "https://i.imgur.com/lQl5zOr.png",
			"published": true,
			"up_votes_count": 0,
			"down_votes_count": 0,
			"up_votes_id": [],
			"down_votes_id": [],
			"metadata": {},
			"related_items": null,
			"user": {
				"first_name": "Tomiwa",
				"last_name": "Ademidun",
				"username": "tomiwa",
				"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fljy9s5nm-Ezc5Hyf.jpg?alt=media&token=2391816e-c546-4b11-b232-0cc91f9f3547",
				"id": 1
			}
		},
		{
			"id": 113,
			"contributors": [],
			"title": "Meet the Winner and Finalists of the Skateboards for Hope Scholarship",
			"slug": "meet-the-winner-and-finalists-of-the-skateboards-for-hope-scholarship",
			"alternate_slugs": [],
			"body": "<p>Atila’s first externally sponsored scholarship, with <a href=\"https://skateboardsforhope.com/\">Skateboards for Hope</a>, recently finished!</p><p><a href=\"https://skateboardsforhope.com/\">Skateboards for Hope</a> is a non-profit organization that aims to give youth across the world the tools to break the cycle of poverty through skateboarding. Their mission is to shred the taboos that surround the skateboarding culture and the social stigma it carries.</p><p>Today, we’re excited to share with you the winner and finalists of the <a href=\"https://atila.ca/scholarship/skateboards-for-hope-scholarship-0eeakm66\">Skateboards for Hope Scholarship</a>. These are their stories.</p><p>&nbsp;</p><h2>Applicant Stories</h2><p>The winner is Yumi Lee, a talented skateboarder in Toronto, Ontario who is also the co-founder and head instructor of <a href=\"https://www.yorkskateboarding.ca/home\">York Skateboarding Academy</a> where she teaches skateboarding to youth.</p><p>The finalists are Karolina Dobiszewska, Jamen Janzen, Faith Obadun, and Ashley Tajarrod. Read some snippets of their application below and click the links to see them in action.</p><p>We have <a href=\"https://atila.ca/scholarship\">more scholarships</a> available on the Atila platform. If you’re a student you can apply for any of our current scholarships now. If you’re interested in helping a student pay for their education you can <a href=\"https://atila.ca/start\">start or contribute</a> to a scholarship today.</p><p>&nbsp;</p><h3>Yumi Lee - Winner</h3><p><strong>Tell us why extreme sports are important to you and how it has helped you in your life?</strong></p><p>Since the pandemic struck, my mental health has been pretty all over the place. I'm sure many people can relate. Dealing with the anxieties of not knowing what will happen in the world, not to mention graduating high school and applying to university, is a lot to handle. When I skateboard, somehow, all those worries magically disappear.&nbsp;</p><p><strong>Tell us about a time you overcame adversity and your goals for the future.</strong></p><p>When I first started playing baseball, I learned very quickly that it wouldn't be easy for me to prove myself.&nbsp;</p><p>My teammate and I would be benched in games significantly more often than our male counterparts, and we often wouldn't get feedback when we made mistakes. Since my coach didn't help me, I knew the only way I could prove myself would be to practice independently.</p><p>...the sport taught me so much about the world and how hard work and determination are some of my greatest strengths. I navigated a white, male-dominated space and proved everyone who ever doubted me wrong.&nbsp;</p><p><strong>Here is a snippet of Yumi’s thank you letter:</strong></p><p>This scholarship is going to help me advance my education to become a teacher one day. I've always loved teaching and I've recently started my own skateboarding business where I will provide lessons to kids. I hope that soon, we will go non-profit, and we'll be able to host events for the community. One of my goals is to create safe spaces for minority populations to learn skateboarding.&nbsp;</p><p><strong>See Yumi skateboarding here:</strong></p><p><a href=\"https://www.youtube.com/watch?v=8i7gh7N0W_M\">https://www.youtube.com/watch?v=8i7gh7N0W_M</a></p><p>&nbsp;</p><h3>Karolina Dobiszewska - Finalist</h3><p><strong>Tell us why extreme sports are important to you and how it has helped you in your life?</strong></p><p>Extreme sports are important to me because they help on my journey of living a fearless life. I try to live everyday by “Seek Discomfort” - I do things because they scare me. I want to stay daring, strong and not afraid of challenges, and my extreme sports, like snowboarding or surfing, greatly help me in that.</p><p><strong>Tell us about a time you overcame adversity and your goals for the future.</strong></p><p>After many hard years in Poland, I finally came to Canada in 2017.<i> </i>I started in gr.10 not knowing anyone, or anything about Canadian school system. I didn’t understand even much of what teachers were saying. It was also hard to connect with others, I felt like an outcast.</p><p>But I persevered, and decided I won’t let anyone else suffer the way I did. I became one of the Link Leaders. Since 2018, I’ve been welcoming newcomers to our school, giving tours, leading activities and helping them understand Canadian school. I wanted to be that friendly face, to make them feel they belong.</p><p>In the future, I want to be a respected director / DP - known for creativity, work ethics and integrity. I want to make films that’ll open eyes and spark meaningful conversations, about which people think months or years after.</p><p><strong>Here is a snippet of Karolina’s thank you letter:</strong></p><p>Receiving the board has brought me great joy because I’ve always wanted to get into this type of skateboarding...</p><p>I’m new here and this will surely be a great step to feel more a part of the Montreal Community.</p><p>I’m really thankful for the award and recognition!</p><p><strong>See Karolina snowboarding here:</strong></p><p><a href=\"https://www.facebook.com/100008166091452/videos/pcb.2837256336556542/2837252456556930\">https://www.facebook.com/100008166091452/videos/pcb.2837256336556542/2837252456556930</a></p><p>&nbsp;</p><h3>Jamen Janzen - Finalist</h3><p><strong>Tell us why extreme sports are important to you and how it has helped you in your life?</strong></p><p>I love how the skateboarding community brings all kinds of people together. Its such a great feeling to pull up to any local skatepark and be greeted with heartfelt fistbump and a “what's up man?' from a local homie. Skateboarding breaks down barriers of age and socioeconomic status. It doesn't matter how old or young you are, what your background is or how much money you have, all you need is a board and a passion for skating.&nbsp;</p><p><strong>Tell us about a time you overcame adversity and your goals for the future.</strong></p><p>Any time I would get stressed out or a wave of angry energy would take control I'd grab my board and skate the mini ramp. Even just pumping around would help me calm down. My family had never been more thankful for the ramp then during these testing times!</p><p>As I get older I am becoming more self aware and intentionally working on being the best version of myself daily. I know that extreme sports will always be part of who I am and how I want to do life. I am skating my hardest with a goal of one day being sponsored from a local shop/ company in my city.</p><p><strong>Here is a snippet of Jamen’s thank you letter:</strong></p><p>I am very appreciative and stoked on the board!</p><p>...[Skateboarding is] a very big passion of mine and I thought, if there’s a way I can win something for talking about my skating, why wouldn’t I not try. It was a fun opportunity.</p><p>Thank you again Skateboards for Hope!</p><p><strong>See Jamen skateboarding here:</strong></p><p><a href=\"https://www.youtube.com/watch?v=5bX5dzwhEkE\">https://www.youtube.com/watch?v=5bX5dzwhEkE</a></p><p>&nbsp;</p><h3>Faith Obadun - Finalist</h3><p><strong>Tell us why extreme sports are important to you and how it has helped you in your life?</strong></p><p>Skateboarding has grown to be so important to me in ways I never imagined. It has been a great means for me to get away from reality for a while and just be in tune with nature and life as a whole.</p><p>During times when life feels overwhelming and I go skateboarding, I come back home feeling less heavy and a little happier than how I was.</p><p><strong>Tell us about a time you overcame adversity and your goals for the future.</strong></p><p>Having lived in Nigeria all my life up until I was 13, moving 10,000km from the only home I knew had a huge effect on what I knew my life to be.</p><p>I spent time learning about myself, things I love, what makes me smile, my goals and ambitions, more generally, what makes me ‘Faith’. Now, this move set the stage for not only changes but also a heart of gratitude. It showed me how to appreciate my cultural background, morals, childhood memories and most importantly the sacrifices my parents continue to make to provide me with a better life than they ever dreamed to have.&nbsp;</p><p><strong>See Faith skateboarding here:</strong></p><p><a href=\"https://youtu.be/503coCiizHM\">https://youtu.be/503coCiizHM</a></p><p>&nbsp;</p><h3>Ashley Tajarrod - Finalist</h3><p><strong>Tell us why extreme sports are important to you and how it has helped you in your life?</strong></p><p>Extreme sports are also individual sports that allows one to pursue obstacles that is only depended on the person. This makes an extreme athlete, such as myself independent, driven, and accountable for all my actions. Whenever I want to tackle anything in my life, such as school, work, relationships, etc, I know that I can achieve anything through positivity, practice, and patience.</p><p><strong>Tell us about a time you overcame adversity and your goals for the future.</strong></p><p>On March 06 2020, I was prepared to compete in Canada’s Olympic Open Qualifiers. Although I was trying to control my composure, I ended up re-injuring my right foot only five minutes before the competition. I was absolutely stunned, frustrated, and angry, I felt defeated just by doing what I love.&nbsp;</p><p>After five months of physical rehab, I ended up moving out of my family's house and to a place that is closer to Toronto's best skatepark...</p><p>I still skate to this day and will continue to progress regardless of given situations. I want to skate for as long as possible. To travel, compete, film, in regards to skating is all I live for.</p><p><strong>See Ashley skateboarding here:</strong></p><p><a href=\"https://www.instagram.com/ashleeelettuse/\">https://www.instagram.com/ashleeelettuse/</a></p><p>&nbsp;</p><p>See more on <a href=\"https://www.instagram.com/p/CQ6yZntMj2l/\">Instagram</a>!</p>",
			"date_created": "2021-07-04T19:48:30.625057Z",
			"description": "We are excited to share with you the winners and finalists of the Skateboards for Hope Scholarship!",
			"header_image_url": "https://i.imgur.com/MJTP5bq.png",
			"published": true,
			"up_votes_count": 0,
			"down_votes_count": 0,
			"up_votes_id": [],
			"down_votes_id": [],
			"metadata": {},
			"related_items": null,
			"user": {
				"first_name": "Lauren",
				"last_name": "Mercer",
				"username": "llmercer",
				"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fscholarship-images%2Fedo55xjv-Profile%20Photo.jpg?alt=media&token=1ee1db2a-f81b-4391-ade7-e19265600bda",
				"id": 1816
			}
		}
	]
}