{
	"blog": {
		"id": 155,
		"contributors": [
			{
				"user": 1289,
				"first_name": "Aaron",
				"last_name": "Doerfler",
				"username": "aarondoerfler",
				"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1289%2Fi7aqzlpa-headshotzoom.jpg?alt=media&token=a6071b1c-afd6-43d3-b008-f57e347caa2b"
			},
			{
				"user": 1816,
				"first_name": "Lauren",
				"last_name": "Mercer",
				"username": "llmercer",
				"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fscholarship-images%2Fedo55xjv-Profile%20Photo.jpg?alt=media&token=1ee1db2a-f81b-4391-ade7-e19265600bda"
			}
		],
		"title": "Atila’s Guide to Getting Scholarships for School",
		"slug": "atila-scholarship-guide",
		"alternate_slugs": [],
		"body": "<h2>Introduction&nbsp;</h2><p>The average university student graduates with <a href=\"https://www150.statcan.gc.ca/t1/tbl1/en/tv.action?pid=3710003601\">$28K in student debt</a>, yet at the same time, every year there are <a href=\"https://www.cbc.ca/news/canada/calgary/alberta-scholarships-university-post-secondary-funding-1.4642463\">millions of dollars in scholarships that go unclaimed</a>!&nbsp;</p><p>So this tells us that there is definitely a demand for scholarships and while the demand is more than the supply, some of that supply goes unused. Our guide hopes to solve that problem.</p><p>But even though school is expensive, you shouldn’t have to sacrifice your education. Keep reading to check out our tips on how you can get money for school.</p><p><i>Note: Some of the links are specific to students in Canada and the US but most of the advice and links here are relevant to students in every country.</i></p><p>Leave your comments and feedback on this <a href=\"https://www.reddit.com/r/atila/comments/pq93bs/atilas_guide_to_getting_scholarships_for_school/\">post</a> at <a href=\"https://www.reddit.com/r/atila/\">r/atila</a>!</p><h2>Apply for Scholarships&nbsp;</h2><h3>Scholarship Websites&nbsp;</h3><p>All of these websites allow you to directly search their scholarship databases to find and apply to the scholarships relevant to you.</p><p>Of course one of these websites is <a href=\"https://atila.ca/\">Atila</a>. And although we love Atila, this isn’t a sales pitch. We want you to know about, and use, all of the other great scholarship resources as well. Here’s a list of the best and most comprehensive scholarship websites:</p><p>&nbsp;&nbsp;</p><p>Canadian Students</p><ol><li><a href=\"https://atila.ca/\">Atila</a></li><li><a href=\"https://yconic.com/\">Yconic</a></li><li><a href=\"https://www.scholarshipscanada.com/\">ScholarshipsCanada</a></li><li><a href=\"https://scholartree.ca/\">Scholartree</a></li><li><a href=\"https://studentawards.com/\">StudentAwards</a><br><br>&nbsp;</li></ol><p>American Students</p><ol><li><a href=\"https://bold.org/\">Bold.org</a></li><li><a href=\"https://www.scholarships.com/\">Scholarships.com</a></li><li><a href=\"https://www.fastweb.com/\">Fastweb</a></li><li><a href=\"https://www.reddit.com/r/scholarships/\">r/scholarships</a></li></ol><h3>&nbsp;</h3><h3>Assorted Scholarship Lists</h3><p>There are all kinds of scholarship lists and link lists all over the internet.</p><p>The first two links are crowdsourced lists of scholarships so they tend to have more information. The other three are just some examples of the types of lists you can find from browsing the internet.</p><ol><li><a href=\"https://docs.google.com/spreadsheets/d/1lCjI-upHZJ1pZHRG7f5OVmJbv1SNWJ9h8SsS61eYcRU/edit#gid=0\">Atila Mega Scholarships List</a></li><li><a href=\"https://github.com/atilatech/awesome-students/\">atilatech/awesome-students</a></li><li><a href=\"https://beacons.ai/scholarshipguru\">https://beacons.ai/scholarshipguru</a></li><li><a href=\"https://linktr.ee/accessscholarships\">https://linktr.ee/accessscholarships</a></li><li><a href=\"https://linktr.ee/Scholist.app\">https://linktr.ee/Scholist.app</a></li></ol><p>To find even more, <a href=\"https://www.google.com/search?q=linktr.ee+scholarships\">Google: “linktr.ee scholarships”</a></p><h3>Check if your part-time job or your parent’s job has Employees for Scholarships</h3><p>Ask your parents or legal guardian if there is a scholarship for employees or children of employees. Here are some scholarships specifically for employees or children of employees at various companies:</p><ol><li><a href=\"http://www.scholarships4students.com/mcdonald's_national_employee_scholarship_program.htm\">McDonald’s National Employee Scholarship Program</a> - varies per restaurant, ask your manager</li><li><a href=\"https://www.rbc.com/dms/enterprise/scholarships/scholarship-program-for-the-children-of-rbc-employees.html\">Children of RBC Employees Scholarship Program</a> - information is available through the RBC intranet site for employees</li><li><a href=\"https://www.timhortons.com/restaurant-opportunities\">Tim Horton’s Scholarship Program</a> - varies per restaurant, ask your manager</li></ol><h3>School Directories</h3><p>Different high schools, universities and colleges have scholarship lists where you can find even more scholarships. Some of them are for students of the school but many also have external scholarships that anyone can apply for.&nbsp;</p><p>Simply Google: “[school_name] scholarships” or even better “[school_name] external scholarships”</p><p>Here are some examples of school websites that have external scholarships</p><ol><li><a href=\"http://westgate.lakeheadschools.ca/student_services/scholarships_bursaries_awards.htm\">Westgate Collegiate External Scholarship Page</a></li><li><a href=\"https://www.dal.ca/admissions/money_matters/awards-financial-aid/scholarships/external_scholarshipsbursaries.html\">Dalhousie University External Scholarship Page</a></li><li><a href=\"https://langara.ca/student-services/financial-aid/external-awards/index.html\">Langara College External Scholarship Page</a></li></ol><h3>Scholarship Content Creators</h3><p>There are so many content creators on TikTok, Instagram, Twitter and Youtube that talk about scholarships.</p><ol><li><a href=\"https://www.tiktok.com/@espdaniella/video/7001864331310714118\">Scholarships Guru (@espdaniella) - TikTok</a></li><li><a href=\"https://www.youtube.com/channel/UC0chOy9Fc5qGy7iCzgBBE8Q\">Keeping up with Ken - YouTube</a></li><li><a href=\"https://www.youtube.com/c/MarisaRose/featured\">Marisa Rose - YouTube</a></li><li><a href=\"https://www.tiktok.com/@nikhil.desai\">Nikhil Desai (@nikhil.desai) - TikTok</a></li></ol><p>For a crowdsourced list of more student content creators see here: <a href=\"https://docs.google.com/spreadsheets/d/1lCjI-upHZJ1pZHRG7f5OVmJbv1SNWJ9h8SsS61eYcRU/edit#gid=652209883\">Atila Student Resources Mega List - Student Content Creators</a></p><h3>Secret Hack for Finding Obscure Scholarships: Offline Scholarships!</h3><p>There are a lot of great resources on the internet to help you find the scholarships that you’re eligible for but a very underrated way to find other scholarships is going offline. These scholarships can be the best ones since not a lot of people know about them!</p><p>There are some scholarships that are still paper-based scholarships distributed through flyers, PDFs or on very obscure websites.&nbsp;</p><p>For example, local schools, rotary clubs, legions, radio stations and businesses may offer scholarships that are kept offline or on really obscure websites that few people know about. If that is the case, check different local announcement boards around town, or in the offices of each of the examples provided.</p><p>Here’s how to find them:</p><ol><li>Go to your guidance counsellor or financial aid office and ask if they have any scholarship posters or binders with scholarships that were sent to them.<br><br>&nbsp;</li><li>Visit the website of your local rotary club, legion, chamber of commerce and ask if they have scholarships.&nbsp;<br><br>&nbsp;</li><li>If you don’t see anything sometimes they don’t upload them to the website or they put it in an obscure place. Don’t be afraid to call or email to inquire about them.</li></ol><h3>Bonus: Asking for Scholarships that Don’t Exist</h3><p>This one is a bit unusual but I think it could work really well. There are certain categories of organizations that typically offer scholarships to students, but a specific organization within that organization may not offer a scholarship.&nbsp;</p><p>If you call or email one of those companies and ask if they offer scholarships, perhaps even mention the name of another similar organization to theirs which offers scholarships. They might actually create a scholarship just because you asked and if you were the one that asked, it would give you a very high chance of winning.</p><p>Here are some categories of organizations that typically offer scholarships. this would work well with</p><ol><li>Local chapters of a professional organization in your field of interest<ol><li>Professional Engineers of Ontario</li><li>Chartered Professional Accountant<br>&nbsp;</li></ol></li><li>Chambers of Commerce<ol><li>Milton Chamber of Commerce</li><li>Montreal Chamber of Commerce</li></ol></li><li>Ethnic or Religious Organizations<ol><li>Edmonton Multicultural Coalition</li><li>African Communities of Manitoba (ACOMI)<br><br>&nbsp;</li></ol></li><li>Literally any for-profit company<ol><li>Carlson Construction</li><li>Sheppard Realty</li></ol></li></ol><h3>Sample Email or Phone Script</h3><p>Here’s a sample email or phone call script template you can use.</p><p>Hey {organization_name} or even better: {name_of_person_working_at_organization},&nbsp;</p><p>My name is {full_name} and I’m a student at {school_name}. I {impressive_extracurricular_you_do_or_fact_about_yourself} and I’m currently searching for scholarships to apply for.</p><p>I was on the {organization_name} website and I noticed I couldn’t find any scholarships. I know that a lot of {organization_category} typically offer scholarships, for example I know that {similar_organization_name} has a scholarship{link_to_similar_organization_scholarship}. So I assumed that you might have one as well.</p><p>If you have one, could you please provide me a link to the scholarship?&nbsp;</p><p>If you don't have one yet and you decide to start one, could you please notify me?</p><p>Thank you so much for your time and enjoy the rest of your week.</p><p>Kindly,</p><p>{full_name}</p><p>Protip: Bonus points if impressive_extracurricular_you_do_or_fact_about_yourself is relevant to the organization</p><h2>Managing Your Scholarships</h2><p>Now that you’ve found scholarships, you’ll need a way of managing</p><h3>Track Deadlines using Google Calendar (or Yahoo, Microsoft calendar etc.)</h3><ol><li>After you find scholarships that you are interested in, create a calendar event for the due date.<br><br>&nbsp;</li><li>Set the location to be the URL of the scholarship.<br><br>&nbsp;</li><li>Set a notification 1 week, 3 days and 24 hours before the deadline. For scholarships that require more work, you can add more notifications.</li></ol><p>This will help you plan time to write your application and make you less likely to procrastinate finishing the application. Plus, it is super easy to find and hard to forget when notifications keep rolling in. Below you will see an example of an event created using Google Calendar.</p><figure class=\"image\"><img src=\"https://lh6.googleusercontent.com/YJv-M1t8zPQ48S-hMyL43G_X60Lsp5GA1G07KL7hCd6UvRXEQH8Oit1YXSEybXO-1qrdGiErzHiCbx_ak3vtRDvVMmteKoVqHS2-QF9roRHUX8Gbn1iGkRxUWtgZKAwA54ljeck6=s0\"></figure><h3>Save Scholarships in Cloud</h3><p>Another easy way to keep track of all of your previous scholarship applications is to save them to a Google Drive folder or Microsoft One folder. As you start to apply to multiple scholarships, you will find that a lot of them ask similar questions.</p><p>By having previous applications easily accessible, you can search for previous answers to similar questions to help you get started on your application.</p><p>Personally, we recommend Google Drive over Microsoft One for the following reasons:<br><br>&nbsp;</p><ol><li>Google Drive is free (up to 15GB), and accessible offline (Microsoft One is free as well)<br><br>&nbsp;</li><li>All your files are stored in the cloud. I think saving documents as Microsoft Word documents that only exist locally on your laptop is a bad idea.<br><br>&nbsp;</li><li>Google Drive has better search functionality so it makes it very easy to find past scholarships or applications.<br><br>&nbsp;</li><li>Really good collaboration tools so you can share an application with someone to help you review and work on it together in real-time. Much easier to share a Google Doc than a Microsoft Word document or PDF.</li></ol><figure class=\"image\"><img src=\"https://lh4.googleusercontent.com/eoLtmpC-luM7v-PPblWapMJywsZg8kwb7IXT1ANzPQ35aPYK72cJLxlEP-AqVDtgEL0HTKX3asKl8ctbwtvq1vkEC66si2a97FNrFyiZP-wDkYTjuvzG4YkCwJHljNLSEY6eAR-l=s0\"></figure><figure class=\"image\"><img src=\"https://lh4.googleusercontent.com/vht_srd3NGpIY_Y1JbA60BFZ0qJ-0lWhGpAzyTa6RPDup5CohLFGqK8z8yb72bW1KUAeF7G2Gojk048ZiWhwR_ej_ZQsVEZBYa4hBQv8XYbEV0Rl3Vdp2vqRgkzspkm3OuOyKSMf=s0\"></figure><h3>Use a Scholarship Helper Chrome Extension</h3><p>Use a scholarship helper chrome extension to help you automate the process of saving a scholarship to a calendar. For example, the Atila Scholarship Helper Chrome Extension allows you to easily save scholarships to your calendar, export to a spreadsheet in Google Drive and add personal notes.</p><figure class=\"image\"><img src=\"https://lh3.googleusercontent.com/I4IH2F2hZIVahuIxYqrW5P7f2h-Nj31xylATkg0jCfJtBacuDQiB_Tf2UrUjuR29KvQv57CICU0Zve8IE6Dp031tJYOLJpSC13dULa-gNBs2NEsW_p9vpEo82Y6mprPDFHPglwjb=s0\"></figure><h2>Clearing up Assumptions People Make About Scholarships</h2><h3>&nbsp;</h3><h3>Assumption: I don’t have the grades or Extracurriculars to win a scholarship</h3><h3>&nbsp;</h3><h3>Reality: Many scholarships don’t have grade requirements or require you to have a lot of extracurriculars or volunteer experience.&nbsp;</h3><p>&nbsp;</p><p>Sometimes they just require that you’ve done something cool or to write about a topic that you’re interested in, such as:</p><ol><li>Ayn Rand Institute Essay Contests | <a href=\"https://atila.ca/scholarship/ayn-rand-institute-atlas-shrugged-essay-contest\">Atlas Shrugged</a> | <a href=\"https://atila.ca/scholarship/ayn-rand-institute-anthem-essay-contest-cz2jzxih\">Anthem</a> | <a href=\"https://atila.ca/scholarship/ayn-rand-institute-the-fountainhead-essay-contest\">The Fountainhead</a></li><li><a href=\"https://atila.ca/scholarship/environmental-artworks-foundation-of-alberta-poster-photograph-contest-hg9hcq11\">Environmental Artworks Foundation of Alberta Poster &amp; Photograph Contest</a></li><li><a href=\"https://atila.ca/scholarship/poetry-nation-poetry-contest-kpnsi9pt\">Poetry Nation Poetry Contest</a><br>&nbsp;</li></ol><h3>Assumption: I have student loans but I already graduated so it’s too late for me</h3><h3>Reality: There are scholarships to pay off student loans, even if you have already graduated:</h3><ol><li><a href=\"https://atila.ca/scholarship/forget-your-student-debt-no-essay-grant-fq1hd6re\">Forget Your Student Debt. No-Essay Grant</a></li><li><a href=\"https://atila.ca/scholarship/fab-aid-student-debt-relief-initiative\">FAB AID Student Debt Relief Initiative</a></li><li><a href=\"https://atila.ca/scholarship/scholly-stimulus-program-tin38hx0\">Scholly Stimulus Program</a></li></ol><h3>Assumption: I Want a Scholarship that requires Little Effort</h3><h3>Reality: Most low-effort scholarships are basically just lottery scholarships</h3><figure class=\"image\"><img src=\"https://lh5.googleusercontent.com/lWBrnM51ymgGp7d1M2PMcEjQXgH9at-fDr1KxL5CL7oX0GsSh9a2MSix7Cow7gFpezk5v5uJvvbmaWbdS1XPmifjuKIsRj_TkjeSIelnc9qacD767-nucDLi0qxnfjgF6MGbj28J=s0\"></figure><p>We get it, being a student is hard. With school, work, extracurriculars, personal life it can be hard to find time to apply for scholarships. But nothing good in life comes easy. While there are scholarships that don’t require you to write an essay or do any work. Just “click to apply” those scholarships usually have a lot of applicants and because there is little information about yourself it ends up being based on luck instead of merit.</p><p>While there’s nothing wrong with applying to some of those scholarships some of the time. We wouldn’t recommend it as a sustainable way to get scholarships</p><h3>Assumption: It’s a waste of my time I’m not going to Win&nbsp;</h3><h3>Reality: Applying for scholarships pays better than most student jobs</h3><p>This is a very common assumption people often make. In fact, we hear this so often that we made <a href=\"https://docs.google.com/spreadsheets/d/1I0T3thpmZqxWStMy32LwmM923bFk-T7Datrgq0_06Oo/edit#gid=0\">an entire spreadsheet to calculate this</a>. Suppose the following:</p><ol><li>Apply to 20 scholarships, with an average value of $2,000</li><li>Spend 2 hours on each scholarship</li><li>Have a 5% win rate so you win 1 scholarship</li></ol><p>You would have made $50/hour!&nbsp;</p><p>Now, compare this to a part-time job. The average student in Canada makes CAD $16.55/hr ($12.97 USD) (<a href=\"https://ca.indeed.com/career/student-worker/salaries\">Indeed Canada</a>, <a href=\"https://ca.talent.com/salary?job=student\">Talent</a>) and in the US it’s USD $8.47/hr ($10.82 CAD)&nbsp; (<a href=\"https://www.indeed.com/career/student-worker/salaries\">Indeed USA</a>, <a href=\"https://www.payscale.com/research/US/Job=Student_Worker/Hourly_Rate\">Payscale</a>).</p><p>So you can make triple the amount of money from applying to scholarships than you do from the average part-time job.</p><figure class=\"image\"><img src=\"https://lh4.googleusercontent.com/tg2bQox4CTdLGC7jtDX7zNo3273pWKU7TeAcnTg1c3xNy-w7ZWq_DX3siaEwZQb3GNIIz7zP8bCNksfxHDyQ7IU2ncm88MGexEyuJZ_L-sUDQIMo7si4yHf1fG3bipMGwuT9wIUs=s0\"></figure><p>When you consider the fact that as you apply for more scholarships, you can start reusing essay responses, transcripts, reference letters. Also, combined with the tools and tips we suggested here you could save even less time and find higher-paying scholarships with less competition. That number could be even higher.</p><p>There’s also a lot of intangible benefits to scholarships beyond just the money:<br>&nbsp;</p><ul><li>Some scholarships offer internships and jobs in addition to the money</li><li>Networking opportunities with the sponsors and other winners</li><li>Improve your communication skills and some scholarships require you to make something cool ( <a href=\"https://atila.ca/scholarship/atila-women-creators-scholarship-6jkhii4p\">this one</a> or <a href=\"https://atila.ca/scholarship/atila-continuous-learning-scholarship-j11gu8k5\">this one</a>), which you can add to your portfolio whether or not you win</li><li>It looks good on your resume or LinkedIn</li></ul><h2>Conclusion</h2><p>As a student, there are so many resources available to help you pay for school and earn money. Hopefully, this guide has given you some ideas about how to fund your education!&nbsp;</p><p>If you have any comments or questions about this blog post, let us know! We read every comment and reply to most.&nbsp; You can leave a comment about this blog post on post on the r/Atila subreddit. Or join our discord.&nbsp; You can also follow or DM us on Twitter or Instagram @atilatech</p>",
		"date_created": "2021-09-10T03:07:50Z",
		"description": "The average university student graduates with $28K in student debt, yet at the same time, every year there are millions of dollars in scholarships that go unclaimed!\n\nOur guide hopes to solve both of those problems.",
		"header_image_url": "https://i.imgur.com/95qV22q.png",
		"published": true,
		"up_votes_count": 0,
		"down_votes_count": 0,
		"up_votes_id": [],
		"down_votes_id": [],
		"metadata": {},
		"related_items": null,
		"user": {
			"first_name": "Tomiwa",
			"last_name": "Ademidun",
			"username": "tomiwa",
			"profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fljy9s5nm-Ezc5Hyf.jpg?alt=media&token=2391816e-c546-4b11-b232-0cc91f9f3547",
			"id": 1
		}
	}
}