{
    "blog": {
        "id": 117,
        "contributors": [
            {
                "user": 1,
                "first_name": "Tomiwa",
                "last_name": "Ademidun",
                "username": "tomiwa",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fljy9s5nm-Ezc5Hyf.jpg?alt=media&token=2391816e-c546-4b11-b232-0cc91f9f3547"
            }
        ],
        "title": "“What’s The Word Count?”: Analyzing the Correlation Between Essay Length and Quality",
        "slug": "whats-the-word-count-analyzing-the-correlation-between-essay-length-and-quality",
        "alternate_slugs": [],
        "body": "<h2>Introduction</h2><p>We analyzed 350 scholarship application essays to see if there was a correlation between essay length and quality.</p><p>Here’s a highlight of what we learned:</p><ul><li>Yes, there is a strong correlation. Longer applications tend to score better<ul><li>70% of an application score can be determined by its length</li></ul></li><li>However, the relationship is logarithmic not linear<ul><li>In other words, longer applications tend to perform better but up to a point</li><li>A longer application is not necessarily a better application</li></ul></li><li>The longest application won the scholarship award 60% of the time</li><li>The average scholarship winner had the 2nd longest application</li><li>The average scholarship winner wrote 565 words for each application</li></ul><figure class=\"image\"><img src=\"https://lh6.googleusercontent.com/kymj11ieYbGK5mPGKjvbjOt2DY3VNDTrsmTYQ8DEz1uTZpFCMBdq9AaJrZ9Q3aArvSe-aoe4wpqRLCv3otbZy0Vx--uDnJNTEicr3jY5L1BTLBsSf3F8KcUcSyQXViCem6ZWFVRi\"></figure><p><i>Relationship between average word count and score with logarithmic best fit curve</i></p><figure class=\"table\"><table><tbody><tr><td>Category</td><td>Average Word Count</td></tr><tr><td>Scholarship Winners</td><td>565</td></tr><tr><td>Scholarship Finalists</td><td>354</td></tr><tr><td>Scores 9-10</td><td>408</td></tr><tr><td>Scores 8-8.9</td><td>319</td></tr><tr><td>Scores 7-7.9</td><td>190</td></tr><tr><td>Scores 6-6.9</td><td>126</td></tr><tr><td>Scores 5.9 and below</td><td>68</td></tr><tr><td>Total Applications</td><td>349</td></tr></tbody></table></figure><p><i>Average word count for different performance buckets</i></p><h2>Recommendations</h2><h3>Instead of Enforcing Word Counts, Suggest Word Counts based on other Good Essays</h3><p>One reason why we conducted this analysis is that we want to see if we could use this information to help students write better essays and help teachers provide better instructions when assigning essays to students.</p><p>At Atila, we don’t enforce word counts in scholarship applications because we believe that writing should be <a href=\"https://twitter.com/tomiwa1a/status/1418917180935127043\">as long as necessary but as short as possible</a>. Word counts are often arbitrary and can end up cutting people’s expression if they have more to say or force jargon if they have nothing more to say.</p><p>However, word counts are helpful because they help provide a useful benchmark of how much time and detail is expected in an application. Instead of enforcing word counts in scholarship applications, we’ve recently started sharing the table at the end of this page with students while they write their scholarship essays. This will help students make their own decisions about how much they want to write for a given application.</p><p>One of our <a href=\"https://atila.ca/values\">values</a> at Atila is to bet on people. We believe we should give students the freedom to make their applications as long or as short as they feel is right and that they will make the right choice if we provide the right guidance.</p><p>For example, at Atila we <a href=\"https://twitter.com/tomiwa1a/status/1418932327191830530\">suggest</a> that student applications should be at least 300 words to get a score of 8 but that the average scholarship winner has a word count of 500. The goal is to update this table periodically so that students have a better idea of how many words to write for a “good application”.</p><h3>Advice for Teachers and Students</h3><p>If you work in education and writing or grading essays is part of your work, try this method instead of enforcing word counts:</p><ol><li>Get the word counts of past essays you have graded<ol><li>There are many <a href=\"https://www.google.com/search?q=free+word+counter\">free word count software</a> on the internet that makes your life easier</li><li>If you don’t have the ability or time to word count all your essays just pick the best applications<br><br>&nbsp;</li></ol></li><li>Make a table to see the correlation between the length of the application (word count) and the quality (what grade it received), similar to the one we showed above. Here is a <a href=\"https://docs.google.com/spreadsheets/d/1tIoYfPQAczrGUmkHVQWCXMk4sDCSnEf1NzhRjrZxato/edit?usp=sharing\">Google Sheet with some test data</a> which you can use.<br><br>&nbsp;</li><li>Provide a “suggested” word count and provide a table showing the relationship between past essay scores and their word counts (or you can use ours!). Then let the students decide how many words they should write.<br><br>&nbsp;</li></ol><p>If you’re a student, send your teacher this blog post and tell them to consider trying this method!</p><p>If there’s enough interest, we could write a python script that does this automatically for your essays. Tweet us <a href=\"https://twitter.com/atilatech?lang=en\">@atilatech</a> and if enough people want it, we could build it.</p><h2>Detailed Analysis</h2><h3>Hypothesis</h3><p>From our team’s collective experience from reviewing applications, the apps that stand out are the ones that have ample points to support their argument. We look for points that provide justification and attention to detail for their research. A well-written application should also be in layman terms and have no distracting jargon. However, in order to explain ideas clearly, a high word count may be necessary. We acknowledge that it may be the case that high word count is not a function of application score, but rather the number of interesting points that the author writes. As average word count per long answer question increases, the application score should also increase.&nbsp;</p><p>Another interesting point to explore is whether maximum word count - when comparing different questions in a single application - has any correlation with score. Assuming there is some correlation between average word count and score, the presence of an outlier-type application response would theoretically boost an application’s status. In other words, having a standout application response next to several mediocre ones by a candidate should be enough to secure some percentage of score increase.&nbsp;</p><h3>Methodology</h3><p>There are 5 scholarships that are applicable for analysis in the Atila database. Every application from these five scholarships has a max_word_count, average_word_count, and average_user_score.&nbsp;</p><p>To determine the average/max word count for a certain bucket (Ex. Scholarship Winners), take the sum of all average/max word count and divide by the number of applications in the bucket. This method was used for all calculations on average values. The function STDEV was used for determining the standard deviation of each scholarship.</p><h3>Findings</h3><figure class=\"table\"><table><tbody><tr><td>Scholarship ID</td><td>Average Word Count</td><td>Standard deviation</td><td>Winner average_word_count</td><td>Winner_is_highest_word_count</td><td>Winner_avg_word_count_position</td></tr><tr><td>733</td><td>177</td><td>123</td><td>645</td><td>TRUE</td><td>1</td></tr><tr><td>739</td><td>205</td><td>174</td><td>546</td><td>FALSE</td><td>2</td></tr><tr><td>720</td><td>302</td><td>209</td><td>895</td><td>TRUE</td><td>1</td></tr><tr><td>711</td><td>117</td><td>91</td><td>347</td><td>FALSE</td><td>4</td></tr><tr><td>719</td><td>208</td><td>118</td><td>437</td><td>TRUE</td><td>1</td></tr><tr><td>Results</td><td>202</td><td>162</td><td>574</td><td>60.00%</td><td>1.8</td></tr></tbody></table></figure><p><i>Analysis of 5 direct application scholarships on Atila’s website.&nbsp;</i></p><p>From the data above, no scholarship winner placed below fourth on word count, with an average of second place across all scholarships.</p><p>It’s important to note that all scholarship sample sizes are <a href=\"https://www.investopedia.com/terms/c/central_limit_theorem.asp#:~:text=Key%20Takeaways-,The%20central%20limit%20theorem%20(CLT)%20states%20that%20the%20distribution%20of,for%20the%20CLT%20to%20hold.\">at/above 30</a> (Central Limit Theory dictates that sample sizes &gt;= 30 are considered sufficient to calculate sample means). Thus, the impact from lack of available data - including variance at the extremes and presence of outliers - are not prevalent. Although 5 scholarships aren’t enough to declare a relationship, the overwhelming placements of high word count applications indicate a definitive relationship between word count and score. However, without analysis of key correlation measures such as the R-squared coefficient, an accurate conclusion cannot be drawn. The extent to which they are related will be explored further.&nbsp;</p><figure class=\"image\"><img src=\"https://lh5.googleusercontent.com/sagjGzzzEH-yq-mG6dbILnu5XkAEKje4Af6osLlYlkiPHBAAWZ5GPepPKqVmZ8wzOd9yvyv-9SETxWE8fi13XJEbJuWq_gqLCiVlk-S8SXKarZuE4N_iGydb0nKfML365G5ZK3we\"></figure><p><i>Relationship between average word count and score with logarithmic best fit curve&nbsp;</i></p><p>With the above set of data points, the relation between average user score and average word count can be best described as a logarithmic relation. The R-squared correlation from the above graph is 0.714. Seeing that R-squared measures the percentage of variance of a dependent variable that can be explained by the variance of an independent variable, there are several implications present.&nbsp;</p><p>Firstly, in statistics related to the social sciences, it’s notoriously hard to know the relationship between two variables, as there are always other factors in play that skew data. According to <a href=\"https://www.investopedia.com/terms/r/r-squared.asp\">Investopedia</a>, since predicting human behaviour is difficult, having an r-squared of over 0.5 is considered significant. With the r-squared figure at 0.714, we can say that change in average word count accounts for almost ¾ of the variance in user score. This revelation is significant because of the boundary-less properties of both its variables; both word count and score are implemented in school curriculums and college applications in addition to scholarships. Imagine a high school teacher telling students that how much a person writes accounts for almost 75% of their score increase. This finding can cause writers to rethink their core philosophies.&nbsp;</p><p>Additionally, the high ratio of population standard deviation to population mean (162-202) is an indication of the presence of outliers stretching the data set in two directions. Usually, this is a cause for concern, as outliers are data aberrations that don’t accurately represent the line of best fit. However, in the business of scholarships applications (and any written answer, for that matter), selecting the best out of a population is precisely selecting the outliers. Applications are reviewed on the basis that they stand out from the crowd, exhibiting special qualities that few others possess. Thus, the presence of these outliers, coupled with a high R-squared coefficient, means that the applicants who write significantly more than their playing field tend to receive higher scores.&nbsp;</p><figure class=\"image\"><img src=\"https://lh6.googleusercontent.com/mX-P7GiJHJg1PHHDNVEbDV_w8Y6q7YixugN1ATFh3NwUaD2Xyg_SyrJGqhMlXb7L8tc1DqQzDZNjz0dJln6GueCba48v_gFQ5KVj5gWfdRtlE4razTTLNlbZRY6OMfkxRYxI5ZSH\"></figure><p><i>The relationship between maximum word count and score is slightly less correlated than average word count; this may be due to lack of completeness in an application&nbsp;</i></p><p>Similar to average word count, the R-squared correlation of the relationship between maximum word count and user score is 0.692. With virtually identical figures, it can be concluded that there is also a relationship there. The slight decrease in correlation can be explained by the criteria for scoring Atila applications, where completeness of application is assessed. Some applications may exhibit exemplary responses for one question, but lack depth for another, thereby lowering their score.</p><h2>Conclusion</h2><p>From analyzing the data from Atila’s direct application scholarships, an application’s average word count has a strong correlation with how well it scores. This could be because of many factors related to reviewer psychology. One such study conducted by Andrew Tomkins, Min Zhang, and William D. Heavlin showed how “<a href=\"https://www.pnas.org/content/114/48/12708\">single-blind reviewing confers a significant advantage to papers with famous authors</a>”. Similar to this study, reviewers may be tempted to give higher scores to longer applications because it looks more legitimate.</p><p>Another explanation is one we explored earlier, which is that it is frequently impossible to express breadth of ideas in a concise manner. In order to fully describe nuanced opinions with multiple examples and points, responses will inevitably be long.</p><p>Regardless of reason, there is ample evidence that word count is related to score. Keep that in mind when your next written assignment is due. If you have any questions, tweet us at <a href=\"https://twitter.com/atilatech?lang=en\">@atilatech</a>, message us on Instagram <a href=\"https://www.instagram.com/atilatech/\">@atilatech</a>, or start a thread at <a href=\"https://www.reddit.com/r/atila/\">r/atila</a>.</p>",
        "date_created": "2021-07-24T18:37:22Z",
        "description": "We analyzed 350 scholarship application essays to see if there was a correlation between the essay length and quality.\r\n\r\nHere’s a highlight of what we learned:\r\n\r\n- Yes, there is a strong correlation. Longer applications tend to score better\r\n- 70% of an application's score can be determined by its length\r\n- However, the relationship is logarithmic not linear (longer is not always better)",
        "header_image_url": "https://imgur.com/iNO7W30.jpg",
        "published": true,
        "up_votes_count": 0,
        "down_votes_count": 0,
        "up_votes_id": [],
        "down_votes_id": [],
        "metadata": {},
        "related_items": null,
        "user": {
            "first_name": "Eric",
            "last_name": "Wang",
            "username": "ericwang451",
            "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1972%2Fpoysmr85-hi.png?alt=media&token=0a951337-b510-45b7-b612-e39c26bf8864",
            "id": 1972
        }
    }
}