{
    "_comment": "For testing the multiple awards feature",
    "scholarship": {
      "activities": [],
      "archived": false,
      "citizenship": [],
      "city": [],
      "country": [],
      "criteria_info": "<h2>How to Apply</h2><h4>Eligibility</h4><ul><li>Contest is open to students worldwide, except where void or prohibited by law.</li><li>Entrant must be a 12th grade, undergraduate, or graduate student for any part of the school year in which the contest is held. The Ayn Rand Institute reserves the right to make exceptions to this rule, on a case-by-case basis, for international students or for students with nonstandard school years. Verification of school enrollment will be required for all winning entrants.</li></ul><h4>Application</h4><h2>SELECT ONE OF THE FOLLOWING THREE TOPICS:</h2><ul><li>In&nbsp;<i>Atlas Shrugged</i>, the society’s leaders enact a series of laws and directives (the Equalization of Opportunity Bill, Mouch’s directives about the railroads of Colorado, Directive 10-289, etc.) that exercise increasingly arbitrary power. Describe one example of a major recent government policy decision in your country that resembles one of the edicts in&nbsp;<i>Atlas Shrugged</i>. How has this decision been justified by today’s leaders, and how do their claims resemble those given in&nbsp;<i>Atlas Shrugged</i>? In light of the story, what do you think Ayn Rand would expect to be the consequences of the policy you’ve described? Do you agree with her? Explain your answers.</li><li>Francisco d’Anconia presents himself as a playboy who has abandoned serious concern for his family’s business. But early in the story Dagny realizes that Francisco’s public persona does not fit with the man she knows. Compare Francisco to another major figure in film, TV, or literature who adopts a similar double life to accomplish his purposes. How is he similar? How, in terms of his motives and methods, is he different? What kind of purpose could make the price of leading a double life like this worth paying? Explain your answers.</li><li>After quitting her job, Dagny thinks this to herself: “It is not proper for man’s life to be a circle . . . or a string of circles dropping off like zeros behind him—man’s life must be a straight line of motion from goal to farther goal, each leading to the next and to a single growing sum, like a journey down the track of a railroad, from station to station to—oh, stop it!” How do Dagny’s thoughts here relate to the wider dilemma she faces at this point in the story? How does her dilemma relate to the wider themes of the novel? Explain your answers.</li></ul><h4>Judging</h4><p>Essays will be judged on whether the student is able to argue for and justify his or her view—not on whether the Institute agrees with the view the student expresses. Judges will look for writing that is clear, articulate and logically organized. Winning essays must demonstrate an outstanding grasp of the philosophical meaning of&nbsp;<i>Atlas Shrugged</i>.</p><p><a href=\"https://studentawards.com/scholarships/ayn-rand-atlas-shrugged-essay-contest-scholarship/\">Source</a></p>",
      "date_created": "2018-02-27",
      "date_time_created": "2018-02-27T18:48:10.193952Z",
      "deadline": "2021-09-28T03:00:00Z",
      "description": "Have you ever read one of Ayn Rand’s thought-provoking novels? Now’s the time! Enter an Ayn Rand Institute essay contest and you’ll have a chance to win thousands of dollars in scholarship prize money. ARI has held essay contests on Ayn Rand’s fiction for more than thirty years, awarding over $2 million in total prize money to students around the world! This year we will award more than $30,000 to student winners.",
      "disability": [],
      "eligible_programs": [],
      "eligible_schools": [],
      "ethnicity": [],
      "female_only": false,
      "international_students_eligible": true,
      "form_url": "",
      "funding_amount": "30000.00",
      "heritage": [],
      "id": 291,
      "industries": [],
      "img_url": "https://studentawards.com/wp-content/uploads/2021/04/logo-header.png",
      "is_atila_direct_application": false,
      "is_funded": false,
      "is_editable": true,
      "is_not_available": false,
      "is_payment_accepted": false,
      "is_winner_selected": false,
      "keywords": "international student",
      "language": [],
      "learn_more_url": null,
      "learn_more_title": null,
      "metadata": {
        "base_score": 0,
        "old_criteria_info": "## REQUIREMENTS\n\n  * No application is required. Contest is open to students worldwide, except where void or prohibited by law. Essays must be written in English only.\n  * Entrant must be a 12th-grader, college undergraduate or graduate student for any part of the school year in which the contest is held. ARI reserves the right to make exceptions to this rule, on a case-by-case basis, for international students or for students with nonstandard school years.\n  * To avoid disqualification, mailed-in essays must include a stapled cover sheet with the following information: \n    1. your name and address;\n    2. your email address (if available);\n    3. the name and address of your school;\n    4. topic selected (#1, 2 or 3 from the \"Topics\" tab);\n    5. your current grade level; and\n    6. (optional) the name of the teacher who assigned the essay if you are completing it for classroom credit.\n  * Essay must be no fewer than 800 and no more than 1,600 words in length, double-spaced. Spelling errors and/or written corrections (by anyone) found on the essay will count against the final grade and should be omitted before submission.\n\n## ABOUT [THE AYN RAND INSTITUTE](https://ari.aynrand.org/)\n\nARI fosters a growing awareness, understanding and acceptance of Ayn Rand's\nphilosophy, Objectivism, in order to create a culture whose guiding principles\nare reason, rational self-interest, individualism and laissez-faire\ncapitalism­­ -- a culture in which individuals are free to pursue their own\nhappiness. How? Our strategy, priorities and programs are informed by Rand's\ndistinctive view of what sets the direction of a society. It is not the latest\nelection results or media celebrities but the philosophic ideas that shape\nmen's choices and actions.\n\n"
      },
      "name": "Ayn Rand Atlas Shrugged Essay Contest Scholarship",
      "is_finalists_notified": false,
      "finalists_notified_date": null,
      "number_available_scholarships": 1,
      "occupations": [],
      "open_date": null,
      "other_demographic": [],
      "owner": 1,
      "owner_detail": {
        "user": 1,
        "first_name": "Tomiwa",
        "last_name": "Ademidun",
        "username": "tomiwa",
        "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fvymkp8dx-tomiwa-ivey-profile-picture-cropped.jpg?alt=media&token=7ee689e8-6fc8-4ad0-a867-c1e20995f69d"
      },
      "province": [],
      "published": true,
      "religion": [],
      "scholarship_url": "https://aynrand.org/students/essay-contests/#tab-3-atlas-shrugged",
      "slug": "ayn-rand-atlas-shrugged-essay-contest-scholarship-0hozv0v3",
      "specific_questions": {},
      "sports": [],
      "updated_at": "2021-09-25T01:33:43.177236Z",
      "user_profile_questions": {},
      "is_blind_applications": true,
      "is_referral_bonus_eligible": false,
      "collaborators": [],
      "reddit_url": null,
      "stripe_payment_intent_id": null
    },
    "contributors": [],
    "awards": [
      {
        "id": "i5zyx0hyypvorfae",
        "funding_amount": "15000.00"
      },
      {
        "id": "i6ym8dln5rvgq2cv",
        "funding_amount": "14000.00"
      },
      {
        "id": "bzrd34e4cir8eu0j",
        "funding_amount": "1000.00"
      }
    ]
}