{
    "essays": [
        {
            "id": 10,
            "title": "Western National Scholarship Essay 2014",
            "slug": "western-national-scholarship-essay-2014",
            "body": "<div title=\"Page 2\">\r\n<div>\r\n<div>\r\n<h1>Importance of Equal Education in Nigeria</h1>\r\n<p><br />The world we live in is not a fair place and we are not all born into this world through ideal circumstances. Despite Thomas Jefferson&rsquo;s idealistic sentiment, all men are not created equal and not all people are privy to equal opportunities. This grim reality is illustrated in most places in the world, but especially true in third world countries. The country whose interests are dearest to my heart is the Federal Republic of Nigeria.</p>\r\n<p>&nbsp;</p>\r\n<p>Nigeria is a classic example of a nation where the divisions between the upper and lower classes are exceptionally stark and the divisions are exacerbated by a dwindling middle class. I won&rsquo;t discuss philosophically whether or not it is fair that certain people are born into greater privilege than others because that is simply an unfortunate but unavoidable fact of life. However, I am greatly concerned by the lottery we play in Nigeria concerning the education of our youth. This unequal access to education is the origin of what perpetuates classist divisions in Nigeria.</p>\r\n<p>&nbsp;</p>\r\n<p>To truly understand how severe the social divide in Nigeria is, consider these facts: Nigeria is the fifth largest petroleum exporter in the world (CIA, 2010). Approximately 142,000 Nigerians visited the UK in 2011, spending an average $172 per day on luxuries like designer clothes and shoes(Elbagir, 2013) and if the $1.5 million that Nigerians spent on UK schools was spent in Nigeria, this would amount to 60% of their educational budget (&ldquo;Why Nigerians Prefer Schooling Abroad&rdquo;, 2013). We must ask ourselves how it is possible that a country with such wealth also has 72 % of its population living on a dollar a day or less (Unesco, 2013), a 51% illiteracy rate (Unesco, 2013), and a mere 4% of secondary school students go on to enter post-secondary institution five years after graduating (Unesco, 2013).</p>\r\n<p>&nbsp;</p>\r\n<p>The primary cause of this statistical inequity is one which has plagued humans since the beginning of time, the human weakness of greed. Echoing, biblical history when Judas betrayed Jesus for thirty silver shekels, Nigerian politicians betray their own people for millions of dollars a year.</p>\r\n<p>&nbsp;</p>\r\n<p>There was a time when Nigerian schools delivered an effective education to the extent that there was little difference between sending your children to a local school and sending your children to a school abroad. There was also little distinction between a child who had been educated at a public school and one who had attended a private school because the public school system was quite strong. However, problems slowly began to arise after Nigeria gained independence from the British in 1967. What followed was a mad grab for power, similar to a more chaotic version of the oligarchy/privatization of Russia in the 1980&rsquo;s, through numerous military coups.</p>\r\n<p>&nbsp;</p>\r\n<p>As the British became less involved in Nigerian affairs, Nigerian politicians felt more liberated to channel public funds into personal accounts. Individuals in the private sector with the capability to oppose this injustice were content with sending their children to highly exclusive private schools while the dwindling middle and lower classes were left to send their children to schools that would not effectively prepare them for future jobs. Today, many Nigerians who have achieved financial stability are too worried about maintaining their wealth to be concerned about the welfare of the lower class.</p>\r\n<p>&nbsp;</p>\r\n<p>Unfortunately, I am not convinced that we as Nigerians are prepared to solve this problems by ourselves and the task of resolving this issue will have to fall on the proverbial shoulders of international non-profit organizations such as the Bill and Melinda Gates Foundation or the Rockefeller Foundation. I have a long-term vision to revamp the education system in Nigeria, and other third world nations, to ensure that everyone in this world is given a fair chance to strive for their goals. The organization would be based in a major Nigerian city such as Lagos and would be open to boys and girls ages 14-17 across the country, with future plans to expand across the continent. The initiative would be funded by donations and possibly by levying taxes on the top earners in Nigeria (by implementing luxury taxes and taxes on certain private schools).</p>\r\n<p>&nbsp;</p>\r\n<p>I believe that the Nigerian government would be willing to support such an initiative because of the potential recognition and voter support that they would receive. The initiative would also be funded by corporate donations from companies seeking tax write-offs and improved public relations. The aim of improved Nigerian schools would not be for students to simply graduate secondary school but for these graduates to attend world class universities across the globe. The non-profits could create partnerships with universities around the world whereby students coming from the schools would be able to enter for a discounted tuition rate, which would be subsidized my scholarships. If this initiative were to become successful the benefits would transcend beyond Nigeria and would be a source of inspiration for any nation with a struggling education system, especially third world counties.</p>\r\n<p>&nbsp;</p>\r\n<p>This model is not limited in its applicability to Nigeria, but rather could be applied in developing countries all over the world because education is a right which all human beings deserve access to. I believe that this is the most important human need, after basic needs such as food, clothing, and shelter have been met. Education is so important because it provides people with an opportunity to live better lives in the long term rather than simply giving them enough to survive today. Education is what I like to call the great equalizer and one must simply look at human history within the last fifty years to understand the true value of an education. Without access to a strong, affordable education, Barack Obama would not be the president of the United States.</p>\r\n<p>&nbsp;</p>\r\n<p>While, some may argue that Barack Obama is a rare exception and very few people have the means to go to Harvard, it is also important to understand that without a quality secondary school education he would not have even had the opportunity to earn the spot at Occidental College or Columbia University which eventually led him to Harvard. This is essentially the purpose of receiving an education, it provides people with a fair chance to strive for a better life with a better understanding of the value of education as a means to achieve it, and with the opportunity to reciprocate and allow others to experience the same advantages. The old adage comes to mind: give a man fish and you feed him for a day, teach a man to fish and you feed him for a lifetime. I would be so bold as to add that when we provide people with a sufficient education, we give them a fair opportunity to feed themselves, their peers and future generations.</p>\r\n</div>\r\n</div>\r\n</div>\r\n<div title=\"Page 5\">\r\n<p>&nbsp;</p>\r\n<p>[Word Count: 1,134]</p>\r\n</div>",
            "date_created": "2019-04-05T15:23:12Z",
            "description": "My application for the Western National Scholarship Essay program in 2014.\nI didn't win this scholarship 😕.",
            "status": "declined",
            "status_other": "",
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F10%2FWestern%20National%20Scholarship%20Essay.pdf?alt=media&token=33478c6e-a980-4204-a103-2e1e986c4265",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Tomiwa",
                "last_name": "Ademidun",
                "username": "tomiwa",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fvymkp8dx-tomiwa-ivey-profile-picture-cropped.jpg?alt=media&token=7ee689e8-6fc8-4ad0-a867-c1e20995f69d",
                "id": 1
            },
            "contributors": []
        },
        {
            "id": 3,
            "title": "Queen's Commerce and Engineering Application 2014",
            "slug": "queens-commerce-and-engineering-application-2014",
            "body": "<h3>Queen&rsquo;s PSE (300 Words)</h3>\r\n<p><em> In an essay of 300 words or fewer (approximately 1950 characters with spaces), write about your goals for your time at Queen's University and beyond. Your answer will be evaluated for content and writing style. </em></p>\r\n<p>&nbsp;</p>\r\n<p>My primary goal during my time at Queen's University is to broaden my perspective and motivate my desire for proactive change in the society around us. Without indulging in too many clich&eacute;s and hollow phrases, I want my time at Queen's to include moments where I am constantly being inspired and challenged by the intelligent people that are part of the Queen's community. I want to leave with a degree that I hope will give me a competitive advantage in the job market and an alumni network that will benefit me in my professional endeavors. I want to leave Queen&rsquo;s with an awareness of all the possibilities for success that exist in our global village.</p>\r\n<p>&nbsp;</p>\r\n<p>My long term goal beyond my time at Queen&rsquo;s University involves taking advantage of emerging markets in places like China, Dubai, and Nigeria. My main interests include property development and alternative energy sources, industries which I hope to become more exposed to during my time here at Queen&rsquo;s. Initially I would love to work with a property development firm in one of these countries, become acquainted with the business culture and eventually start my own business that will specify on catering to the emerging middle class in these countries.</p>\r\n<p>&nbsp;</p>\r\n<p>It is quite evident how a degree in business or engineering would benefit me if I decided to go this route; but I also believe that a Queen&rsquo;s degree will be even more beneficial due to its recognition around the world and the popular exchange program in its third year commerce program which would help me develop contacts globally even from the infant stages in my career. I truly believe that a degree from Queen&rsquo;s University will be an integral part of me achieving my goals.</p>\r\n<p>&nbsp;</p>\r\n<h3><strong>Queen&rsquo;s Commerce Essay (2 X 300 words) </strong></h3>\r\n<h4><strong>School of Business Essay Questions Please answer both questions. </strong></h4>\r\n<p>&nbsp;</p>\r\n<p><em>1. In 300 words, or fewer, please demonstrate the research you have done to ensure that Queen&rsquo;s Commerce Program is the right fit for you. </em></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Immediately, one of the most attractive aspects of the Queen&rsquo;s commerce program was its national prestige and acclaim. Commerce has consistently distinguished itself, evident by finishing in the top 5 business schools in studies done by the Globe and Mail and Maclean&rsquo;s. Queen&rsquo;s is also well known for consistently sending students to work for top companies in the Investment Banking industry such as Goldman Sachs and Credit Suisse, which is one of the fields I am interested in. Attending a school with such strong connections with these companies would certainly offer me an advantage when searching for jobs and internships. Another benefit which attracts me to Queen&rsquo;s university is the numerous networking opportunities offered by the school, for example the networking event that Queen&rsquo;s organized with the Boston Consulting Group is one of many unique opportunities which is only available to students at certain elite level business schools in the country and being accepted into the Queen&rsquo; program would provide me with many similar networking opportunities.</p>\r\n<p>However, for me the factor which distinguished Queen&rsquo;s Commerce from all the other business schools in the country is the exchange program. Truthfully, when I read about this opportunity I became very excited and my entrepreneurial visions immediately began materializing. I have a long term goal of working in countries with emerging markets such as China, Dubai and Nigeria and going on an exchange to one of these countries would provide me with the perfect opportunity to develop contacts with individuals in this country. For example, the partnerships Queens has with Peking University, Guanghua School of Management or Tsinghua University. The combination of all these various factors is why I believe that Queen&rsquo;s is the right business school for me.</p>\r\n<p>&nbsp;</p>\r\n<p><em>2. The greatest lessons in life tend to come from challenging experiences. In 300 words, or fewer, please tell us about a challenging experience you have faced, and what you have learned from it. </em></p>\r\n<p>&nbsp;</p>\r\n<p>My grade eleven year of high school was a very difficult time for me, yet, it was definitely a character building experience that taught me a lot. I had it all planned out, I would hand in my application for school prefects-get accepted and then I would apply for en executive position in student council and get accepted to that as well. However, the problems started when a teacher I am close with pulled me aside and told me that the only complaint about me was that I appeared to often be concerned only with my own interests and was all about &ldquo;Team Tomiwa&rdquo;, a phrase I will never forget.</p>\r\n<p>&nbsp;</p>\r\n<p>To summarize, I did not get selected for either position and became very angry and resentful, laying blame at everyone but myself. I vowed to never to contribute to the school again and would never join another school club again. However, after talking with my parents and the principal, we all agreed that I still had leadership potential but first I had to acknowledge my own flaws. After humbling myself and asking the teachers which didn&rsquo;t select me for feedback on my weakness, we all worked together to look for opportunities where I could still contribute to the school community. This was my first real exposure to rejection, disappointment, and self-doubt. However this very bitter time in my life taught me that sometimes in life you are not always given what you deserve and worse yet is that sometimes you get exactly what you deserve.</p>\r\n<p>&nbsp;</p>\r\n<p>I also learned the importance of self-confidence, the significance of trusting others and working in a team and the virtues of selflessness and persevering through difficult times. Skills that do not only translate into success in business but also into success in life.</p>",
            "date_created": "2019-04-01T13:42:09Z",
            "description": "My applications for both the Queen's Commerce and Engineering program. The first part is for both engineering and Commerce programs. The second part was specifically for the Queen's Commerce program.",
            "status": "accepted",
            "status_other": "",
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F3%2FQueens%20PSE%20and%20Commerce%20Application%202014.pdf?alt=media&token=52c7bd24-980a-4df3-854d-45008c4aac30",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Tomiwa",
                "last_name": "Ademidun",
                "username": "tomiwa",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fvymkp8dx-tomiwa-ivey-profile-picture-cropped.jpg?alt=media&token=7ee689e8-6fc8-4ad0-a867-c1e20995f69d",
                "id": 1
            },
            "contributors": []
        },
        {
            "id": 2,
            "title": "Ivey Business School AEO Application 2014",
            "slug": "ivey-business-school-aeo-application-2014",
            "body": "<p><strong>Ivey Essay (3 X 500 words) </strong></p>\n<p>&nbsp;</p>\n<p>Consider all the activities (extracurricular, community involvement, paid/volunteer work experience, entrepreneurial ventures) that you have been involved in during the past 4 years. Select 3 activities that you feel highlight your leadership experience best. Please limit each description to one activity.</p>\n<p>Please focus your description on elements that demonstrate: <strong>teamwork, initiative, achievement, commitment, </strong>and<strong> breadth</strong>.</p>\n<p>&nbsp;</p>\n<p>Select the &lsquo;Add Activity&rsquo; button below and use the form for each of your three activities. Complete all of the required fields. For the activity description, use an essay format, NOT bullet points. Please limit your description for each activity to 500 words and note that grammar and spelling will be assessed.</p>\n<p><span style=\"text-decoration: underline;\">Clubs/Societies/Orgs</span></p>\n<ol>\n<li>Extracurricular Executive Member, Athletic Council, October 2013-present&nbsp;</li>\n<li>Community Involvement Student Representative, HCDSB Mental Health, October 2013-present</li>\n<li>Entrepreneurial Venture Academic Tutor September 2012-present ,</li>\n</ol>\n<p>&nbsp;</p>\n<div title=\"Page 1\">\n<div>\n<div>\n<div>\n<p><span style=\"text-decoration: underline;\"><strong>Intramural Soccer</strong></span></p>\n<p>The creation of an intramural soccer league is an excellent example of an initiative which I started and have followed through with. I am a very avid soccer fan and have wanted to share the beautiful game with as many students as possible, while promoting school amity and healthy living. The first step was approaching a large, diverse group of students and trying to gauge the interest level in what I was planning to do, this required strong communication and persuasive skills because I had to really market the event as something fun and enjoyable, despite the fact that this was the inaugural year. Next I met frequently with the head of the physical education department and my head soccer coach trying to organize various logistics such as legal issues, teacher supervisors and gym space. These meetings taught me how to confidently present and defend an idea, especially when people are skeptical of your venture or idea. We were finally able to get a gym space but it was early in the morning and I was worried that people would not be willing to wake up early in the morning. We had a fairly decent turnout the first couple of</p>\n</div>\n</div>\n</div>\n</div>\n<div title=\"Page 2\">\n<div>\n<div>\n<div>\n<p>weeks, but we were noticing a steady decline in attendance each week and I decided to suspend the sessions and rethink a strategy to increase the attendance. I met heavy resistance with people telling me that the gym times were fine, that I just didn&rsquo;t organize it properly; many people told me that I would never get a gym space after school. However, I refused to take no for an answer without looking for alternatives first. I talked with various teachers, negotiated persistently, and constantly emailed various teachers trying to see if anyone would be willing to give me an after school gym space. Eventually, I had a gym space for Friday after school and had about two weeks to aggressively market this new time to generate as much anticipation as possible. My advertising was pervasive and relentless, it began with posters and announcements, but that was too conventional, so then I went to gym classes and groups of people and tried to get them excited about the event. I would walk up to groups of people that I didn&rsquo;t know, some friends or acquaintances who I thought played soccer and get them interested in the event, put a little gentle pressure on them. On the day of the session I was surprisingly nervous, due to the disappointing morning sessions, but my anxiety turned out to be in vain because the turnout surpassed everyone&rsquo;s expectations. There were so many people that we even had other teachers and students come and see why the gym was so animated. The event turned out to be a huge success and many students were asking when the next intramural session would be. I am looking forward to continuing the intramural soccer sessions in the New Year to a very receptive student body.</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\"><strong>Mental Health</strong></span></p>\n<p>As a student representative for the Halton Catholic District School Board Mental Health Leadership Committee (HCDSB-MHLC), I have many responsibilities assigned to me out of formality and tradition, yet very few of those roles actually have an impact on the lives of the students I am meant to represent. I decided that rather than simply attending meetings and</p>\n</div>\n</div>\n</div>\n</div>\n<div title=\"Page 3\">\n<div>\n<div>\n<div>\n<p>nodding my head in agreement, I wanted to have something to show for all the work I had done with the committee and actually be able to say that I had made a difference on the committee in some way. There was a young girl who was my age that recently committed suicide in our community due to online bullying and after noticing a trend in online bullying in my own school as well, I decided to create an anti-bullying campaign which targeted a sort of &ldquo;new wave&rdquo; of bullying that we are seeing in this social media age. The intent was to educate students to the dangers of their actions and to become more aware of the consequences and repercussions behind their actions. The first step was compiling all the work we had done with the MHLC with research done on my own into a presentation format which would be well received by students in grades 9 and 10, my primary demographic. When creating my presentation I really wanted to make it in a manner that would be really provocative, I added some, controversial yet appropriate pictures and texts that were about bullying into my presentation because I wanted to leave a resonating impact which would cause people to think.. I asked the school chaplain to mentor me by helping me revise and refine the presentation in a manner that would appease the adults, she was skeptical about some of the pictures but I assured her the purpose was to provoke thought not to offend. I also planned meetings with various student groups in the school to seek advice and ideas on what would engage the student body and also discuss how we could collaborate on other platforms to promote the campaign. The next process in my campaign was a variety of meetings and presentations with various teachers, counsellors and the school principal, showing them of my presentation and asking for permission to present this to classes. As expected, there was mixed receptions to the controversial elements of the presentation, while some thought it was inappropriate for a school setting others thought that it was perfectly appropriate for educating students, after a little discussion some elements were taken out; I however, was not</p>\n</div>\n</div>\n</div>\n</div>\n<div title=\"Page 4\">\n<div>\n<div>\n<div>\n<p>upset because my goal had been partially achieved and the presentation was generating conversation. The only disappointment was that I would have to wait until second semester before I could start presenting to classes. I am eagerly awaiting the opportunity to enlighten the students at my school with this innovative campaign.</p>\n</div>\n</div>\n</div>\n</div>\n<p><span style=\"text-decoration: underline;\"><strong>Tutor</strong></span></p>\n<p>&nbsp;</p>\n<p>The creation of my own tutoring company was hard but the good moments make it worth it [revise sentence]. Most of the things which I do in my life are a product of the serendipity of seemingly random events simultaneously intersecting in my life. As I was beginning my grade eleven year of high school I noticed that more of my friends were beginning to get minimum wage jobs and earning some extra cash, although I have always wanted financial independence, trying to squeeze school, athletics, extracurricular with a $9.65 an hour that wouldn&rsquo;t stimulate me or benefit me long term in any way was not particularly appealing to me, so I had to get creative. I also noticed that the new school year was full of students who were motivated to start the year with devotion to their studies and were eager to get tutors. The first opportunity began with an announcement over the PA system about anyone interested in tutoring a grade six student after school. The parent was originally reluctant about letting a student tutor her child because of his learning disabilities, so they suggested I have a trial first. I am typically very hard on myself and I believe that this is the best way to push lazy students who had potential, but his disability presented a different challenge thus a different strategy. The parents were impressed by how I was willing to go the extra mile to ensure that he understood the material and was engaged in the lessons. I would spend my own time working on supplementary activities and email his father suggestions and revisions to ensure he understood the lesson. His mother was very happy with my work, invited me to stay and over 18 months later I still tutor him twice a week. Once I felt ready to expand my venture I went to various schools and libraries putting up posters there to market my business, this was at first very frustrating because it was around October/November and I had no car so I would have to walk long distances to schools only for some posters to be taken down, and I wouldn&rsquo;t receive sufficient phone calls. However, persevering through these minor setbacks and advertising even more aggressively was successful because at my peakaround exam times- I was tutoring seven kids a week. I also learnt how to promote myself in a humble yet confidently reassuring way to parents, some who would blatantly ask me how smart I was and unfazed, I would tell them the marks I was getting in school and they would be satisfied, then I would deliver funny yet informative tutoring sessions to their students to ensure them that I was the right person for the task. I am currently enjoying tutoring and I hope to continue tutoring my current students through my final year of high school.</p>",
            "date_created": "2018-06-13T13:33:02.659480Z",
            "description": "My AEO University application for Ivey Business School 2014.\n           I applied to the software engineering and business dual degree program. Ivey places an emphasis on leadership so I really try to highlight how I demonstrate strong leadership in the examples I give in my essay.",
            "status": "accepted",
            "status_other": null,
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F2%2FIvey%20AEO%20Application%202014.pdf?alt=media&token=ee61734a-1667-4b24-8ee1-0ba178247b4b",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Tomiwa",
                "last_name": "Ademidun",
                "username": "tomiwa",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fvymkp8dx-tomiwa-ivey-profile-picture-cropped.jpg?alt=media&token=7ee689e8-6fc8-4ad0-a867-c1e20995f69d",
                "id": 1
            },
            "contributors": []
        },
        {
            "id": 11,
            "title": "Wellington ­Halton District Women Scholarship Application 2014",
            "slug": "wellington-halton-district-women-scholarship-application-2014",
            "body": "<div title=\"Page 1\">\r\n<h5 style=\"text-align: center;\"><strong>\"Is The Canadian Senate Relevant Today?\" (500 words)</strong></h5>\r\n<p>Canada is a glorious country with a rich history, progressive freedoms for it citizens and an extremely unique array of cultures. However, in such a country, it is important to have a government which, not only protects the integrity and history of this country but must also be able to make the over 6 million immigrants who have made this country home, feel comfortable in their new family.</p>\r\n<p>&nbsp;</p>\r\n<p>Arguably, no other branch of government addresses this need better than the Canadian senate. Before one can question the relevancy of the Canadian Senate, we must truly understand what their role in Canadian government is. The senate is appointed by the governor general based on advice from the Prime Minister, made up of 105 members from various regions in Canada, with the four major regions(Ontario, Quebec, the Maritime provinces, and the Western provinces) getting 24 seats each and the rest going to (Newfoundland and Labrador, the Northwest Territories, Yukon, and Nunavut).</p>\r\n<p>&nbsp;</p>\r\n<p>This is a very crucial set up because the involvement of both the Governor General and Prime Minister in the appointing process ensures that senators are appointed on a fair, bipartisan basis and that their interests will coincide with the welfare of the citizens and not with fulfilling a hidden political agenda. The fact that the four major regions also get an equal number of seats, regardless of population and GDP size ensures that the needs of all the regions are being fairly addressed. The main power from the senate however, comes from their ability to propose and pass new bills that affects the lives of millions of Canadians every day. Typically, we accept laws as rules and regulations without questioning why we have to follow these laws, however by understanding what role the senate plays in these</p>\r\n</div>\r\n<div title=\"Page 2\">\r\n<div>\r\n<div>\r\n<div>\r\n<p>rules, we can get a better understanding of what kind of values and morals they want to instill in Canadian culture. In present day Canada, the Senate&rsquo;s relevance is demonstrated through its ability to delicately balance both the preservation of the history and culture of Canada&rsquo;s heritage while welcoming and accommodating the needs of new Canadian immigrants and their culture. Such an example is Senator Jean&shy;Robert Gauthier's Bill S&shy;3's, An Act to amend the Official Languages Act which was passed into law in late November 2005. It was an amendment to the Official Languages Act that allows Canadians to take the federal government to court if it does not live up to its obligation to protect and promote both French and English minorities in Canada.</p>\r\n<p>&nbsp;</p>\r\n<p>Another bill which protects the rights of Canada&rsquo;s heritage is the Family Homes on Reserves and Matrimonial Interests or Rights Act which is an respecting family homes on First Nation reserves and matrimonial interests or rights to structures and lands on those reserves. Conversely, the Canadian senate maintains its credibility by not only protecting the rights of people who have lived in Canada for years but also by accommodating those who have recently called this country home.</p>\r\n<p>&nbsp;</p>\r\n<p>For example, the Immigration and Refugee Protection Act which received Royal Assent in November 2001. This act ensured that people who had proven they would be able to make contributions to Canadian society would have a good chance of entering Canada, but also that those who were less fortunate and seeking to escape the harsh conditions of their country would also have a fair chance at starting a better life in Canada. I myself am here today in this country as a Canadian citizen, born in Nigeria due to this act, and I have the Canadian senate partly to thank for that.</p>\r\n<p>&nbsp;</p>\r\n<p>Whenever individuals question the relevancy of the Canadian Senate, one must explain to them that their ability to ensure the protection of the rights and freedoms of past, present, and future Canadians is what makes the Senate an important part of this wonderful country called Canada.</p>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n<div title=\"Page 3\">\r\n<div>\r\n<div>\r\n<p>&nbsp;</p>\r\n<p><strong>Community Involvement Extra&shy;Curricular Activities</strong></p>\r\n<ul>\r\n<li>\r\n<p>Senior soccer team member</p>\r\n</li>\r\n<li>\r\n<p>Halton Catholic District School board Student Senate member</p>\r\n</li>\r\n<li>\r\n<p>DECA club</p>\r\n<p><strong>Community Activities</strong></p>\r\n</li>\r\n</ul>\r\n<ul>\r\n<li>\r\n<p>Erin Mills Eagles OYSL soccer team</p>\r\n</li>\r\n<li>\r\n<p>Audio &amp; Visual department church volunteer</p>\r\n</li>\r\n<li>\r\n<p>Academic Tutor</p>\r\n</li>\r\n<li>\r\n<p>Town of Milton Camp Counsellor</p>\r\n<p><strong>Leadership Roles</strong></p>\r\n</li>\r\n</ul>\r\n<ul>\r\n<li>\r\n<p>Student Representative Halton Mental Health Leadership Committee</p>\r\n</li>\r\n<li>\r\n<p>Black History Month Organizer and co&shy;host</p>\r\n</li>\r\n<li>\r\n<p>Religion Retreat Leader</p>\r\n</li>\r\n<li>\r\n<p>Student Athletic Council Executive</p>\r\n</li>\r\n</ul>\r\n</div>\r\n</div>\r\n</div>\r\n<div title=\"Page 4\">\r\n<div>\r\n<div>\r\n<div>\r\n<p>&nbsp;</p>\r\n<p><strong>Future Plans</strong></p>\r\n<p>After I graduate high school my plan is to enroll at the University of Western Ontario or Queen&rsquo;s University in the faculty of either Engineering or Business/Commerce at each school. I have already gained acceptance into three of my four chosen programs and am just waiting on an acceptance from the University of Western Ontario Ivey AEO (Advanced Entry Opportunity) business program, this program would allow me to get a dual degree in both Engineering and Honours Business Administration.</p>\r\n<p>&nbsp;</p>\r\n<p>The two faculties I&rsquo;m applying to both have the highest tuition costs in their respective universities and with two younger siblings in my house who also plan on attending University within the next five years, financial resources are strained in my family. My parents have invested a lot in me and my sisters, sacrificing everything we had in Nigeria to bring us to a new country to start a new life. They have invested a lot of money in not only my academic career but also in my athletic pursuits and interests, in the process sacrificing some of their own interests as well.</p>\r\n<p>I have promised myself that I will do everything I can to let my parents know that their sacrifices have not been in vain, which is why I have invested so much time and effort into getting awarded a scholarship to not only ease the financial burden on them, but also as a means of showing my gratitude towards them.</p>\r\n<p>&nbsp;</p>\r\n<p>The attitude of gratitude and giving back is another reason why I want to pursue the fields of engineering or business; I want to use the skills which I have learnt in University towards solving some of the infrastructural problems that we face in Canada but especially my home country of Nigeria. I also believe that a background in finance, would provide me with a better understanding of some of the economic problems that face third and second world countries and ultimately apply these skills to improve the lives of those affected by poverty and corruption in places like India, Nigeria, and Brazil.</p>\r\n<p>&nbsp;</p>\r\n<p>I would ask the Wellington&shy;Halton District Women&rsquo;s institute to provide me with this award so that they may help me to help others.</p>\r\n</div>\r\n</div>\r\n</div>\r\n</div>",
            "date_created": "2018-06-10T15:55:15Z",
            "description": "I wrote this essay in 2014, the topic was \"Is the Canadian Senate relevant today?\". I don't think I get selected for this scholarship 😕. Though, I can't remember.",
            "status": "declined",
            "status_other": "",
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F11%2FWellington%20%C2%ADHalton%20District%20Women%20Scholarship%20Application.pdf?alt=media&token=f896653d-1b82-4579-9be6-5bbf5110b5ec",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Tomiwa",
                "last_name": "Ademidun",
                "username": "tomiwa",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fvymkp8dx-tomiwa-ivey-profile-picture-cropped.jpg?alt=media&token=7ee689e8-6fc8-4ad0-a867-c1e20995f69d",
                "id": 1
            },
            "contributors": []
        },
        {
            "id": 1,
            "title": "Ivey Business School AEO2 Application 2016",
            "slug": "ivey-business-school-aeo2-application-2016",
            "body": "<p dir=\"ltr\">Please prepare an essay (500 words) outlining the following in this paragraph order. Feel free to copy and paste from other parts of your application where appropriate.</p>\n<p dir=\"ltr\">&nbsp;</p>\n<p dir=\"ltr\"><strong>Paragraph 1</strong></p>\n<p dir=\"ltr\">Outline your intended career goal after completing the Ivey HBA. Be as specific as possible indicating industry as well.</p>\n<ul>\n<li dir=\"ltr\">Tech Industry: agriculture, education (though it&rsquo;s in a bubble, there is long-term value. I have studied the industry very closely)</li>\n<li dir=\"ltr\">Finance: true value-integrity investing, realized lack of social value in investment banking and other short-term focused paths</li>\n</ul>\n<p dir=\"ltr\"><strong>Paragraph 2</strong></p>\n<p dir=\"ltr\">Highlight key examples of your academic and employment success to date making you a strong candidate to receive an award.</p>\n<ul>\n<li dir=\"ltr\">Dean&rsquo;s honor list while on varsity team (1st year) and overloading (2nd year)</li>\n<li dir=\"ltr\">Started tutor business (pull up older Ivey application)</li>\n</ul>\n<p dir=\"ltr\"><strong>Paragraph 3</strong></p>\n<p dir=\"ltr\">Highlight key examples of your leadership abilities and extracurricular involvement.</p>\n<ul>\n<li dir=\"ltr\">Schedy App</li>\n<li dir=\"ltr\">Church youth group</li>\n<li dir=\"ltr\">(refer to the other essays for guidance on what to write)</li>\n</ul>\n<p dir=\"ltr\">Scholarship</p>\n<p dir=\"ltr\">I spend a lot of my time thinking about what the future will look like and how to position myself in a way that I can be relevant to my society around me. I believe that the technology industry, and more specifically the intersection between agriculture and education will provide me with the best platform to impact society in a meaningful way. I am very cautious of the irrational exuberance which pervades the technology industry, however I have studied the industry very closely and though I see many disappointments in the short-term, I see many great things happening in this space in the long-term, which is truly what matters. As an immigrant from a third-world country, Nigeria, and through the diligence of my parents, I have a deep belief in the value of a quality education and I have witnessed both vicariously and personally the tremendous impact that education provides for upward mobility. I am most passionate about creating a truly meritocratic society and I believe I can best actualize this through my work in education.</p>\n<p dir=\"ltr\">&nbsp;</p>\n<p dir=\"ltr\">When I am in a retrospective mood, I often think back to all the challenges I have been through and every time I question why I put myself through such mental and physical stress, I am quickly satisfied by the growth I had felt after enduring through such turbulent periods. When I came to visit Western in grade 12 two memories stick in my mind: the amount of time I spent trying to find upper-year students who had played a varsity sport, while in engineering and were trying to get into Ivey, as some sort of reassurance that it was even possible. I also vividly recall the academic counsellor at Western telling me and my father that it would be &ldquo;unless you are some sort of genius, it's almost impossible&rdquo;, while I am certainly very far from being a genius, I am very proud to say that I was able to get on the Dean&rsquo;s Honor List while maintaining a full engineering course load and retaining my athletic scholarship for Men&rsquo;s Varsity Soccer.</p>\n<p dir=\"ltr\">&nbsp;</p>\n<p dir=\"ltr\">Another example of my extracurricular involvement includes a scheduling app which I lead to create amongst a team of 5 students. The app is called Schedy and it is a web app which students use to schedule appointments with their professors. I particularly enjoyed this project because of the broad range of tasks which I was responsible for. The technical and creative aspect were stimulated because I wrote the code for both the front-end and back-end of the app. I also enjoyed the latitude of problem solving required when thinking of strategy and concepts like the economics of running AdSense on the platform or the psychological processes that consumers go through when using an app. I also had a lot of fun leading and inspiring my tight-knit team of five around a common goal and motivating them to work long and hard to create a product which people would find useful.</p>",
            "date_created": "2018-06-09T23:09:41.047955Z",
            "description": "My AEO2 University application for Ivey Business School 2016.\nThis is the application I submitted after my 2nd year of university to keep my spot in the HBA1 as part of the AEO program.\n           I applied to the software engineering and business program. \n\nThe admissions person I talked to mentioned they cared a lot about community involvement and leadership which I tried to highlight in the first 2 examples.",
            "status": "accepted",
            "status_other": null,
            "essay_source_url": "https://firebasestorage.googleapis.com/v0/b/atila-7.appspot.com/o/user-profiles%2F1%2Fessays%2F1%2FIvey%20AEO2%20Application.pdf?alt=media&token=a8058c38-6baa-4e64-addf-6c0eb8f56e89",
            "published": true,
            "up_votes_count": 0,
            "down_votes_count": 0,
            "up_votes_id": [],
            "down_votes_id": [],
            "metadata": {},
            "related_items": null,
            "scholarship": null,
            "user": {
                "first_name": "Tomiwa",
                "last_name": "Ademidun",
                "username": "tomiwa",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fvymkp8dx-tomiwa-ivey-profile-picture-cropped.jpg?alt=media&token=7ee689e8-6fc8-4ad0-a867-c1e20995f69d",
                "id": 1
            },
            "contributors": []
        },
        {
            "slug": "mojisola-rufai-and-victoria-ademidun-scholarship-application-by-tomiwa-ademidun-x2fwt5ch",
            "title": "Mojisola Rufai and Victoria Ademidun Scholarship Application by Tomiwa Ademidun",
            "user": {
                "user": 1,
                "first_name": "Tomiwa",
                "last_name": "Ademidun",
                "username": "tomiwa",
                "profile_pic_url": "https://firebasestorage.googleapis.com/v0/b/atila-prod.appspot.com/o/user-uploads%2Fuser-profile-pictures%2F1%2Fvymkp8dx-tomiwa-ivey-profile-picture-cropped.jpg?alt=media&token=7ee689e8-6fc8-4ad0-a867-c1e20995f69d"
            },
            "scholarship": {
                "id": 719,
                "name": "Mojisola Rufai and Victoria Ademidun Scholarship",
                "slug": "mojisola-rufai-and-victoria-ademidun-scholarship-iy1bucly",
                "specific_questions": [
                    {
                        "key": "how-has-growing-up-in-a-low-income-family-impacted",
                        "type": "long_answer",
                        "question": "How has growing up in a low-income family impacted you?"
                    },
                    {
                        "key": "what-are-your-plans-and-goals-for-the-future",
                        "type": "long_answer",
                        "question": "What are your plans and goals for the future?"
                    },
                    {
                        "key": "parent-1-or-primary-caregiver-2019-income",
                        "type": "short_answer",
                        "question": "Parent 1 (or primary caregiver) 2019 Income"
                    },
                    {
                        "key": "parent-2-or-secondary-caregiver-2019-income",
                        "type": "short_answer",
                        "question": "Parent 2 (or secondary caregiver) 2019 Income"
                    },
                    {
                        "key": "number-of-people-in-your-household",
                        "type": "short_answer",
                        "question": "Number of people in your household?"
                    },
                    {
                        "key": "do-you-confirm-that-you-qualify-for-government-of",
                        "type": "checkbox",
                        "question": "Do you confirm that you qualify for Government of Canada's Low income cut-offs (see scholarship description for more details)"
                    }
                ],
                "user_profile_questions": [
                    {
                        "key": "first_name"
                    },
                    {
                        "key": "last_name"
                    },
                    {
                        "key": "email"
                    }
                ],
                "deadline": "2021-01-31T23:59:00Z",
                "funding_amount": "1666.00",
                "is_blind_applications": true,
                "is_winner_selected": false
            },
            "description": "My long term vision beyond my time at Queen’s University involves seeking\nlucrative opportunities in emerging markets like China, Dubai, and Nigeria. My main interests\ninclude property development and alternative energy sources, industries which I hope to become\nmore exposed to during my time here at Queen’s.",
            "body": "<h3>What are your plans and goals for the future?</h3><p>My long term vision beyond my time at Queen’s University involves seeking</p><p>lucrative opportunities in emerging markets like China, Dubai, and Nigeria. My main interests</p><p>include property development and alternative energy sources, industries which I hope to become</p><p>more exposed to during my time here at Queen’s. Initially, I would love to work with a property</p><p>development firm or a renewable energy company in one of these countries, become acquainted</p><p>with the business culture and eventually start my own business that will target the growing</p><p>“noveau riche” demographic in these countries.&nbsp;</p><p>&nbsp;</p><p>It is quite evident how a degree in business or engineering would benefit me if I decided to go this route; but I also believe that a Queen’s</p><p>degree will be even more beneficial due to its recognition around the world and the popular</p><p>exchange program in its third year commerce program which would help me develop contacts</p><p>around the world. I truly believe that a degree from Queen’s University will play an integral part</p><p>in me achieving my goals and making a positive contribution to society.</p><p>&nbsp;</p><h3>How has growing up in a low-income family impacted you?</h3><p>My primary goal during my time at <a href=\"https://atila.ca/scholarship/the-olumide-and-aramide-ademidun-scholarship-j4m72msw\">Queen's University</a> is to broaden my perspective and</p><p>motivate my desire for proactive change in the society around us. Without indulging in too many</p><p>clichés and hollow phrases, I want my time at Queen's to include moments where I am constantly</p><p>being inspired and challenged by the intelligent people that are part of the Queen's community. I</p><p>want to leave with a degree that I hope will give me a competitive advantage in the global job</p><p>market and access to an alumni network that will benefit me in my professional endeavors.</p>",
            "published": true,
            "is_anonymous": false,
            "is_anonymous_essay": false,
            "first_name_code": "Olive",
            "last_name_code": "Shepherd"
        }
    ]
}